Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: When you add a `Spacer` to a `VStack`, the spacer expands to fill in any remaining vertical space.
de: Wenn du `Spacer` zu `VStack` hinzufügst, wird der Abstandshalter erweitert, um den vertikal verfügbaren Platz zu füllen.
es: Cuando se añade un `Spacer` a un `VStack`, el separador se amplía para rellenar el espacio vertical que pueda quedar.
es_419: Al agregar `Spacer` a `VStack`, el espaciador se expande para llenar cualquier espacio vertical restante.
fr: Quand tu ajoutes un `Spacer` à une `VStack`, lʼespace sʼagrandit pour remplir lʼespace vertical restant.
it: Quando aggiungi `Spacer` a `VStack`, lo spaziatore si espande per riempire gli spazi vuoti verticali rimanenti.
nl: Wanneer je een `Spacer` aan een `VStack` toevoegt, vult de spacer de resterende verticale ruimte.
pt: Quando você adiciona um `Spacer` a um `VStack`, o espaçador se expande para preencher qualquer espaço vertical remanescente.
sv: När du lägger till en`Spacer` i en `VStack` expanderar Spacer så att den fyller allt eventuellt återstående vertikala utrymme.
th: เมื่อคุณเพิ่ม `Spacer` ไปยัง `VStack` ที่ว่างจะขยายเพื่อเติมเต็มพื้นที่แนวตั้งที่เหลืออยู่
tr: Bir `VStack`’e bir `Spacer` eklediğinde aralayıcı kalan düşey alanı dolduracak şekilde genişler.
zh_cn: 将 `Spacer` 添加到 `VStack` 时，留白器会扩展以填满任何剩余的垂直空间。
zh_tw: 當你在 `VStack` 中加入 `Spacer` 時，墊片會擴展來填滿任何剩餘的垂直空間。

source: Add a `Spacer` above and below the sleep value.
de: Füge `Spacer` ober- und unterhalb des Schlafwerts hinzu.
es: Añade un `Spacer` por encima y por debajo del valor de sueño.
es_419: Agrega un `Spacer` encima y debajo del valor de sueño.
fr: Ajoute un `Spacer` au-dessus et en dessous de la valeur de sommeil.
it: Aggiungi `Spacer` sopra e sotto il valore del sonno.
nl: Voeg een `Spacer` boven en onder de slaapwaarde toe.
pt: Adicione um `Spacer` acima e abaixo do valor do sono.
sv: Lägg till en `Spacer` ovanför och nedanför sömnvärdet.
th: เพิ่ม `Spacer` ด้านบนและด้านล่างค่าการนอนหลับ
tr: Uyuma değerinin üst ve alt tarafına bir `Spacer` ekle.
zh_cn: 在睡眠值上方和下方添加一个 `Spacer`。
zh_tw: 在睡眠值上方和下方加入一個 `Spacer`。

source: Both spacers will expand equally to keep the sleep value centered in the card.
de: Beide Abstandshalter sind gleich breit, damit der Schlafwert in der Karte zentriert bleibt.
es: Ambos separadores se ampliarán en la misma proporción para mantener el valor de sueño centrado en la tarjeta.
es_419: Ambos espaciadores se expandirán de forma equitativa para mantener el valor de sueño centrado en la carta.
fr: Les deux espaces s’agrandiront de manière égale pour que la valeur de sommeil reste centrée dans la carte.
it: Entrambi gli spaziatori si espanderanno in modo uguale per mantenere il valore di sonno centrato nella scheda.
nl: Beide `Spacers` nemen even veel ruimte in beslag om de slaapwaarde gecentreerd te houden in de kaart.
pt: Ambos os espaçadores se expandirão igualmente para manter o valor do sono centralizado no cartão.
sv: Båda `Spacer`-mellanrummen expanderar lika mycket för att hålla sömnvärdet centrerat på kortet.
th: ที่ว่างทั้งสองตำแหน่งจะขยายเท่าๆ กันเพื่อทำให้ค่าการนอนหลับอยู่ตรงกลางบัตรเสมอ
tr: Her iki aralayıcı da uyuma değerini kartta ortalanmış tutmak için eşit miktarda uzar.
zh_cn: 这两个留白器会同等扩展，保持睡眠值位于卡片的中心。
zh_tw: 兩個墊片會均勻擴展，來保持睡眠值在卡片的中心。

source: Earlier, you added a `.padding()` modifier to expand the gap between the card title and sleep value. Now that you’ve added `Spacer` views around the sleep value, you no longer need that extra padding.
de: Du hast vor Kurzem einen `.padding()`-Modifikator hinzugefügt, um den Abstand zwischen dem Kartentitel und dem Schlafwert zu vergrößern. Nachdem du nun den Schlafwert zwischen `Spacer`-Ansichten platziert hast, ist der Extra-Randabstand überflüssig.
es: Antes has añadido un modificador `.padding()` para ampliar el hueco existente entre el título de la tarjeta y el valor de sueño. Ahora que has añadido vistas con `Spacer` en torno al valor de sueño, ya no necesitas ese relleno extra.
es_419: Antes habías agregado el modificador `.padding()` para expandir el espacio entre el título de la carta y el valor de sueño. Ahora que agregaste las visualizaciones `Spacer` alrededor del valor de sueño, ya no necesitas el relleno adicional.
fr: Rappelle-toi que tu as ajouté un modificateur `.padding()` pour agrandir le blanc entre le titre de la carte et la valeur de sommeil. Maintenant que tu as ajouté les vues `Spacer` autour de la valeur de sommeil, tu n’as plus besoin de ce remplissage supplémentaire.
it: In precedenza, hai aggiunto un modificatore `.padding()` per espandere lo spazio tra il titolo della scheda e il valore di sonno. Ora che hai aggiunto le viste `Spacer` intorno al valore di sonno, non è più necessaria la spaziatura aggiuntiva.
nl: Je hebt eerder een `.padding()`-modifier toegevoegd om de ruimte tussen de kaarttitel en de slaapwaarde te vergroten. Nu je `Spacer`-weergaven rond de slaapwaarde hebt toegevoegd, heb je geen extra padding meer nodig.
pt: Anteriormente, você adicionou um modificador `.padding()` para expandir o espaço entre o título do cartão e o valor do sono. Agora que você adicionou as visualizações `Spacer` ao redor do valor de sono, esse preenchimento extra não é mais necessário.
sv: Tidigare lade du till en `.padding()`-modifierare för att expandera mellanrummet mellan kortets titel och sömnvärdet. Nu när du har lagt till `Spacer`-vyer runt sömnvärdet behöver du inte längre det extra tomrummet.
th: ก่อนหน้านี้ คุณได้เพิ่มปุ่มปรับค่า `.padding()` เพื่อขยายช่องว่างระหว่างชื่อบัตรและค่าการนอนหลับ ตอนนี้เมื่อคุณเพิ่มมุมมอง `Spacer` รอบค่าการนอนหลับแล้ว คุณไม่จำเป็นต้องใช้การขยายขอบเพิ่มเติมอีกต่อไป
tr: Daha önce, kart başlığı ile uyuma değeri arasındaki boşluğu genişletmek için bir `.padding()` niteleyicisi eklemiştin. Artık uyuma değerinin etrafına `Spacer` görüntülerini eklediğine göre bu ekstra boşluğa ihtiyacın kalmadı.
zh_cn: 之前，你添加了 `.padding()` 修饰符来扩展卡片标题和睡眠值之间的间隔。现在，你在睡眠值周围添加了 `Spacer` 视图，意味着不再需要这个额外的填补了。
zh_tw: 你之前加入了一個 `.padding()` 修飾符來擴展卡片標題和睡眠值之間的間隙。現在你已經在睡眠值周圍加入了 `Spacer` 顯示區，不再需要額外的填充。

source: Remove the highlighted `.padding()`, so it doesn’t make your text appear off-center.
de: Entferne die hervorgehobene Instanz von `.padding()`, damit der Text nicht mehr aus der Mitte verschoben wird.
es: Elimina el `.padding()` resaltado, para que no haga que el texto aparezca descentrado.
es_419: Elimina el modificador `.padding()` resaltado para que no ocasione que tu texto no esté centrado.
fr: Supprime le `.padding()` en surbrillance pour que ton texte ne sʼaffiche pas décentré.
it: Rimuovi `.padding()` evidenziato, in modo che il testo non venga visualizzato decentrato.
nl: Verwijder de gemarkeerde `.padding()`, zodat je tekst weer in het midden wordt weergegeven.
pt: Remova o `.padding()` destacado para que o texto não fique descentralizado.
sv: Ta bort markerad `.padding()` så att texten inte blir förskjuten.
th: เอา `.padding()` ที่ไฮไลท์ออก เพื่อให้ข้อความของคุณแสดงอยู่ตรงกลาง
tr: Metninin ortalanmamış görünmemesi için vurgulanan `.padding()`’i sil.
zh_cn: 移除高亮标记的 `.padding()`，这样它就不会让文本偏离中心。
zh_tw: 移除反白的 `.padding()`，讓它不會使得文字偏離中心顯示。

source: When you added the `Spacer` around your sleep value, the card title and stepper were pushed to the top and bottom edges of the card. However, those are just a bit too close to the edges.
de: Durch das Platzieren deines Schlafwerts zwischen `Spacer`-Instanzen wurden der Kartentitel und der Stepper ganz an den oberen und unteren Rand deiner Karte geschoben. Das ist jedoch ein bisschen zu nah am Rand.
es: Cuando añadiste el `Spacer` en torno al valor de sueño, el título de la tarjeta y el secuenciador se trasladaron hasta los bordes superior e inferior de la tarjeta. No obstante, quedaban un puntito demasiado cerca de los bordes.
es_419: Cuando agregaste `Spacer` alrededor del valor de sueño, el título de la carta y el incremento se colocaron en los bordes superior e inferior de la carta. Sin embargo, están demasiado cerca de los bordes.
fr: Lorsque tu as ajouté le `Spacer` autour de ta valeur de sommeil, le titre de la carte et le stepper ont été poussés jusqu’aux bords supérieur et inférieur de la carte. Cependant, ils sont juste un peu trop près des bords.
it: Dopo aver aggiunto `Spacer` intorno al valore di sonno, il titolo della scheda e lo stepper sono stati spostati nei bordi superiore e inferiore della scheda. Tuttavia, si trovano un po’ troppo vicini ai bordi.
nl: Toen je de `Spacer` rond de slaapwaarde toevoegde, werden de kaarttitel en de stepper helemaal naar de boven- en onderrand van de kaart geduwd. Ze staan echter een beetje te dicht bij de rand.
pt: Quando você adicionou o `Spacer` ao redor do valor do sono, o título do cartão e o incremento foram empurrados para as margens superior e inferior do cartão. No entanto, eles estão perto demais das margens.
sv: När du lade till `Spacer` runt sömnvärdet puffades kortets titel och stegaren hela vägen till över- och nederkanterna på kortet. De hamnade dock lite för nära kanterna.
th: เมื่อคุณเพิ่ม `Spacer` รอบค่าการนอนหลับของคุณ ชื่อบัตรและค่าเป็นขั้นจะถูกผลักไปที่ขอบด้านบนและด้านล่างของบัตร แต่รายการเหล่านั้นอยู่ใกล้ขอบมากเกินไปหน่อย
tr: `Spacer`’ı uyuma değerinin etrafına eklediğinde kart başlığı ve adımlayıcı kartın üst ve alt kenarlarına doğru itilir. Ancak bunlar da kenarlara çok yakın oldu.
zh_cn: 在睡眠值周围添加 `Spacer` 时，卡片标题和步进器会被推至卡片的顶部和底部边缘，但这有点太靠近边缘了。
zh_tw: 當你在睡眠值周圍加入 `Spacer` 時，卡片標題和步進器被推到卡片的頂部和底部邊緣。但是，這些距離邊緣有點太近了。

source: Add padding around your `VStack` to create a gap around the edge of the card:
de: Füge um `VStack` einen Abstand hinzu, um einen Rahmen um den Rand der Karte hinzuzufügen:
es: Añade relleno en torno a la pila `VStack` para crear un espacio alrededor del borde de la tarjeta:
es_419: Agrega relleno alrededor de tu `VStack` para crear un espacio alrededor del borde de la carta:
fr: Ajoute un remplissage autour de ta `VStack` pour créer un blanc autour du bord de la carte :
it: Aggiungi la spaziatura interna attorno a `VStack` per creare uno spazio vuoto attorno al bordo della scheda:
nl: Voeg padding rond de `VStack` toe om ruimte langs de rand van de kaart te creëren:
pt: Adicione preenchimento ao redor do `VStack` para criar um espaço ao redor da margem do cartão:
sv: Lägg till tomrum runt `VStack` för att skapa ett tomrum runt kanten på kortet:
th: เพิ่มการขยายขอบรอบ `VStack` ของคุณเพื่อสร้างช่องว่างรอบๆ ขอบบัตร:
tr: Kartın kenarında bir boşluk yaratmak için `VStack`’inin etrafına boşluk ekle:
zh_cn: 在 `VStack` 周围添加填补，来在卡片的边缘周围创建间隔：
zh_tw: 在你的 `VStack` 周圍加入填充來在卡片的邊緣四周產生一個空隙：

source: Woohoo! You’re done. Now your card looks exactly like the mock-up from the designer.
de: Hurra! Du hast es geschafft. Jetzt sieht deine Karte exakt wie das Modell der Designabteilung aus!
es: ¡Genial! ¡Ya lo tienes! Ahora la tarjeta es exactamente igual al boceto del equipo de diseño.
es_419: ¡Increíble, ya terminaste! Ahora tu carta se ve exactamente igual que el modelo del diseñador.
fr: Super ! Tu as terminé. À présent, ta carte ressemble exactement à la maquette du concepteur.
it: Evviva, hai finito! Ora la scheda ha esattamente lo stesso aspetto del modello del designer.
nl: Bravo! Je bent klaar! Je kaart ziet er nu precies hetzelfde uit als het model van de ontwerper.
pt: Maravilha! Você terminou. Agora o cartão está exatamente igual ao modelo da pessoa responsável pelo design.
sv: Hurra! Du är klar. Nu ser kortet ut exakt som modellen från designern.
th: ไชโย! คุณทำเสร็จแล้ว ตอนนี้บัตรของคุณดูเหมือนตัวอย่างจำลองจากนักออกแบบทุกอย่าง
tr: İşte bu! Bitirdin. Şimdi kartın tam tasarımcının modeli gibi görünüyor.
zh_cn: 哇呼！你做到了。你的卡片现在看起来与设计师的模型完全一致。
zh_tw: 哇！你完成了。現在，你的卡片看起來和設計者的模型完全相同。

source: VStack { Text(isEditing ? "How many hours did you sleep?" : "Hours Slept") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Hours Slept", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
de: VStack { Text(isEditing ? "Wie viele Stunden hast du geschlafen?" : "Schlafstunden") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Schlafstunden", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
es: VStack { Text(isEditing ? "¿Cuántas horas has dormido?" : "tiempo de sueño") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Hours Slept", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
es_419: VStack { Text(isEditing ? "¿Cuántas horas dormiste?" : "Horas de sueño") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Horas de sueño", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
nl: VStack { Text(isEditing ? "Hoeveel uur heb je geslapen?" : "Hours Slept") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Hours Slept", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
pt: VStack { Text(isEditing ? "Quantas horas você dormiu?" : "Horas Dormidas") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Horas Dormidas", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
sv: VStack { Text(isEditing ? "Hur många timmar sov du?" : "Sömnlängd") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Sömnlängd", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
th: VStack { Text(isEditing ? "คุณนอนหลับกี่ชั่วโมง" : "ชั่วโมงที่นอนหลับ") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Hours Slept", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
tr: VStack { Text(isEditing ? "Kaç saat uyudun?" : "Uyunan Saat") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Uyunan Saat", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
zh_cn: VStack { Text(isEditing ? "你的睡眠小时数是多少？" : "睡眠小时数") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("睡眠小时数", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()
zh_tw: VStack { Text(isEditing ? "你睡了幾個小時？" : "睡眠時數") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) Spacer() Text("\(Int(value))") .modifier(FontStyle(size: 50)) Spacer() if isEditing { Stepper("Hours Slept", value: $value, in: 0...12, step: 1) .labelsHidden() } } .frame(minHeight: 100, maxHeight: 200) .padding()

# GuideBook..Guide0..StepMy Journal..TaskGroup1..Taskmoodtracker..title
source: Fix the mood tracker view
de: Die Stimmungstracker-Ansicht korrigieren
es: Corrige la vista de seguimiento del estado de ánimo
es_419: Arreglar la visualización del sensor de estado de ánimo
fr: Correction de la vue du moniteur d’humeur
it: Sistemare la vista del tracker dell’umore
nl: De stemmingstrackerweergave corrigeren
pt: Corrija a visualização do rastreador de humor
sv: Fixa humörspårarvyn
th: แก้ไขมุมมองตัวติดตามอารมณ์
tr: Ruh hâli izleyici görüntüsünü düzeltme
zh_cn: 修复心情跟踪器视图
zh_tw: 修復心情追蹤器

source: Congratulations! You’re now in charge of fixing the full-card mood tracker according to the design mock-up.
de: Herzlichen Glückwunsch! Jetzt ist es deine Aufgabe, den Stimmungstracker in ganzer Kartengröße mithilfe des Designmodells zu reparieren.
es: ¡Enhorabuena! Ahora tienes el encargo de adaptar al boceto el diseño de tarjeta completa de la app de seguimiento del estado de ánimo.
es_419: ¡Felicidades! Ahora estás a cargo de corregir la carta completa del monitor de estado de ánimo según el modelo de diseño.
fr: Félicitations ! Tu as maintenant pour responsabilité de corriger le moniteur d’humeur « carte entière » selon la maquette de conception.
it: Congratulazioni! Ora hai l’incarico di sistemare il tracker dell’umore a scheda intera secondo il modello del design.
nl: Gefeliciteerd! Het is nu je taak om de stemmingstracker in de hele kaart aan te passen aan het model.
pt: Parabéns! Agora você é responsável por corrigir o cartão inteiro do rastreador de humor de acordo com o modelo do design.
sv: Grattis! Nu får du axla ansvaret att fixa humörspåraren i helkortsformat enligt designmodellen.
th: ยินดีด้วย! ตอนนี้คุณจะได้รับหน้าที่ในการแก้ไขตัวติดตามอารมณ์แบบเต็มบัตรตามตัวอย่างจำลองการออกแบบ
tr: Tebrikler! Artık tam kart ruh hâli izleyiciyi tasarım modeline göre düzeltme işi sende.
zh_cn: 恭喜！现在你将负责根据设计模型修复完整卡片大小的心情跟踪器。
zh_tw: 恭喜！你現在負責根據設計模型來修正完整卡片的心情追蹤器。

source: Try matching the mock-up yourself, using the following hints if you need them.
de: Versuche auf eigene Faust, das Modell nachzubilden. Falls du nicht weiterkommst, kannst du die folgenden Tipps verwenden.
es: Intenta ajustar el boceto sin ayuda, usando estas pistas si las necesitas.
es_419: Intenta hacer coincidir el modelo por tu cuenta, y usa las siguientes pistas si las necesitas.
fr: Essaie d’adapter toi-même la maquette, en t’aidant des astuces suivantes si besoin.
it: Prova ad abbinare gli elementi al modello, utilizzando i seguenti suggerimenti se ne hai bisogno.
nl: Probeer het model na te maken. Gebruik de volgende tips als je vast komt te zitten.
pt: Tente, por conta própria, deixá‑lo igual ao modelo. Use as dicas a seguir se precisar.
sv: Försök att matcha modellen på egen hand. Använd följande tips om det behövs.
th: ลองจับคู่ตัวอย่างจำลองด้วยตัวเอง โดยใช้คำใบ้ต่อไปนี้หากคุณต้องการ
tr: Kendin modelle eşleştirmeyi dene. İhtiyacın olursa aşağıdaki ipuçlarını kullan.
zh_cn: 尝试自己来匹配模型，需要时可使用以下提示。
zh_tw: 嘗試自己比對模型，如有需要，請使用以下提示。

source: The spacing and alignment of the design looks off compared to the mock-up. Start by setting `height` of your card.
de: Die Abstände und die Ausrichtung des Designs sehen im Vergleich zum Modell komisch aus. Lege als Erstes `height` (Höhe) für die Karte fest.
es: El espaciado y la alineación del diseño no se parecen mucho al boceto. Empieza por ajustar la altura, el valor de `height`, de la tarjeta.
es_419: El espaciado y la alineación de tu diseño no parecen coincidir con el modelo. Empieza estableciendo el alto (`height`) de tu carta.
fr: L’espacement et l’alignement de ta conception semblent décalés par rapport à la maquette. Commence par définir la `height` de ta carte.
it: La spaziatura e l’allineamento del design sono diversi rispetto al modello. Inizia impostando `height` della scheda.
nl: De afstand en uitlijning van het ontwerp zien er anders uit dan het model. Stel om te beginnen de `height` van de kaart in.
pt: O espaçamento e o alinhamento do design parecem ser diferentes do modelo. Comece definindo o `height` do cartão.
sv: Mellanrummen och kantjusteringen i designen stämmer inte riktigt med modellen. Börja med att ange kortets `height`.
th: การกำหนดระยะห่างและการจัดแนวของการออกแบบดูผิดเพี้ยนไปจากตัวอย่างจำลอง ให้เริ่มต้นโดยตั้งค่า `height` ของบัตรของคุณ
tr: Tasarımdaki aralık ve hizalama modele göre biraz bozuk görünüyor. Kartının yüksekliğini (`height`) ayarlayarak başla.
zh_cn: 设计的间距和对齐看起来和模型不太一样。第一步先设定卡片的 `height`。
zh_tw: 和模型相比，設計的間距和對齊方式看起來不太好。首先，請設定卡片的 `height`。

source: Consider the different tools you’ve learned, such as `Spacer`, `.frame(minHeight:maxHeight:)`, `.padding()`, and think of how you can use them to improve the layout.
de: Berücksichtige die verschiedenen Werkzeuge wie z. B. `Spacer`, `.frame(minHeight:maxHeight:)` und `.padding()`, die du kennengelernt hast, und überlege dir, wie du sie nutzen kannst, um das Layout zu verbessern.
es: Repasa las distintas herramientas que has aprendido, como `Spacer`, `.frame(minHeight:maxHeight:)` y `.padding()`, y piensa cómo puedes usarlas para mejorar la disposición.
es_419: Piensa en las distintas herramientas que has aprendido, como `Spacer`, `.frame(minHeight:maxHeight:)` y `.padding()`, y en cómo se pueden usar para mejorar la disposición.
fr: Pense aux différents outils que tu as découverts, comme `Spacer`, `.frame(minHeight:maxHeight:)` et `.padding()`, et réfléchis à la manière dont tu peux les utiliser pour améliorer la disposition.
it: Pensa ai diversi strumenti che hai imparato a utilizzare, come `Spacer`, `.frame(minHeight:maxHeight:)` e `.padding()`, e rifletti su come utilizzarli per migliorare il layout.
nl: Bedenk hoe je de verschillende hulpmiddelen waar je tot nu toe kennis mee hebt gemaakt, zoals `Spacer`, `.frame(minHeight:maxHeight:)` en `.padding()`, kunt gebruiken om de lay-out te verbeteren.
pt: Considere as várias ferramentas que você aprendeu até agora, como `Spacer`, `.frame(minHeight:maxHeight:)`, `.padding()` e pense em como você pode usá‑las para melhorar o layout.
sv: Överväg de olika verktygen du har lärt dig, som `Spacer`, `.frame(minHeight:maxHeight:)` och `.padding()`, och fundera på hur du kan använda dem till att förbättra layouten.
th: พิจารณาเครื่องมือต่างๆ ที่คุณได้เรียนรู้มา เช่น `Spacer`, `.frame(minHeight:maxHeight:)`, `.padding()` แล้วคิดดูว่าคุณสามารถใช้เครื่องมือเหล่านั้นเพื่อปรับปรุงเค้าโครงได้อย่างไรบ้าง
tr: Öğrendiğin farklı araçları (`Spacer`, `.frame(minHeight:maxHeight:)`, `.padding()` gibi) ve yerleşimi iyileştirmek için bunları nasıl kullanabileceğini düşün.
zh_cn: 考虑一下你学到的不同工具，如 `Spacer`、`.frame(minHeight:maxHeight:)` 和 `.padding()`，然后想想你可以如何使用它们来改进布局。
zh_tw: 思考一下你已經學習過的不同工具，例如 `Spacer`、`.frame(minHeight:maxHeight:)`、`.padding()`，並且想想要如何使用它們來改進佈局。
