Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: If you need some help, here is a hint:
de: Du brauchst Hilfe? Hier ist ein Tipp:
es: Si necesitas ayuda, aquí tienes una pista:
es_419: Si necesitas ayuda, aquí tienes una pista:
fr: Si tu as besoin d’aide, voici une astuce :
it: Se hai bisogno di aiuto, ecco un suggerimento:
nl: Hier is een tip als je wat hulp nodig hebt:
pt: Se você precisar de ajuda uma dica:
sv: Om du behöver lite hjälp får du ett tips här:
th: ถ้าคุณต้องการความช่วยเหลือ นี่คือคำใบ้:
tr: Biraz yardıma ihtiyacın varsa işte bir ipucu:
zh_cn: 如果需要帮助，这有一个提示：
zh_tw: 如果你需要一些協助，這裡有一個提示：

source: Be sure to add this code to both of your `Rectangle` views, or your design will look wonky!
de: Stelle sicher, dass du diesen Code zu beiden `Rectangle`-Ansichten hinzufügst. Ansonsten sieht das Ganze schief aus!
es: No te olvides de añadir este código a las dos vistas `Rectangle` porque, de lo contrario, el diseño quedará torcido.
es_419: Asegúrate de agregar este código a tus dos visualizaciones `Rectangle`; de lo contrario, tu diseño se verá algo raro.
fr: Assure-toi d’ajouter ce code à tes deux vues `Rectangle`. Autrement ta conception aura vraiment l’air bizarre !
it: Accertati di aggiungere questo codice a entrambe le viste `Rectangle`, altrimenti il design avrà un aspetto insolito.
nl: Zorg dat je deze code aan beide `Rectangle`-weergaven toevoegt. Anders ziet je ontwerp er erg ongelijk uit!
pt: Lembre‑se de adicionar este código a ambas as visualizações `Rectangle` para que o design não fique estranho!
sv: Se till att lägga till den här koden i båda `Rectangle`-vyerna. Annars kommer designen att se knasig ut!
th: อย่าลืมเพิ่มโค้ดนี้ไปยังมุมมอง `Rectangle` ทั้งสองของคุณ ไม่เช่นนั้นการออกแบบของคุณจะดูผิดเพี้ยนมากเลย!
tr: Bu kodu `Rectangle` görüntülerinin her ikisine de eklediğinden emin ol, yoksa tasarımın kötü görünür!
zh_cn: 确保将这些代码添加到两个 `Rectangle` 视图中，否则你的设计看起来会不稳定！
zh_tw: 確定將此程式碼加入你的兩個 `Rectangle` 顯示區中，否則你的設計看起來會不太穩定！

source: You’ll need to change the rose and heart `Image` views as well. The rose needs to be bigger to fill the space, while the heart needs to be smaller, right?
de: Du musst auch die `Image`-Instanzen für die Rose und das Herz ändern. Die Rose muss größer sein, sodass sie den verfügbaren Platz füllt, und das Herz muss kleiner sein, richtig?
es: También tendrás que cambiar las vistas `Image` de la rosa y el corazón. La rosa tiene que ser más grande para rellenar el espacio, mientras que el corazón debe ser más pequeño, ¿no?
es_419: Las visualizaciones `Image` de la rosa y el corazón también se deben modificar. La rosa debería ser más grande para rellenar el espacio, mientras que el corazón debe reducirse, ¿cierto?
fr: Tu devras aussi changer les vues `Image` de la rose et du cœur. La rose doit être plus grande pour remplir l’espace et le cœur doit être plus petit. C’est bien ça ?
it: Devi modificare anche le viste `Image` della rosa e del cuore. La rosa deve essere più grande per riempire lo spazio, mentre il cuore deve essere più piccolo, giusto?
nl: Je moet de `Image`-weergaven met de roos en het hartje ook wijzigen. De roos moet groter worden gemaakt om de beschikbare ruimte te vullen en het hartje moet kleiner worden gemaakt, vind je niet?
pt: Você também precisará alterar as visualizações `Image` da rosa e do coração. A rosa precisa ser maior para preencher o espaço, enquanto o coração precisa ser menor, certo?
sv: Du måste också ändra `Image`-vyerna för rosen och hjärtat. Rosen måste vara större så att den fyller utrymmet och hjärtat måste vara mindre, eller hur?
th: คุณต้องเปลี่ยนมุมมอง `Image` ภาพดอกกุหลาบและหัวใจเช่นกัน ดอกกุหลาบต้องมีขนาดใหญ่ขึ้นเพื่อเติมเต็มพื้นที่ว่าง ในขณะที่หัวใจต้องมีขนาดเล็กลง ใช่ไหมล่ะ
tr: Gül ve kalp `Image` görüntülerini de değiştirmen gerekecek. Gülün alanı doldurması için biraz daha büyük olması gerekir, kalp ise daha küçük olmalı, değil mi?
zh_cn: 你还需要更改玫瑰和爱心 `Image` 视图。玫瑰需要变大一点来填充空间，而爱心则需要变小一点，对吧？
zh_tw: 你也需要更改玫瑰和心形的 `Image` 顯示區。玫瑰需要大一點來填滿空間，而心形需要小一點，對吧？

source: Use what you learned about view sizing to adjust the images in the view.
de: Verwende das, was du über das Ändern der Größe von Ansichten gelernt hast, um die Bilder in der Ansicht anzupassen.
es: Usa lo que has aprendido sobre ajustar el tamaño de las imágenes que contiene la vista.
es_419: Usa lo que aprendiste sobre el ajuste de tamaño de las visualizaciones para ajustar las imágenes en la visualización.
fr: Utilise ce que tu as appris concernant la taille des vues pour ajuster les images de la vue.
it: Utilizza le informazioni apprese sul ridimensionamento delle viste per regolare le immagini nella vista.
nl: Gebruik de kennis die je hebt opgedaan over het vergroten en verkleinen van afbeeldingen om de afbeeldingen in de weergave aan te passen.
pt: Use o que você aprendeu sobre dimensionamento de visualização para ajustar as imagens na visualização.
sv: Använd det du har lärt dig om att ändra vystorlekar till att justera bilderna i vyn.
th: ใช้สิ่งที่คุณได้เรียนรู้มาเกี่ยวกับการปรับขนาดมุมมองเพื่อปรับภาพในมุมมอง
tr: Görüntüdeki resimleri ayarlamak için görüntü büyüklüğünü değiştirme hakkında öğrendiklerini kullan.
zh_cn: 利用你学到的关于调整视图大小的知识，来调整视图中的图像。
zh_tw: 使用你對顯示區大小的瞭解來調整顯示區中的影像。

source: If you can’t remember the best way to scale an `Image` view, here’s is a hint:
de: Wenn du dich nicht mehr an die beste Möglichkeiten zum Skalieren einer `Image`-Ansicht erinnern kannst, ist hier ein kleiner Tipp:
es: Si no recuerdas la mejor manera de aplicar escala a la vista `Image`, aquí tienes una pista:
es_419: Si no recuerdas cuál es la mejor forma de ajustar la escala de una visualización `Image`, aquí tienes una pista:
fr: Si tu n’arrives plus à te souvenir du meilleur moyen de dimensionner une vue `Image`, voici une astuce :
it: Se non ti ricordi il modo migliore per ridimensionare in scala una vista `Image`, ecco un suggerimento:
nl: Hier is een tip als je vergeten bent hoe je de schaal van een `Image`-weergave het beste kunt aanpassen:
pt: Se você não se lembra da melhor maneira de dimensionar uma visualização `Image`, use esta dica:
sv: Om du inte kommer ihåg det bästa sättet att skala en `Image`-vy får du ett tips här:
th: ถ้าคุณจำวิธีที่ดีที่สุดในการปรับขนาดมุมมอง `Image` ไม่ได้ นี่คือคำใบ้:
tr: Bir `Image` görüntüsünü ölçeklemenin en iyi yolunu anımsayamıyorsan işte bir ipucu:
zh_cn: 如果你忘了缩放 `Image` 视图的最佳方法，这有一个提示：
zh_tw: 如果你忘記縮放 `Image` 顯示區的最佳方法，給你一個提示：

source: Well, `.scaledToFit` enables the rose to scale to fit the size of its container, but what about the heart? It already has `scaledToFit`🤔.
de: Mit `.scaledToFit` wird die Rose korrekt auf die Größe ihres Containers skaliert. Aber was ist mit dem Herzen? Es besitzt bereits eine Instanz von `scaledToFit` 🤔.
es: Bueno, con `.scaledToFit` la rosa puede caber bien en el tamaño del contenedor pero ¿qué pasa con el corazón? Ya tiene la escala correcta con `scaledToFit` 🤔.
es_419: El modificador `.scaledToFit` permite que la rosa se ajuste para que quepa en su contenedor, ¿pero qué pasa con el corazón? Ese ya tiene el modificador `scaledToFit` 🤔.
fr: Eh bien, `.scaledToFit` permet à la rose de s’adapter correctement à la taille de son conteneur, mais qu’en est-il du cœur ? Il dispose déjà de `scaledToFit`🤔.
it: `.scaledToFit` consente alla rosa di ridimensionarsi per adattarsi alle dimensioni del suo contenitore. E il cuore? Dispone già di `scaledToFit`. 🤔
nl: Met `.scaledToFit` past de roos precies in de container, maar hoe zit het met het hartje? Dit is al voorzien van `scaledToFit`🤔.
pt: Bem, `.scaledToFit` permite que a rosa seja dimensionada para preencher o tamanho do contêiner, mas e o coração? Ele já tem `scaledToFit`🤔.
sv: Hmm. Med `.scaledToFit` kan rosen skalas så att den passar storleken på dess behållare, men hjärtat då? Där används redan `scaledToFit`. 🤔
th: `.scaledToFit` ช่วยปรับขนาดดอกกุหลาบเพื่อให้พอดีกับขนาดของคอนเทนเนอร์ แต่หัวใจล่ะ หัวใจมี `scaledToFit` อยู่แล้ว🤔
tr: Şöyle ki; `.scaledToFit`, gülün ölçeklenerek kapsayıcısının boyutuna sığmasını sağlıyor, peki ama ya kalp? `scaledToFit`’i zaten kullanıyor 🤔.
zh_cn: 嗯，`.scaledToFit` 可让玫瑰缩放以适合它的容器大小，但爱心该怎么处理呢？它已经有了 `scaledToFit`🤔。
zh_tw: 嗯，`.scaledToFit` 可以讓玫瑰縮放以符合其容器的大小，但是心形呢？它已經有了 `scaledToFit` 🤔。

source: Which modifier can you add to fine-tune the size of the heart?
de: Welchen Modifikator kannst du hinzufügen, um die Größe des Herzens präzise anzupassen?
es: ¿Qué modificador puedes añadir para ajustar con precisión el tamaño del corazón?
es_419: ¿Qué modificador debes agregar para afinar el tamaño del corazón?
fr: Quel modificateur peux-tu ajouter pour ajuster précisément la taille du cœur ?
it: Quale modificatore si può aggiungere per modificare le dimensioni del cuore?
nl: Welke modifier kun je toevoegen om de grootte van het hartje te optimaliseren?
pt: Qual modificador você pode adicionar para ajustar o tamanho do coração?
sv: Vilken modifierare kan du lägga till för att finjustera storleken på hjärtat?
th: ปุ่มปรับค่าใดที่คุณสามารถเพิ่มเพื่อปรับแต่งขนาดของหัวใจอย่างละเอียดได้
tr: Kalp büyüklüğünde ince ayarlar yapmak için hangi niteleyiciyi ekleyebilirsin?
zh_cn: 你可以添加哪个修饰符来微调爱心的大小呢？
zh_tw: 你可以加入哪個修飾符來微調心形的大小？

source: If you need a little reminder, here’s a hint:
de: Hier ist ein Tipp, falls dich dein Gedächtnis im Stich lässt:
es: Si no te acuerdas bien, aquí tienes una pista:
es_419: Si necesitas un pequeño recordatorio, aquí tienes una pista:
fr: Si tu as besoin d’un petit rappel, voici un indice :
it: Se hai bisogno di un piccolo promemoria, ecco un suggerimento:
nl: Hier is een tip als je een geheugensteuntje nodig hebt:
pt: Se você precisar de um lembrete, siga esta dica:
sv: Om du behöver en liten påminnelse får du ett tips här:
th: ถ้าคุณต้องการรื้อฟื้นความจำอีกนิด นี่คือคำใบ้:
tr: Küçük bir anımsatıcıya ihtiyacın varsa işte bir ipucu:
zh_cn: 如果需要一点提示，这就有一个：
zh_tw: 如果你需要一些提醒，這裡有一個提示：

source: Notice how the text in the mock-up is bolder than in your design. Which modifier can you use to adjust the size and weight of the [font](doc://com.apple.documentation/documentation/swiftui/font)?
de: Wie du siehst, ist der Text im Modell fetter als in deinem Design. Welchen Modifikator kannst du zum Anpassen der Größe und des Schnitts einer [Schrift](doc://com.apple.documentation/documentation/swiftui/font) verwenden?
es: Fíjate en que el texto del boceto es más grueso que el de tu diseño. ¿Qué modificador puedes usar para ajustar el tamaño y el peso del [tipo de letra](doc://com.apple.documentation/documentation/swiftui/font)?
es_419: Observa cómo el texto en el modelo es más grueso que el de tu diseño. ¿Qué modificador puedes usar para ajustar el tamaño y el grosor del [tipo de letra](doc://com.apple.documentation/documentation/swiftui/font)?
fr: Regarde comme le texte de la maquette est plus gras que celui de ta conception. Quel modificateur peux-tu utiliser pour ajuster la taille et l’épaisseur de la [police](doc://com.apple.documentation/documentation/swiftui/font) ?
it: Osserva come il testo nel modello risulta più marcato rispetto a quello nel design. Quale modificatore si può usare per regolare la dimensione e il peso del [font](doc://com.apple.documentation/documentation/swiftui/font)?
nl: Zoals je ziet, is de tekst in het model vetter dan in jouw ontwerp. Welke modifier kun je gebruiken om de grootte en het gewicht van [font](doc://com.apple.documentation/documentation/swiftui/font) aan te passen?
pt: Repare como o texto no modelo usa mais negrito do que no seu design. Qual modificador você pode usar para ajustar o tamanho e o peso de [font](doc://com.apple.documentation/documentation/swiftui/font)?
sv: Lägg märke till hur texten i modellen är fetare än i designen. Vilken modifierare kan du använda till att justera storleken och vikten för [font](doc://com.apple.documentation/documentation/swiftui/font)?
th: สังเกตว่าข้อความในตัวอย่างจำลองมีความหนามากกว่าในการออกแบบของคุณ ปุ่มปรับค่าใดที่คุณสามารถใช้เพื่อปรับขนาดและน้ำหนักของ[แบบอักษร](doc://com.apple.documentation/documentation/swiftui/font)ได้
tr: Modeldeki metnin tasarımındaki metinden daha kalın olduğuna dikkat et. [Fontun](doc://com.apple.documentation/documentation/swiftui/font) puntosunu ve kalınlığını ayarlamak için hangi niteleyiciyi kullanabilirsin?
zh_cn: 留意一下模型中的文本是如何比你设计中的文本更粗的。你可以使用哪个修饰符来调整 [font](doc://com.apple.documentation/documentation/swiftui/font) 的大小和粗细呢？
zh_tw: 請注意，模型中的文字比你設計的稍微粗一點。你可以使用哪一種修飾符來調整[字體](doc://com.apple.documentation/documentation/swiftui/font)的大小和粗細呢？

source: This is one way you can adjust the font. You can add it as a modifier to the containing `VStack` so that it’s applied to all the `Text` views:
de: Dies ist eine Möglichkeit, mit der du die Schrift anpassen kannst. Du kannst den Code als Modifikator zum entsprechenden `VStack` hinzufügen, damit er auf alle `Text`-Ansichten angewendet wird.
es: Esta es una manera de ajustar el tipo de letra. Puedes añadirla al contenedor `VStack` como modificador para aplicarlo a todas las vistas `Text`:
es_419: Esta es una forma de ajustar el tipo de letra. Puedes agregarlo como modificador a la pila `VStack` que lo contiene para que se aplique a todas las visualizaciones `Text`.
fr: C’est une manière d’ajuster la police. Tu peux l’ajouter en tant que modificateur au conteneur `VStack` pour l’appliquer à toutes les vues `Text`.
it: Questo è un modo per regolare il font. Puoi aggiungerlo come modificatore a `VStack` che lo contiene, in modo che possa essere applicato a tutte le viste `Text`:
nl: Dit is een van de manieren waarop je het lettertype kunt aanpassen. Je kunt het lettertype als een modifier aan de container `VStack` toevoegen, zodat het op alle `Text`-weergaven kan worden toegepast:
pt: Essa é uma maneira de ajustar a fonte. Você pode adicioná‑la como um modificador do contêiner `VStack` para que aplicá‑lo a todas as visualizações `Text`:
sv: Det här är ett sätt att justera typsnittet! Du kan lägga till det som en modifierare i `VStack`-behållaren så att det används i alla `Text`-vyer:
th: นี่เป็นวิธีหนึ่งที่คุณสามารถปรับแบบอักษรได้ คุณสามารถเพิ่มวิธีนี้เป็นปุ่มปรับค่าไปยัง `VStack` ที่จัดเก็บอยู่เพื่อให้ปรับใช้กับมุมมอง `Text` ทั้งหมดได้:
tr: Fontu ayarlamanın yollarından biri bu. Onu, kapsayan `VStack`’e niteleyici olarak ekleyerek tüm `Text` görüntülerine uygulanmasını sağlayabilirsin:
zh_cn: 有一种方法可以调整字体。你可以将字体作为修饰符添加到容器 `VStack` 中，这样它就可以应用到所有的 `Text` 视图了：
zh_tw: 這是調整字體的一種方法。你可以將它加入其中的 `VStack` 作為修飾符，以便將它套用到所有 `Text` 顯示區：

source: You are a view sizing champion! If the layout still look a little funny, this is what the code could look like to achieve the design you were going for:
de: Du bist ein Profi, wenn es um Größenanpassungen von Ansichten geht! Wenn das Layout immer noch ein bisschen komisch aussieht, findest du hier Beispielcode, mit dem sich das gewünschte Design umsetzen lässt:
es: ¡Qué dominio cambiando el tamaño de las vistas! Si la disposición todavía no queda del todo bien, así es como podría ser el código para conseguir el diseño que buscas:
es_419: ¡Tus habilidades de ajuste de tamaño de visualizaciones son asombrosas! Si la disposición aún se ve un poco rara, así es cómo debería verse el código para conseguir el diseño que querías:
fr: Tu maîtrises le dimensionnement des vues ! Si la disposition a toujours l’air un peu bizarre, voici à quoi pourrait ressembler le code pour obtenir la conception que tu recherchais.
it: Il ridimensionamento delle viste non ha più segreti per te! Se il layout ti sembra ancora un po’ strano, ecco come potrebbe apparire il codice per ottenere il design desiderato:
nl: Niemand is beter in het vergroten en verkleinen van weergaven dan jij! Als de lay-out er nog een beetje raar uitziet, kun je hier bekijken hoe de code eruit zou moeten zien om het gewenste ontwerp te bereiken:
pt: Você é especialista em dimensionamento de visualizações! Se o layout ainda estiver um pouco estranho, o código deve ficar mais ou menos assim para que você chegue ao design desejado:
sv: Du är en mästare på att storleksändra vyer! Om layouten fortfarande ser lite konstig ut skulle den här koden kunna åstadkomma designen du försökte skapa:
th: คุณคือแชมป์การปรับขนาดมุมมอง! ถ้าเค้าโครงยังคงดูตลกอยู่เล็กน้อย นี่คือลักษณะของโค้ดที่ควรจะเป็นเพื่อให้ได้การออกแบบที่คุณต้องการ:
tr: Görüntü büyüklüğünü değiştirme şampiyonusun! Yerleşim hâlâ biraz komik görünüyorsa istediğin tasarımı elde etmek için kodun şöyle görünmesi gerekir:
zh_cn: 你就是调整视图大小的冠军！如果布局看起来仍然有点古怪，获得你想要的设计的代码看起来应该是这样的：
zh_tw: 你是調整顯示區大小的高手！如果佈局看起來仍然有些逗趣，這就是實現你想要設計的程式碼外觀：

source: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Roses are red,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("violets are blue, ") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("I just love") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("coding with you!") } } } .font(.headline) .foregroundColor(.darkBrown)
de: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Rosen sind rot,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("und sprießen aus dem Boden,") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("ich liebe es einfach,") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("mit dir zu coden!") } } } .font(.headline) .foregroundColor(.darkBrown)
es: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Las rosas son rojas,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("el cielo es azul, ") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("¡y a mí me encanta") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("programar como tú!") } } } .font(.headline) .foregroundColor(.darkBrown)
it: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Le rose sono rosse,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("le viole sono blu, ") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("e adoro") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("scrivere codice insieme a te!") } } } .font(.headline) .foregroundColor(.darkBrown)
nl: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Rozen zijn rood,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("viooltjes zijn blauw, ") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("ik hou van") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("programmeren met jou!") } } } .font(.headline) .foregroundColor(.darkBrown)
pt: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Rosas são vermelhas,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("violetas são azuis, ") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("programar com você") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("é o que me seduz!") } } } .font(.headline) .foregroundColor(.darkBrown)
sv: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Rosor är röda,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("violer är blå, ") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("jag älskar verkligen") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("att koda med dig så!") } } } .font(.headline) .foregroundColor(.darkBrown)
th: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("ดอกกุหลาบสีแดง") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("ดอกไวโอเล็ตสีฟ้า") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("ฉันชอบนักหนา") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("การเขียนโค้ดกับคุณ!") } } } .font(.headline) .foregroundColor(.darkBrown)
tr: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("Güller kırmızı,") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("menekşeler mor, ") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("En sevdiğim şey") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("birlikte yazılan kodlar!") } } } .font(.headline) .foregroundColor(.darkBrown)
zh_cn: VStack { ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("玫瑰是红色的，") Image("Rose") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("紫罗兰是蓝色的，") } } ZStack { RoundedRectangle(cornerRadius: 10) .foregroundColor(.paleOrange) .frame(maxWidth: 200, maxHeight: 150) VStack { Text("我只喜欢") Image("Heart") .resizable() .scaledToFit() .frame(maxWidth: 50) .foregroundColor(.themeRed) Text("和你一起写代码！") } } } .font(.headline) .foregroundColor(.darkBrown)

# GuideBook..Guide0..StepMy Journal..TaskGroup0..TaskalignmentAndSpacing..title
source: Refine the spacing and alignment of your views
de: Abstand und Ausrichtung der Ansichten verfeinern
es: Ajustar con precisión el espaciado y la alineación de las vistas
es_419: Afina el espaciado y la alineación de tus visualizaciones.
fr: Ajustement de l’espacement et de l’alignement de tes vues
it: Migliorare spaziatura e allineamento delle viste
nl: De afstand en uitlijning van je weergaven verder aanpassen
pt: Refine o espaçamento e o alinhamento das visualizações
sv: Finjustera vyernas mellanrum och kantjustering
th: ปรับแต่งการเว้นระยะห่างและการจัดแนวมุมมองของคุณ
tr: Görüntülerinin aralığını ve hizalamasını düzeltme
zh_cn: 微调视图的间距和对齐
zh_tw: 微調你的顯示區間距和對齊
