Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: Start by making the cards the correct size. Add a `.frame(minHeight:maxHeight:)` modifier to your `VStack` to set a minimum and maximum height. If you recall from earlier, setting the minimum height allows the view to scale and adjust to different screen sizes.
de: Zuerst musst du die Größe der Karten anpassen. Füge einen `.frame(minHeight:maxHeight:)`-Modifikator zu `VStack` hinzu, um eine minimale und eine maximale Höhe festzulegen. Wie du schon gelernt hast, kann die Ansicht durch das Festlegen einer Mindesthöhe skaliert und an verschiedene Bildschirmgrößen angepasst werden.
es: Empieza por dar a las tarjetas el tamaño correcto. Añade un modificador `.frame(minHeight:maxHeight:)` al contenedor `VStack` para definir una altura mínima y máxima. Si te acuerdas de antes, definir la altura mínima permite aplicar una escala a la vista y ajustar la tarjeta a los distintos tamaños de pantalla.
es_419: Lo primero que debes hacer es ajustar las cartas al tamaño correcto. Agrega el modificador `.frame(minHeight:maxHeight:)` a tu `VStack` para configurar valores de altura mínima y máxima. Recuerda que al configurar la altura mínima se permite que la visualización se ajuste según los distintos tamaños de pantalla.
fr: Commence par attribuer la bonne taille aux cartes. Ajoute un modificateur `.frame(minHeight:maxHeight:)` à ta `VStack` pour définir une hauteur minimale et maximale. Tu te souviens peut-être qu’en définissant la hauteur minimale, tu permets à la vue de sʼadapter à différentes tailles dʼécran.
it: Inizia impostando le dimensioni corrette per le schede. Aggiungi un modificatore `.frame(minHeight:maxHeight:)` a `VStack` per impostare un’altezza minima e massima. Ricorda quanto detto in precedenza: impostare l’altezza minima consente la scalabilità della vista e il suo adattamento a schermi di diverse dimensioni.
nl: Allereerst moet je de kaarten de juiste grootte geven. Voeg een `.frame(minHeight:maxHeight:)`-modifier toe aan je `VStack` om een minimum- en maximumgrootte in te stellen. Weet je nog dat de weergave zich aan verschillende schermformaten kan aanpassen als je een minimumgrootte instelt?
pt: Comece deixando os cartões com o tamanho certo. Adicione um modificador `.frame(minHeight:maxHeight:)` ao `VStack` para definir uma altura máxima e mínima. Lembre-se de que, ao definir a altura mínima, você permite que a visualização seja dimensionada e ajustada em tamanhos de tela diferentes.
sv: Börja med att ge korten rätt storlek. Lägg till en `.frame(minHeight:maxHeight:)`-modifierare i `VStack` för att ställa in en lägsta och högsta höjd. Du kanske kommer ihåg från tidigare att inställningen för lägsta höjd gör så att vyn kan skalas och anpassas till olika skärmstorlekar.
th: เริ่มต้นโดยการทำให้บัตรมีขนาดที่ถูกต้อง เพิ่มปุ่มปรับค่า `.frame(minHeight:maxHeight:)` ไปยัง `VStack` ของคุณเพื่อตั้งค่าความสูงที่ต่ำสุดและสูงสุด ถ้าคุณจำก่อนหน้านี้ได้ การตั้งค่าความสูงที่ต่ำสุดจะทำให้มุมมองสามารถปรับขนาดและปรับตามขนาดหน้าจอต่างๆ ได้
tr: Kartları doğru büyüklüğe getirmekle başla. Bir minimum ve maksimum yükseklik ayarlamak için `VStack`’ine bir `.frame(minHeight:maxHeight:)` niteleyicisi ekle. Daha önceden hatırlarsan minimum yükseklik ayarlamak görüntünün farklı ekran boyutlarına göre ölçeklenip ayarlanmasını sağlar.
zh_cn: 首先将卡片调整到正确的大小。将 `.frame(minHeight:maxHeight:)` 修饰符添加到 `VStack`，来设定最小和最大高度。回想一下，设定最小高度可让视图缩放和调整到不同的屏幕大小。
zh_tw: 首先要做的是讓卡片的大小正確。加入一個 `.frame(minHeight:maxHeight:)` 修飾符到你的 `VStack` 來設定最小和最大高度。如果你之前還記得，設定最小高度能讓顯示區縮放和調整至不同的螢幕大小。

source: Now that the cards are the same size, notice how the card has two states:
de: Jetzt haben die Karten die selbe Größe. Beachte, dass die Karte zwei Status hat:
es: Ahora que las tarjetas tienen el mismo tamaño, fíjate en que la tarjeta tiene dos estados:
es_419: Ahora que las tarjetas tienen el mismo tamaño, observa cómo la tarjeta tiene dos estados:
fr: Maintenant que les cartes ont la même taille, tu peux remarquer que la carte présente deux états :
it: Ora che le schede sono della stessa dimensione, osserva come dispongono di due stati:
nl: De kaarten hebben nu dezelfde grootte. Zoals je ziet, heeft de kaart twee modi:
pt: Agora que os cartões são do mesmo tamanho, observe como o cartão tem dois estados:
sv: Nu när korten har samma storlek kan du lägga märke till hur kortet har två lägen:
th: ตอนนี้เมื่อบัตรมีขนาดเท่ากันแล้ว สังเกตว่าบัตรมีสองสถานะ:
tr: Artık kartların büyüklükleri aynı. Kartın iki durumu olduğuna dikkat et:
zh_cn: 现在卡片的大小相同，留意一下卡片是如何拥有两种状态的：
zh_tw: 現在卡片的大小相同，請注意卡片有兩種狀態：

source: A display state on the left
de: Links ein Anzeigestatus
es: Un estado de visualización en el lado izquierdo
es_419: El estado de pantalla a la izquierda
fr: Un état d’affichage sur la gauche
it: Uno stato di visualizzazione sulla sinistra
nl: Een weergavemodus aan de linkerkant
pt: Um estado de exibição à esquerda
sv: Ett visningsläge till vänster.
th: สถานะการแสดงผลทางด้านซ้าย
tr: Sol tarafta bir görüntüleme durumu
zh_cn: 在左侧的显示状态
zh_tw: 左側的顯示狀態

source: An editing state on the right
de: Rechts ein Bearbeitungsstatus
es: Un estado de edición en el lado derecho
es_419: El estado de edición a la derecha
fr: Un état de modification sur la droite
it: Uno stato di modifica sulla destra
nl: Een bewerkingsmodus aan de rechterkant
pt: Um estado de edição à direita
sv: Ett redigeringsläge till höger.
th: สถานะการแก้ไขทางด้านขวา
tr: Sağ tarafta bir düzenleme durumu
zh_cn: 在右侧的编辑状态
zh_tw: 右側的編輯狀態

source: Your sleep tracker needs to have these two states as well.
de: Dein Schlaftracker muss diese zwei Status ebenso haben.
es: El módulo de seguimiento del sueño también tiene que tener estos dos estados.
es_419: Tu monitor de sueño necesita tener estos dos estados también.
fr: Ton moniteur de sommeil doit également présenter ces deux états.
it: Anche il tracker del sonno deve presentare questi due stati.
nl: De slaaptracker moet dezelfde twee modi krijgen.
pt: Seu rastreador de sono também precisa ter esses dois estados.
sv: Sömnspåraren måste också ha de här båda lägena.
th: ตัวติดตามการนอนหลับของคุณมีสองสถานะนี้เช่นเดียวกัน
tr: Uyku izleyicinde de bu iki durumun olması gerekir.
zh_cn: 你的睡眠跟踪器同样需要有这两种状态。
zh_tw: 你的睡眠追蹤器也需要有這兩種狀態。

source: Start with the display state. You currently have two `Text` views arranged in a `VStack`; one displaying a title, and the other displaying the number of hours slept.
de: Beginne mit dem Anzeigestatus. Du hast momentan zwei `Text`-Ansichten, die in einer `VStack`-Instanz angeordnet sind. Eine zeigt einen Titel an, die andere die Anzahl der Schlafstunden.
es: Empieza por el estado de visualización. En este momento tienes dos vistas `Text` organizadas en un contenedor `VStack`, una que muestra un título y otra que indica el tiempo de sueño.
es_419: Empieza con el estado de visualización. En este momento tienes dos visualizaciones `Text` dispuestas en una `VStack`, donde una muestra un título y la otra muestra el número de las horas de sueño.
fr: Commence par l’état d’affichage. Tu disposes actuellement de deux vues `Text` organisées dans une `VStack`, l’une affichant un titre et l’autre montrant le nombre d’heures de sommeil.
it: Inizia con lo stato di visualizzazione. Attualmente, disponi di due viste `Text` inserite in un `VStack`, una che mostra un titolo e l’altra che mostra il numero di ore di sonno.
nl: Begin met de weergavemodus. Je hebt momenteel twee `Text`-weergaven die zijn georganiseerd in een `VStack`. In de ene wordt de titel weergegeven en in de andere het aantal geslapen uren.
pt: Comece com o estado de exibição. No momento, você tem duas visualizações `Text` organizadas em um `VStack`: uma que exibe um título e outra que exibe o número de horas dormidas.
sv: Börja med visningsläget. För närvarande har du två `Text`-vyer som är ordnade i en `VStack`: en som visar en titel och en annan som visar antalet sovtimmar.
th: เริ่มที่สถานะการแสดงผล ตอนนี้คุณมีมุมมอง `Text` สองมุมมองที่จัดเรียงอยู่ใน `VStack` โดยมุมมองหนึ่งแสดงชื่อ และอีกมุมมองหนึ่งแสดงจำนวนชั่วโมงที่นอนหลับ
tr: Görüntüleme durumuyla başla. Şu anda `VStack` şeklinde düzenlenmiş iki `Text` görüntün var; bunlardan biri bir başlık, diğeri ise kaç saat uyunduğunu görüntülüyor.
zh_cn: 从显示状态开始着手。当前在 `VStack` 中排列着两个 `Text` 视图；其中一个显示标题，另一个显示睡眠的小时数。
zh_tw: 從顯示狀態開始。你目前有兩個 `Text` 顯示區排列在 `VStack` 中，一個顯示標題，另一個顯示睡眠小時數。

source: Compare your prototype to the design mock-ups. It’s not quite there yet.
de: Vergleiche deinen Prototypen mit dem Designmodell. Einige Änderungen sind noch nötig.
es: Compara tu prototipo con los bocetos de diseño. Todavía no se parece demasiado.
es_419: Compara tu prototipo con los modelos de diseño. Aún no está listo del todo.
fr: Compare ton prototype aux maquettes de conception. Ce n’est pas encore tout à fait ça.
it: Confronta il tuo prototipo con i modelli di design. Non è ancora pronto.
nl: Vergelijk je prototype met de modelafbeeldingen. Je bent er nog niet helemaal.
pt: Compare o seu protótipo com os modelos do design. Ainda não é bem isso.
sv: Jämför din prototyp med designmodellen. Den är inte riktigt framme än.
th: เปรียบเทียบต้นแบบของคุณกับตัวอย่างจำลองการออกแบบ ซึ่งยังไม่ตรงกันเท่าใดนัก
tr: Prototipini tasarım modelleriyle karşılaştır. Henüz tam olmadı.
zh_cn: 比较一下你的原型与设计模型。还有很多需要完善的地方。
zh_tw: 將你的原型與設計模型進行比較。還不是十分到位。

source: You need a wider gap between the card title and sleep value. One way to do this is to add a `.padding()` modifier to the top or bottom edge of the sleep value:
de: Zwischen dem Kartentitel und dem Schlafwert brauchst du einen breiteren Abstand. Dies könntest du z. B. erreichen, indem du einen `.padding()`-Modifikator zum oberen oder unteren Rand des Schlafwertes hinzufügst:
es: Debería haber más espacio entre el título de la tarjeta y la indicación de tiempo de sueño. Una manera de hacerlo consiste en añadir un modificador `.padding()` al borde superior o inferior del valor de tiempo de sueño:
es_419: Necesitas un espacio más grande entre el título de la carta y el valor de sueño. Una forma de hacer esto es agregando el modificador `.padding()` en el borde superior o inferior del valor de sueño:
fr: Tu as besoin dʼun blanc plus large entre le titre de la carte et la valeur de sommeil. Une façon de procéder consiste à ajouter un modificateur `.padding()` au bord supérieur ou inférieur de la valeur de sommeil :
it: Ti serve uno spazio più ampio tra il titolo della scheda e il valore del sonno. Un modo per farlo è aggiungere un modificatore `.padding()` al bordo superiore o inferiore del valore del sonno:
nl: Je moet meer ruimte tussen de kaarttitel en de slaapwaarde aanbrengen Je kunt dit onder andere doen door een `.padding()`-modifier aan de boven- of onderrand van de slaapwaarde toe te voegen:
pt: Você precisa de um espaço maior entre o título do cartão e o valor do sono. Uma maneira de fazer isso é adicionando um modificador `.padding()` à margem superior ou inferior do valor do sono:
sv: Du behöver ett större mellanrum mellan kortets titel och sömnvärdet. Ett sätt att göra det är att lägga till en `.padding()`-modifierare för den övre eller nedre kanten av sömnvärdet:
th: คุณต้องมีช่องว่างระหว่างชื่อบัตรและค่าการนอนหลับที่กว้างกว่านี้ วิธีหนึ่งในการทำเช่นนี้คือเพิ่มปุ่มปรับค่า `.padding()` ไปที่ขอบด้านบนหรือด้านล่างของค่าการนอนหลับ:
tr: Kart başlığı ile uyuma değeri arasında daha geniş bir aralık bırakman gerekir. Bunu yapmanın bir yolu, uyuma değerinin üst veya alt kenarına bir `.padding()` niteleyicisi eklemektir:
zh_cn: 卡片标题和睡眠值之间的间隔需要再宽一点。方法之一是将 `.padding()` 修饰符添加到睡眠值的顶部或底部边缘：
zh_tw: 卡片名稱和睡眠值之間需要更寬的空隙。一種方法是在睡眠值的上方或下方邊緣加入一個 `.padding()` 修飾符：

source: You may notice that you’re closer to the mock-up, but it doesn’t exactly match yet. Don’t worry, you’ll fix this later.
de: Du hast vermutlich bemerkt, dass du nun näher am Modell bist, aber das Ergebnis noch nicht exakt übereinstimmt. Keine Sorge, das beheben wir später.
es: Te puede parecer que ya estás más cerca del boceto, pero todavía no coinciden. No te preocupes: lo arreglarás más adelante.
es_419: Probablemente notes que se parece más al modelo, pero aún no coincide del todo. No te preocupes, lo arreglarás más tarde.
fr: Tu peux remarquer que ta conception s’est rapprochée de la maquette, mais qu’elle ne correspond pas encore exactement. Ne t’inquiète pas, tu corrigeras cela plus tard.
it: Potresti notare che il design è più simile al modello, ma che non gli corrisponde ancora esattamente. Non preoccuparti, lo sistemerai in seguito.
nl: Het valt je misschien op dat je het model van de interface al aardig benadert, maar dat je versie nog niet helemaal hetzelfde is. Maar je geen zorgen, dit ga je later oplossen.
pt: Talvez você repare que o seu design está mais parecido com o modelo, mas ele ainda não está igual. Não se preocupe, você corrigirá isso mais tarde.
sv: Du kanske märker att du börjar närma dig modellen, men det är inte en exakt matchning än. Oroa dig inte, du fixar det senare.
th: คุณอาจสังเกตเห็นว่าคุณเข้าใกล้ตัวอย่างจำลองมากขึ้น แต่ยังไม่ตรงกันทั้งหมด ไม่ต้องกังวล คุณจะแก้ไขปัญหานี้ในภายหลัง
tr: Fark ettiysen modele yaklaştın ama henüz modelin bire bir aynısı değil. Endişelenme, bunu daha sonra düzelteceksin.
zh_cn: 你可能已经发现，你的设计越来越接近模型了，但并不是完全相同。别担心，后面你还要进行修复。
zh_tw: 你可能會注意到更接近模型了，但它還不完全相符。不用擔心，你稍後會修正這個問題。

source: Now its time to tackle the editing state. There’s a [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper) inside the editing state. The `Stepper` allows people to change the sleep value by tapping the up or down arrows.
de: Jetzt ist der Bearbeitungsstatus dran. Innerhalb des Bearbeitungsstatus befindet sich ein [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper). Mit `Stepper` kann durch Tippen auf den Aufwärts- oder Abwärtspfeil der Schlafwert geändert werden.
es: Ahora es el momento de dedicarte al estado de edición. En este estado hay un secuenciador de incrementos [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper). Con `Stepper` las personas pueden cambiar el valor de sueño tocando la tecla hacia arriba o hacia abajo.
es_419: Ahora es momento de trabajar con el estado de edición. Hay un [incremento](doc://com.apple.documentation/documentation/swiftui/stepper) dentro del estado de edición; este le permite a los usuarios cambiar el valor al tocar las flechas hacia arriba o abajo.
fr: Le moment est venu de t’attaquer à l’état de modification. Il y a un [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper) dans l’état de modification. Le `Stepper` permet à l’utilisateur de modifier la valeur de sommeil en touchant les flèches vers le haut et vers le bas.
it: Ora, è il momento di dedicarti allo stato di modifica. All’interno dello stato di modifica è presente uno [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper). `Stepper` consente agli utenti di modificare il valore del sonno toccando le freccia verso l’alto o il basso.
nl: Nu is het tijd om je met de bewerkingsmodus bezig te houden. De bewerkingsmodus bevat een [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper). Met de `Stepper` kunnen gebruikers de slaapwaarde wijzigen door op de pijl-omhoog en de pijl-omlaag te tikken.
pt: Agora é hora de lidar com o estado de edição. Há um [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper) dentro do estado de edição. O `Stepper` permite que uma pessoa mude o valor do sono ao tocar nas setas para cima ou para baixo.
sv: Nu är det dags att tackla redigeringsläget. Det finns en [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper) inuti redigeringsläget. En `Stepper` gör det möjligt för användare att ändra sömnvärdet genom att trycka på uppåt- och nedåtpilarna.
th: ตอนนี้ก็ถึงเวลาจัดการกับสถานะการแก้ไขแล้ว สถานะการแก้ไขมี[ค่าเป็นขั้น](doc://com.apple.documentation/documentation/swiftui/stepper)อยู่ภายใน ซึ่ง `Stepper` ช่วยให้ผู้คนสามารถเปลี่ยนแปลงค่าการนอนหลับได้โดยการแตะลูกศรขึ้นหรือลง
tr: Şimdi sıra düzenleme durumunu halletmeye geldi. Düzenleme durumunun içinde bir [adımlayıcı](doc://com.apple.documentation/documentation/swiftui/stepper) var. `Stepper`, kişilerin yukarı veya aşağı oklara dokunarak uyuma değerini değiştirmesini sağlar.
zh_cn: 现在，是时候处理编辑状态了。编辑状态中有一个 [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper)。`Stepper` 可让用户轻点上或下箭头来更改睡眠值。
zh_tw: 現在是處理編輯狀態的時候了。編輯狀態內有一個 [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper)。`Stepper` 能讓使用者點按上下箭頭來更改睡眠值。

source: The `if statement` ensures that the `Stepper` only appears when `isEditing` is `true`. The value of `isEditing` changes to `true` when a someone edits a journal entry, otherwise the value is `false`.
de: Die `if`-Anweisung stellt sicher, dass `Stepper` nur dann angezeigt wird, wenn `isEditing` (bearbeiten) den Wert `true` hat. Der Wert von `isEditing` wird in `true` geändert, wenn jemand einen Tagebucheintrag bearbeitet. Ansonsten ist der Wert `false`.
es: La sentencia `if statement` se asegura de que el `Stepper` solo aparece cuando el estado `isEditing` es `true` (verdadero). El valor de `isEditing` cambia a `true` cuando alguien edita una entrada del diario; en caso contrario, el valor es `false`.
es_419: El enunciado `if` garantiza que solamente se muestre `Stepper` cuando `isEditing` es `true`. El valor de `isEditing` cambia a `true` cuando alguien edita una entrada del diario; de lo contrario, su valor es `false`.
fr: La `if statement` garantit que le `Stepper` n’apparaîtra que lorsque `isEditing` est `true`. La valeur de `isEditing` passe à `true` quand quelqu’un modifie lʼentrée dʼun journal. Autrement, la valeur est `false`.
it: `if statement` garantisce che `Stepper` venga visualizzato solo quando `isEditing` è impostato su `true`. Il valore di `isEditing` viene cambiato in `true` quando qualcuno modifica una voce del diario, altrimenti il valore è impostato su `false`.
nl: De `if-instructie` zorgt dat de `Stepper` alleen zichtbaar is wanneer `isEditing` de waarde `true` heeft. De waarde van `isEditing` verandert in `true` wanneer iemand een notitie aan het dagboek toevoegt. In de overige gevallen is de waarde `false`.
pt: `if statement` garante que o `Stepper` só apareça quando `isEditing` é `true`. O valor de `isEditing` muda para `true` quando uma pessoa edita uma entrada no diário, caso contrário, o valor é `false`.
sv: `if`-uttrycket ser till att `Stepper` bara visas när `isEditing` är `true`. Värdet för `isEditing` ändras till `true` när någon redigerar en journalpost och värdet är`false` i annat fall.
th: `if statement` ช่วยให้มั่นใจว่า `Stepper` จะแสดงขึ้นก็ต่อเมื่อ `isEditing` เป็น `true` ค่าของ `isEditing` จะเปลี่ยนเป็น `true` เมื่อมีคนแก้ไขรายการบันทึกประจำวัน ไม่เช่นนั้นค่าจะเป็น `false`
tr: `if` ifadesi, `Stepper`’ın yalnızca `isEditing` `true` iken görünmesini sağlar. `isEditing` değeri biri günlük girişini düzenlerken `true` olarak değişir, diğer durumlarda bu değer `false`’tur.
zh_cn: `if statement`（if 语句）可确保仅当 `isEditing`（正在编辑）为 `true` 时，`Stepper` 才会出现。用户编辑日记条目时，`isEditing` 的值会更改为 `true`，否则值为 `false`。
zh_tw: `if statement` 能確保 `Stepper` 只在 `isEditing` 為 `true` 時顯示。當有人編輯日記項目時，`isEditing` 的值會更改為 `true`，否則會變為 `false`。

source: Add the following code at the bottom of the `VStack`:
de: Füge den folgenden Code unten in `VStack` ein:
es: Añade el código siguiente al final de la `VStack`:
es_419: Agrega el siguiente código en la parte inferior de `VStack`:
fr: Ajoute le code suivant en bas de la `VStack` :
it: Aggiungi il seguente codice in fondo a `VStack`:
nl: Voeg de volgende code toe onderaan de `VStack`:
pt: Adicione o seguinte código na parte inferior do `VStack`:
sv: Lägg till följande kod längst ned i `VStack`:
th: เพิ่มโค้ดต่อไปนี้ที่ด้านล่างสุดของ `VStack`:
tr: Aşağıdaki kodu `VStack`’in en altına ekle:
zh_cn: 在 `VStack` 底部添加以下代码：
zh_tw: 在 `VStack` 的底部加入下列程式碼`：

source: if isEditing { Stepper("Hours Slept", value: $value, in: 0...12, step: 1) .labelsHidden() }
de: if isEditing { Stepper("Schlafstunden", value: $value, in: 0...12, step: 1) .labelsHidden() }
es_419: if isEditing { Stepper("Horas de sueño", value: $value, in: 0...12, step: 1) .labelsHidden() }
nl: if isEditing { Stepper("Uren geslapen", value: $value, in: 0...12, step: 1) .labelsHidden() }
pt: if isEditing { Stepper("Horas Dormidas", value: $value, in: 0...12, step: 1) .labelsHidden() }
sv: if isEditing { Stepper("Sömnlängd", value: $value, in: 0...12, step: 1) .labelsHidden() }
tr: if isEditing { Stepper("Uyunan Saat", value: $value, in: 0...12, step: 1) .labelsHidden() }
zh_cn: if isEditing { Stepper("睡眠小时数", value: $value, in: 0...12, step: 1) .labelsHidden() }

source: To add `SleepViewHalf` to the app, you’ll add logic to display `SleepViewHalf` when a person selects the half-card sleep tracker.
de: Zum Hinzufügen von `SleepViewHalf` (halbe Stimmungsansicht) zur App fügst du etwas Logik ein, damit `SleepViewHalf` angezeigt wird, wenn jemand den Schlaftracker in halber Größe auswählt.
es: Para añadir `SleepViewHalf` a la app, añadirás una lógica que muestre `SleepViewHalf` cuando una persona selecciona la media tarjeta de módulo de seguimiento de sueño.
es_419: Para agregar `SleepViewHalf` a la app, debes agregar la lógica para mostrar `SleepViewHalf` cuando una persona seleccione el monitor de sueño de media carta.
fr: Pour ajouter `SleepViewHalf` à l’app, tu ajouteras de la logique pour afficher `SleepViewHalf` quand quelqu’un sélectionne le moniteur de sommeil dʼune demi-carte.
it: Per aggiungere `SleepViewHalf` all’app, aggiungerai una logica per visualizzare `SleepViewHalf` quando una persona seleziona il tracker del sonno a scheda dimezzata.
nl: Om `SleepViewHalf` aan de app toe te voegen, moet je logica toevoegen om `SleepViewHalf` weer te geven wanneer iemand de slaaptracker in de halve kaart selecteert.
pt: Para adicionar `SleepViewHalf` ao app, você adicionará uma lógica para mostrar `SleepViewHalf` quando uma pessoa selecionar o meio cartão do rastreador de sono.
sv: För att kunna lägga till `SleepViewHalf` i appen måste du lägga till logik som visar `SleepViewHalf` när någon väljer sömnspåraren i halvkortsformat.
th: ในการเพิ่ม `SleepViewHalf` ไปยังแอป คุณจะต้องเพิ่มตรรกะเพื่อแสดง `SleepViewHalf` เมื่อคนเลือกตัวติดตามการนอนหลับแบบครึ่งบัตร
tr: Uygulamaya `SleepViewHalf`’ı eklemek için bir kişi yarım kart uyku izleyiciyi seçtiğinde `SleepViewHalf`’ı görüntüleme mantığını ekleyeceksin.
zh_cn: 如果要将 `SleepViewHalf` 添加到 App 中，你需要添加逻辑，来在用户选择一半卡片大小的睡眠跟踪器时显示 `SleepViewHalf`。
zh_tw: 若要將 `SleepViewHalf` 加入 App，你需要加入邏輯來讓其他人選擇半張卡片的睡眠追蹤器時顯示 `SleepViewHalf`。

source: Remove the highlighted code and replace it with the code snippet below:
de: Entferne den hervorgehobenen Code und ersetze ihn durch den unten aufgeführten Codeabschnitt:
es: Elimina el código resaltado y sustitúyelo por el fragmento de código siguiente:
es_419: Elimina el código resaltado y reemplázalo con el fragmento de código de abajo:
fr: Supprime le code en surbrillance et remplace-le par l’extrait de code ci-dessous :
it: Rimuovi il codice evidenziato e sostituiscilo con il frammento di codice sottostante:
nl: Verwijder de gemarkeerde code en vervang deze door het onderstaande codefragment:
pt: Remova o código destacado e substitua‑o pelo fragmento de código abaixo:
sv: Ta bort den markerade koden och ersätt den med kodsnutten nedan:
th: เอาโค้ดที่ไฮไลท์ออกและแทนที่ด้วยส่วนย่อยของโค้ดด้านล่าง:
tr: Vurgulanan kodu sil ve aşağıdaki kod parçacığı ile değiştir:
zh_cn: 移除高亮标记的代码，然后替换为下方的代码片段：
zh_tw: 移除反白的程式碼，並且用下方的程式碼片段來取代：
