Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: There are multiple ways to specify alignment in SwiftUI. One way is to specify the `alignment` inside `HStack`, `VStack`, or `ZStack`.
de: Es gibt verschiedene Möglichkeiten, die Ausrichtung in SwiftUI festzulegen. Eine Möglichkeit ist, die Ausrichtung mit `alignment` in `HStack`, `VStack` oder `ZStack` festzulegen.
es: Hay muchas maneras de especificar la alineación en SwiftUI. Una consiste en especificar la alineación —`alignment`— dentro de las pilas `HStack`, `VStack` o `ZStack`.
es_419: Hay varias formas de especificar la alineación en SwiftUI. Una de ellas es especificar `alignment` dentro de `HStack`, `VStack` o `ZStack`.
fr: Tu peux préciser l’alignement de plusieurs manières dans SwiftUI. L’une d’elles consiste à indiquer l’`alignment` à l’intérieur des `HStack`, `VStack` ou `ZStack`.
it: Ci sono più modi per specificare l’allineamento in SwiftUI. Un modo è specificare `alignment` dentro `HStack`, `VStack` o `ZStack`.
nl: Er zijn meerdere manieren om uitlijning in SwiftUI op te geven. Eén manier is om de `alignment` in `HStack`, `VStack` of `ZStack` op te geven.
pt: Existem várias maneiras de especificar o alinhamento na SwiftUI. Uma maneira é especificar `alignment` dentro de `HStack`, `VStack` ou `ZStack`.
sv: Det finns flera sätt att ange kantjusteringen i SwiftUI. Ett sätt är att ange `alignment` inuti `HStack`, `VStack` eller `ZStack`.
th: การจัดแนวใน SwiftUI สามารถระบุได้หลายวิธี หนึ่งในนั้นคือการระบุ `alignment` ภายใน `HStack`, `VStack` หรือ `ZStack`
tr: SwiftUI’da hizalamayı belirtmenin birçok yolu var. Bunlardan biri, `HStack`’in, `VStack`’in veya `ZStack`’in içinde `alignment`’ı belirtmektir.
zh_cn: 在 SwiftUI 中指定对齐的方式有多种。其中一种是在 `HStack`（水平堆栈）、`VStack`（垂直堆栈）或 `ZStack`（Z 轴堆栈）内指定 `alignment`（对齐）。
zh_tw: 在 SwiftUI 中有多種方法可指定對齊方式。一種是在 `HStack`、`VStack` 或 `ZStack` 中指定 `alignment`。

source: Try removing the `alignment: .leading` parameter from your `VStack`. The `VStack` is the [container view](glossary://container) and the shelf and books are subviews. This is why the books are aligned to the right edge of your screen.
de: Entferne den `alignment: .leading`-Parameter aus `VStack`. `VStack` ist die [Containeransicht](glossary://container) und das Regal und die Bücher sind Unteransichten. Aus diesem Grund sind die Bücher am rechten Rand des Bildschirms ausgerichtet.
es: Prueba a eliminar el parámetro `alignment: .leading` de la pila `VStack`. `VStack` es la [vista de contenedor](glossary://container) y los estantes y los libros son vistas secundarias. Por este motivo los libros están alineados al borde derecho de la pantalla.
es_419: Intenta eliminar el parámetro `alignment: .leading` de tu `VStack`. La pila `VStack` es la [visualización de contenedor](glossary://container), mientras que el estante y los libros son subvisualizaciones. Esta es la razón por la que los libros están alienados en el borde derecho de la pantalla.
fr: Essaie de supprimer le paramètre `alignment: .leading` de ta `VStack`. La `VStack` est la [vue de conteneur](glossary://container) et l’étagère et les livres sont des sous-vues. C’est la raison pour laquelle les livres sont alignés sur le bord de droite de ton écran.
it: Prova a rimuovere interamente il parametro `alignment: leading` da `VStack`. `VStack` è la [vista contenitore](glossary://container) e lo scaffale e i libri sono viste secondarie. Questo è il motivo per cui i libri risultano allineati sul bordo destro dello schermo.
nl: Verwijder de parameter `alignment: .leading` uit de `VStack`. De `VStack` is de [containerweergave](glossary://container) en de plank en de boeken zijn subweergaven. Dit is waarom de boeken met de rechterkant van het scherm zijn uitgelijnd.
pt: Tente remover o parâmetro `alignment` do `VStack`. O `VStack` é a [visualização de contêiner](glossary://container), e a estante e os livros são subvisualizações. É por isso que os livros estão alinhados à borda direita da tela.
sv: Prova att ta bort parametern `alignment: .leading` från `VStack`. `VStack` är [behållarvyn](glossary://container) och hyllan och böckerna är delvyer. Det är därför böckerna är kantjusterade till höger på skärmen.
th: ลองเอาพารามิเตอร์ `alignment: .leading` ออกจาก `VStack` ของคุณ `VStack` คือ[มุมมองคอนเทนเนอร์](glossary://container)และชั้นวางและหนังสือคือมุมมองย่อย นี่คือสาเหตุที่หนังสือจัดแนวอยู่ชิดขอบด้านขวาของหน้าจอของคุณ
tr: `alignment: .leading` parametresini `VStack`’inden silmeyi dene. `VStack`, [kapsayıcı görüntü](glossary://container), raf ve kitaplar ise alt görüntülerdir. Kitapların, ekranın sağ kenarına hizalanmasının nedeni budur.
zh_cn: 试一下从 `VStack` 移除 `alignment: .leading` 参数。`VStack` 是[容器视图](glossary://container)，书架和图书是子视图。这就是图书对齐到屏幕右侧边缘的原因。
zh_tw: 嘗試從你的 `VStack` 中移除 `alignment: .leading` 參數。`VStack` 是[容器顯示區](glossary://container)，而書架和書籍是子顯示區。這就是書籍會對齊螢幕右側的原因。

source: Notice how your books are now centered. That is because the default is to center align the views inside a `VStack`.
de: Siehst du, wie deine Bücher jetzt zentriert sind? Das kommt daher, dass die Ansichten in `VStack` standardmäßig eine zentrierte Ausrichtung haben.
es: Fíjate en cómo ahora los libros están centrados. Eso es porque la alineación por omisión de las vistas dentro de una pila `VStack` es centrada.
es_419: Observa que ahora tus libros están centrados; esto es porque la alineación predeterminada de `VStack` es centrada.
fr: Tu peux voir que tes livres sont centrés à présent. En effet, l’alignement par défaut des vues à l’intérieur d’une `VStack` est centré.
it: Presta attenzione a come, adesso, i libri compaiono centrati. Ciò avviene perché l’allineamento di default delle viste all’interno di un `VStack` è centrato.
nl: Zoals je ziet, zijn de boeken nu gecentreerd. Dat komt doordat weergaven in een `VStack` standaard gecentreerd worden.
pt: Repare como os livros estão centralizados agora. Isso ocorre porque, dentro de um `VStack`, o padrão é alinhar as visualização ao centro.
sv: Lägg märke till att böckerna är centrerade nu. Det beror på att förvalet är att centrera vyerna inuti en `VStack`.
th: สังเกตว่าตอนนี้หนังสือของคุณจะอยู่กึ่งกลาง นั่นเป็นเพราะค่าเริ่มต้นคือการจัดแนวมุมมองให้อยู่กึ่งกลางภายใน `VStack`
tr: Şimdi kitaplarının nasıl ortalandığına dikkat et. Bunun nedeni, bir `VStack`’in içindeki görüntüleri ortaya hizalamak saptanmış ayardır.
zh_cn: 留意一下图书现在是如何居中的。这是因为 `VStack` 中的视图默认居中对齐。
zh_tw: 注意你的書籍現在是如何置中的。這是因為 `VStack` 內的預設對齊方式是置中的。

source: Now what happens if you want to add another row with the books aligned to the right edge of the shelf?
de: Was wäre denn, wenn du eine weitere Zeile hinzufügen wollen würdest, in der die Bücher am rechten Rand des Regals ausgerichtet sind?
es: ¿Y qué pasa si quieres añadir otra fila y alinear los libros respecto al borde derecho del estante?
es_419: ¿Qué pasa si quieres agregar otra fila con los libros alineados en el borde derecho del estante?
fr: Et si tu souhaites ajouter une autre rangée avec les livres alignés sur le bord droit de l’étagère ?
it: Cosa succede se vuoi aggiungere un’altra riga con i libri allineati sul bordo destro dello scaffale?
nl: Maar wat gebeurt er als je nog een rij wilt toevoegen met boeken die zijn uitgelijnd met de rechterrand van de plank?
pt: O que acontece se você quiser adicionar outra linha com os livros alinhados à margem direita da prateleira?
sv: Vad händer nu om du vill lägga till en annan rad med böckerna kantjusterade till den högra änden av hyllan?
th: ตอนนี้จะเกิดอะไรขึ้นหากคุณต้องการเพิ่มอีกแถวหนึ่งโดยจัดแนวให้หนังสืออยู่ชิดขอบด้านขวาของชั้นวาง
tr: Şimdi, kitapların rafın sağ kenarına hizalandığı başka bir sıra eklemek istersen ne olacak?
zh_cn: 现在，如果你想另加一行，让图书对齐到书架的右侧边缘，该怎么做呢？
zh_tw: 現在，如果你想加入另一列書籍與書架的右側邊緣對齊，會發生什麼？

source: One way is to add another `VStack` and set its alignment to `.trailing`.
de: Eine Möglichkeit wäre, eine weitere Instanz von `VStack` hinzuzufügen und die Ausrichtung auf `.trailing` (Ausrichtung rechts) zu setzen.
es: Una manera de hacerlo es añadir otra pila `VStack` y definir su alineación con el valor`.trailing`.
es_419: Una forma de hacerlo es agregar otra `VStack` y configurar su alineación como `.trailing`.
fr: Tu peux le faire en ajoutant une autre `VStack` et en définissant son alignement sur `.trailing`.
it: Un modo per farlo è aggiungere un altro `VStack` e impostarne l’allineamento su `.trailing`.
nl: Je kunt dit onder andere doen door nog een `VStack` toe te voegen en de uitlijning ervan op `.trailing` in te stellen.
pt: Uma maneira é adicionar outro `VStack` e definir o alinhamento como `.trailing`.
sv: Ett sätt är att lägga till en annan `VStack` och ange dess justering som `.trailing`.
th: วิธีหนึ่งคือเพิ่ม `VStack` อีกรายการแล้วตั้งค่าการจัดแนวเป็น `.trailing`
tr: Bunun bir yolu başka bir `VStack` ekleyip hizalamasını `.trailing` olarak ayarlamaktır.
zh_cn: 方法之一是添加另一个 `VStack`，并将它的对齐设为 `.trailing`（末尾）。
zh_tw: 一個方法是加入另一個 `VStack` 並且設定對齊至 `.trailing`。

source: Add this code below the `Rectangle` inside the `VStack`:
de: Füge diesen Code in `VStack` unter `Rectangle` (Rechteck) ein:
es: Añade este código debajo de `Rectangle` dentro de `VStack`:
es_419: Agrega este código debajo de `Rectangle` dentro de la `VStack`:
fr: Ajoute ce code sous le `Rectangle` à l’intérieur de la `VStack` :
it: Aggiungi questo codice sotto `Rectangle` all’interno di `VStack`:
nl: Voeg deze code toe onder de `Rectangle` in de `VStack`:
pt: Adicione este código abaixo de `Rectangle` dentro do `VStack`:
sv: Lägg till den här koden nedanför `Rectangle` inuti `VStack`:
th: เพิ่มโค้ดนี้ใต้ `Rectangle` ภายใน `VStack`:
tr: Bu kodu `VStack` içinde `Rectangle`’ın altına ekle:
zh_cn: 在 `VStack` 内的 `Rectangle`（矩形）下方添加这些代码：
zh_tw: 將這段程式碼加到 `VStack` 內的 `Rectangle` 下方：

source: One thing to note: In vertical stacks, you can only set the horizontal alignment, like `.leading` or `.trailing`.
de: Du solltest aber beachten, dass du in vertikalen Stapeln (Stacks) nur die horizontale Ausrichtung festlegen kannst, zum Beispiel mit `.leading` (Ausrichtung links) oder `.trailing` (Ausrichtung rechts).
es: Observa esto: en las pilas verticales solo se puede definir la alineación horizontal (o sea, al borde inicial,`.leading`, o al borde final, `.trailing`).
es_419: Ten en cuenta lo siguiente: en las pilas verticales, sólo puedes establecer la alineación horizontal como `.leading` o `.trailing`.
fr: Remarque : Dans les piles verticales, tu peux uniquement définir l’alignement horizontal, comme `.leading` ou `.trailing`.
it: Attenzione: nelle pile verticali, puoi specificare unicamente l’allineamento orizzontale, come `.leading` o `.trailing`.
nl: Belangrijk om te weten is dat je in verticale stapels alleen de horizontale uitlijning (`.leading` of `.trailing`) kunt instellen.
pt: Uma observação: em pilhas verticais, você só pode definir o alinhamento horizontal, como `.leading` ou `.trailing`.
sv: En sak att tänka på: I vertikala travar kan du bara ange den horisontella justeringen, alltså `.leading` eller `.trailing`.
th: สิ่งหนึ่งที่ควรทราบ: ในสแต็คแนวตั้ง คุณสามารถตั้งค่าการจัดแนวในแนวนอน เช่น `.leading` หรือ `.trailing` ได้เท่านั้น
tr: Dikkat edilmesi gereken bir şey: Düşey yığınlarda yalnızca yatay hizalamayı (`.leading` veya `.trailing` gibi) ayarlayabilirsin.
zh_cn: 有一点需要注意：在垂直堆栈中，你只能设定水平对齐，如 `.leading`（开头）或 `.trailing`。
zh_tw: 需要注意的一點：在垂直堆疊中，你只能設定水平對齊（如 `.leading` 或 `.trailing`）。

source: Likewise, in horizontal stacks you can only set the vertical alignment, like `.top` or `.bottom`.
de: Im Vergleich dazu kannst du in horizontalen Stapeln nur die vertikale Ausrichtung festlegen, zum Beispiel mit `.top` (oben) oder `.bottom` (unten).
es: De forma similar, en las pilas horizontales solo se puede definir la alineación vertical (o sea, arriba, `.top`, o abajo, `.bottom`).
es_419: De la misma forma, en las pilas horizontales, sólo puedes establecer la alineación vertical como `.top` o `.bottom`.
fr: De même, dans les piles horizontales, tu peux uniquement définir l’alignement vertical, comme `.top` ou `.bottom`.
it: Allo stesso modo, nelle pile orizzontali puoi specificare unicamente l’allineamento verticale, come `.top` o `.bottom`.
nl: En in horizontale stapels kun je alleen de verticale uitlijning (`.top` of `.bottom`) instellen.
pt: Da mesma forma, em pilhas horizontais, você só pode definir o alinhamento vertical, como `.top` ou `.bottom`.
sv: På liknande sätt kan du bara ange den vertikala justeringen, alltså `.top` eller `.bottom`, i horisontella travar.
th: เช่นเดียวกัน ในสแต็คแนวนอน คุณสามารถตั้งค่าการจัดแนวในแนวตั้ง เช่น `.top` หรือ `.bottom` ได้เท่านั้น
tr: Aynı şekilde, yatay yığınlarda ise yalnızca düşey hizalamayı (`.top` veya `.bottom` gibi) ayarlayabilirsin.
zh_cn: 同样地，在水平堆栈中，你只能设定垂直对齐，如 `.top`（顶部）或 `.bottom`（底部）。
zh_tw: 同樣的，在水平堆疊中，你只能設定垂直對齊（如 `.top` 或 `.bottom`）。

source: Another way to align books to the other side of the shelf is to use a `frame` modifier and specify the `alignment`.
de: Die Bücher lassen sich aber zum Beispiel auch mit dem `frame`-Modifikator (Rahmen) und mit `alignment` (Ausrichtung) am anderen Ende des Regals ausrichten.
es: Otra manera de alinear los libros al otro lado del estante es usar un modificador `frame` y especificar la propiedad de alineación —`alignment`—.
es_419: Otra forma de alinear los libros en el otro lado del estante es usar un modificador `frame` y especificar `alignment`.
fr: Une autre manière d’aligner les livres sur l’autre côté de l’étagère consiste à utiliser un modificateur `frame` et à préciser l’`alignment`.
it: Un altro modo per allineare i libri sull’altro lato dello scaffale è utilizzare il modificatore `frame` e specificare un valore per `alignment`.
nl: Een andere manier om boeken met het andere uiteinde van de plank uit te lijnen, is door een `frame`-modifier te gebruiken en de `alignment` op te geven.
pt: Outra maneira de alinhar livros ao outro lado da prateleira é usar um modificador `frame` e especificar o `alignment`.
sv: Ett annat sätt att kantjustera böcker till den andra sidan av hyllan är att använda en `frame`-modifierare och specificera `alignment`.
th: อีกวิธีหนึ่งในการจัดแนวหนังสือไปยังอีกฝั่งของชั้นวางคือใช้ปุ่มปรับค่า `frame` แล้วระบุ `alignment`
tr: Kitapları rafın diğer tarafına hizalamanın başka bir yolu bir `frame` niteleyicisi kullanıp `alignment`’ı belirtmektir.
zh_cn: 另一种将图书对齐到书架另一端的方法，是使用 `frame`（框架）修饰符并指定 `alignment`。
zh_tw: 將書籍與書架另一側對齊的另一種方法是使用 `frame` 修飾符並指定 `alignment`。

source: Add this code below your last `VStack`:
de: Füge diesen Code unter die letzte Instanz von `VStack` ein:
es: Añade este código debajo de la última pila `VStack`:
es_419: Agrega este código debajo de tu última `VStack`:
fr: Ajoute ce code sous ta dernière `VStack` :
it: Aggiungi questo codice sotto l’ultimo `VStack`:
nl: Voeg deze code toe onder de laatste `VStack`:
pt: Adicione este código abaixo do último `VStack`:
sv: Lägg till den här koden nedanför din sista `VStack`:
th: เพิ่มโค้ดนี้ด้านล่าง `VStack` รายการสุดท้ายของคุณ:
tr: Bu kodu son `VStack`’inin altına ekle:
zh_cn: 在最后一个 `VStack` 下方添加这些代码：
zh_tw: 在最後一個 `VStack` 下方加入這段程式碼：

source: To visualize the frame around the book, add a background color below the `frame` modifier.
de: Um den Rahmen um das Buch zu visualisieren, füge eine Hintergrundfarbe unter dem `frame`-Modifikator ein.
es: Para visualizar el marco en torno al libro, añade un color de fondo debajo del modificador `frame` —marco—.
es_419: Para visualizar el marco alrededor del libro, agrega un color de fondo debajo del modificador `frame`.
fr: Pour visualiser le cadre autour du livre, ajoute une couleur d’arrière-plan sous le modificateur `frame`.
it: Per visualizzare la cornice intorno al libro, aggiungi un colore di sfondo sotto il modificatore `frame`.
nl: Voeg een achtergrondkleur onder de modifier `frame` toe om het kader rond het boek te visualiseren.
pt: Para visualizar o quadro ao redor do livro, adicione uma cor de fundo abaixo do modificador `frame`.
sv: Du kan visualisera ramen runt boken genom att lägga till en bakgrundsfärg nedanför `frame`-modifieraren.
th: ในการแสดงภาพกรอบรอบๆ หนังสือ ให้เพิ่มสีพื้นหลังด้านล่างปุ่มปรับค่า `frame`
tr: Kitabın etrafındaki çerçeveyi görselleştirmek için `frame` niteleyicisinin alt tarafına bir arka plan rengi ekle.
zh_cn: 如果要可视化图书外围的框架，你可以在 `frame` 修饰符下方添加背景颜色。
zh_tw: 若要視覺化書籍周圍的框架，請在 `frame` 修飾符下方加入背景顏色。

source: By setting the `maxWidth` to `.infinity`, you stretch the `Image` view horizontally until it fills in the remaining space.
de: Indem du `maxWidth` (maximale Breite) auf `.infinity` (unendlich) setzt, dehnst du die `Image`-Ansicht (Bild) horizontal so weit, bis sie den verbleibenden Platz ausgefüllt hat.
es: Definiendo el valor de `maxWidth` en `.infinity`, estarás estirando la vista `Image` en horizontal hasta rellenar todo el espacio que quede.
es_419: Si configuras el ancho máximo (`maxWidth`) como `.infinity`, la visualización `Image` se alarga horizontalmente hasta que rellena el espacio restante.
fr: En définissant la `maxWidth` sur `.infinity`, tu étires la vue `Image` horizontalement jusqu’à ce qu’elle remplisse tout lʼespace restant.
it: Impostando `maxWidth` su `.infinity`, estendi la vista `Image` orizzontalmente fino a riempire tutto lo spazio rimanente.
nl: Door `maxWidth` op `.infinity` in te stellen, rek je de `Image`-weergave horizontaal uit tot alle resterende ruimte is gevuld.
pt: Ao definir `maxWidth` como `.infinity`, você estica a visualização `Image` horizontalmente até ela preencher todo o espaço restante.
sv: Genom att ställa in `maxWidth` som `.infinity` sträcker du ut `Image`-vyn horisontellt tills den fyller det återstående utrymmet.
th: เมื่อตั้งค่า `maxWidth` เป็น `.infinity` คุณจะยืดมุมมอง `Image` ออกไปในแนวนอนจนกว่าจะเต็มพื้นที่ที่เหลือ
tr: `maxWidth`’i `.infinity`’ye ayarlayarak `Image` görüntüsünü kalan alanın hepsini dolduruncaya kadar yatay olarak uzatmış olursun.
zh_cn: 将 `maxWidth`（最大宽度）设为 `.infinity`（无限）时，`Image` 视图会水平拉伸，直至填满剩余的空间。
zh_tw: 將 `maxWidth` 設定為 `.infinity`，你可以水平延展 `Image` 顯示區，直到它填滿剩餘的空間。

source: Setting `alignment` parameter to `.trailing` makes the `frame` contents align to the `.trailing` edge.
de: Durch Festlegen des `alignment`-Parameters auf `.trailing` werden alle Inhalte in `frame` basierend auf `.trailing` rechts ausgerichtet.
es: Ajustar el parámetro `alignment` en`.trailing` hace que el contenido de `frame` se alinee al borde final (`.trailing`).
es_419: Si configuras el parámetro `alignment` como `.trailing`, todo el contenido de `frame` se alineará con el borde `.trailing`.
fr: Si tu règles le paramètre `alignment` sur `.trailing`, le contenu présent à l’intérieur du `frame` s’aligne sur le bord `.trailing`.
it: Impostando il parametro `alignment` su `.trailing` i contenuti di `frame` si allineano sul bordo `.trailing`.
nl: Als je de parameter `alignment` instelt op `.trailing`, wordt de inhoud van het `frame` uitgelijnd met de `.trailing`-rand.
pt: Ao definir o parâmetro `alignment` como `.trailing`, o conteúdo do `frame` é alinhado à margem `.trailing`.
sv: När du ställer in parametern `alignment` som `.trailing` blir innehållet i `frame` kantjusterat till `.trailing`-kanten.
th: การตั้งค่าพารามิเตอร์ `alignment` เป็น `.trailing` จะทำให้เนื้อหา `frame` จัดแนวไปที่ขอบ `.trailing`
tr: `alignment` parametresini `.trailing`’e ayarlamak, `frame` içeriğinin sondaki (`.trailing`) kenara hizalanmasını sağlar.
zh_cn: 将 `alignment` 参数设为 `.trailing` 时，`frame` 内容会对齐到 `.trailing` 边缘。
zh_tw: 將 `alignment` 參數變為 `.trailing` 會讓 `frame` 的內容對齊到 `.trailing` 邊緣。

source: But wait, there’s more! You can also achieve the same results with a [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
de: Es gibt aber noch mehr Möglichkeiten! Das gleiche Ergebnis kannst du auch mit einem [Spacer (Abstandshalter)](doc://com.apple.documentation/documentation/swiftui/spacer) erzielen.
es: ¡Y hay más! También puedes conseguir los mismos resultados usando un [espaciador](doc://com.apple.documentation/documentation/swiftui/spacer).
es_419: ¡Y aún hay más! También puedes hacer lo mismo con un espaciador [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
fr: Ce n’est pas tout ! Tu peux également obtenir les même résultats avec une [espace](doc://com.apple.documentation/documentation/swiftui/spacer) !
it: Ma non è finita qui! Puoi ottenere gli stessi risultati anche con [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
nl: Maar wacht, dat is nog niet alles! Je kunt hetzelfde ook bereiken met een [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
pt: Mas espere, tem mais! Você pode obter os mesmos resultados com um [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
sv: Det finns mer! Du kan också åstadkomma samma resultat med en [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
th: แต่เดี๋ยวก่อน ยังมีอีกนะ! คุณยังสามารถทำให้เกิดผลลัพธ์เดียวกันนี้ได้ด้วย[ที่ว่าง](doc://com.apple.documentation/documentation/swiftui/spacer)
tr: Ama bitmedi, dahası var! Aynı sonucu bir [aralayıcı](doc://com.apple.documentation/documentation/swiftui/spacer) ile de elde edebilirsin.
zh_cn: 稍等一下，方法远不止这些！你还可以使用 [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer)（留白器）来获得同样的结果。
zh_tw: 但是等等，還不只如此！你也可以使用 [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer) 來達成相同的結果。

source: Add this code below your other views inside the `VStack` to try it out:
de: Füge diesen Code unter den anderen Ansichten in `VStack` ein, um es auszuprobieren:
es: Pruébalo añadiendo este código debajo de las otras vistas de dentro de la pila `VStack`:
es_419: Agrega este código debajo de tus otras visualizaciones dentro de la `VStack` para intentarlo:
fr: Ajoute ce code sous tes autres vues à l’intérieur de la `VStack` pour essayer :
it: Per provare a farlo, aggiungi questo codice sotto le altre viste all’interno di `VStack`:
nl: Voeg deze code toe onder je andere weergaven in de `VStack` om dit uit te proberen:
pt: Adicione este código abaixo das outras visualizações dentro do `VStack` para testá‑lo:
sv: Lägg till den här koden nedanför de andra vyerna inuti `VStack` för att testa den:
th: เพิ่มโค้ดนี้ด้านล่างมุมมองอื่นๆ ของคุณภายใน `VStack` เพื่อทดสอบ:
tr: Denemek için bu kodu `VStack` içinde diğer görüntülerinin altına ekle:
zh_cn: 在 `VStack` 内的其他视图下方添加这些代码来试试：
zh_tw: 將這段程式碼加入 `VStack` 中的其他顯示區下方來試看看：
