Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

# GuideBook..title
source: Laying Out Views
de: Layouts für Ansichten erstellen
es: Disposición de vistas
es_419: Diseña visualizaciones
fr: Disposition de vues
it: Applicare un layout alle viste
nl: Weergavelay-outs
pt: Criando Visualizações
sv: Layouta vyer
th: การวางเค้าโครงมุมมอง
tr: Görüntüleri Yerleştirme
zh_cn: 布局视图
zh_tw: 佈局顯示區

# GuideBook..WelcomeMessageCreate a unique journal app! 📓💕..title
source: Create a unique journal app! 📓💕
de: Erstelle eine einzigartige Tagebuch-App! 📓💕
es: ¡Crea una app única para escribir tu diario! 📓💕
es_419: ¡Crea una app de diario única! 📓💕
fr: Crée une app de journal unique ! 📓💕
it: Creare un’app diario unica! 📓💕
nl: Een unieke dagboekapp aanmaken! 📓💕
pt: Crie um app diário exclusivo! 📓💕
sv: Skapa en unik journalapp! 📓💕
th: สร้างแอปบันทึกประจำวันสุดพิเศษ! 📓💕
tr: Eşsiz bir günlük uygulaması yarat! 📓💕
zh_cn: 创建一个独特的日记 App！📓💕
zh_tw: 製作一個獨有的日記 App！📓💕

# GuideBook..WelcomeMessageCreate a unique journal app! 📓💕..Paragraph0
source: Learn the basics of how to lay out a variety of views in SwiftUI to extend the journal app with more fun views. Ready to get started?
de: Lerne die Grundlagen für das Layout einer Vielzahl von Ansichten in SwiftUI, um die Tagebuch-App mit interessanteren Ansichten zu erweitern. Bist du bereit?
es: Aprende los conceptos básicos de cómo ajustar la disposición de las vistas en SwiftUI para poder ampliar la app de diario con algunas vistas más. ¿Está todo listo para empezar?
es_419: Aprende los conceptos básicos de cómo colocar diversas visualizaciones en SwiftUI para poder ampliar la app de diario con más visualizaciones divertidas. ¿Tienes todo listo para empezar?
fr: Découvre les bases de la disposition d’une variété de vues dans SwiftUI pour étoffer l’app de journal avec d’autres vues amusantes. Prêt à te lancer ?
it: Scopri le informazioni di base su come impostare il layout per una serie di viste in SwiftUI per estendere l’app diario con altre viste divertenti. È tutto pronto per iniziare?
nl: Leer hoe je de lay-out instelt van uiteenlopende weergaven in SwiftUI zodat je de dagboekapp kunt uitbreiden met een paar leuke weergaven. Ben je klaar om aan de slag te gaan?
pt: Aprenda os conceitos básicos de como distribuir uma variedade de visualizações na SwiftUI para expandir o app de diário com algumas visualizações mais divertidas. Tudo pronto para começar?
sv: Lär dig grunderna om hur du skapar layouter för en mängd olika vyer i SwiftUI så att du kan utöka journalappen med fler roliga vyer. Är du redo att börja?
th: เรียนรู้ข้อมูลพื้นฐานเกี่ยวกับวิธีวางเค้าโครงมุมมองที่หลากหลายใน SwiftUI เพื่อต่อเติมแอปบันทึกประจำวันด้วยมุมมองสนุกๆ เพิ่มมากขึ้น พร้อมจะเริ่มแล้วหรือยัง
tr: Günlük uygulamasını başka eğlenceli görüntülerle genişletmek için SwiftUI’da çeşitli görüntüleri yerleştirmenin temel bilgilerini öğren. Başlamaya hazır mısın?
zh_cn: 了解如何在 SwiftUI 中布局各种视图的基础知识，然后通过更有趣的视图来扩展日记 App。准备好了吗？
zh_tw: 學習如何在 SwiftUI 中佈局各種顯示區的基本知識，用更多有趣的顯示區來擴展日記 App。準備好開始了嗎？

# GuideBook..Guide0..StepMy Journal..title
source: My Journal
de: Mein Tagebuch
es: “Mi diario”
es_419: Mi Diario
fr: Mon journal
it: Il mio diario
nl: Mijn dagboek
pt: Meu Diário
sv: Min journal
th: บันทึกประจำวันของฉัน
tr: Günlüğüm
zh_cn: 我的日记
zh_tw: 我的日記

# GuideBook..Guide0..StepMy Journal..LearningCenterContent..Paragraph2
source: When creating an app, one of the first skills to learn is how to lay out your [user interface](glossary://user%20interface), or UI. When laying out a UI, there are three major things you need to do:
de: Beim Erstellen von Apps lernst du in der Regel als Erstes, wie du das Layout für deine [Benutzeroberfläche](glossary://user%20interface) (auch als „UI“ abgekürzt) erstellst. Beim Erstellen einer Benutzeroberfläche musst du drei wichtige Dinge erledigen:
es: Al crear apps, una de las primeras cosas que tienes que aprender es cómo disponer la [interfaz de usuario](glossary://user%20interface), o IU. Estas son las tres cosas más importantes que tendrás que hacer al realizar la disposición de una IU:
es_419: Al crear una app, una de las primeras habilidades que tienes que aprender es cómo acomodar tu [interfaz de usuario](glossary://user%20interface) o IU. Para acomodarla, hay tres cosas principales que debes hacer:
fr: Lors de la création d’une app, une des premières compétences à assimiler est celle permettant de définir ton [interface utilisateur](glossary://user%20interface), ou IU. Quand tu définis ton IU, il y a trois choses à faire en priorité :
it: Durante la creazione di un’app, una delle prime competenze da apprendere è la configurazione del layout dell’[interfaccia utente](glossary://user%20interface) o UI. Quando configuri il layout di una UI, devi svolgere tre azioni importanti:
nl: Een van de eerste vaardigheden die je moet leren als je een app aanmaakt, is hoe je de lay-out van de [gebruikersinterface](glossary://user%20interface) instelt. Om de lay-out van de gebruikersinterface in te stellen, moet je drie belangrijke dingen doen:
pt: Ao criar um app, uma das primeiras habilidades a aprender é como criar o layout da [interface de usuário](glossary://user%20interface), ou UI. Ao criar o layout de uma IU, há três coisas importantes que você precisa fazer:
sv: När du skapar en app är en av de första färdigheterna du lär dig att layouta ett [användargränssnitt](glossary://user%20interface) (förkortas UI för User Interface). När du layoutar ett UI finns det tre större saker du måste göra:
th: เมื่อสร้างแอป หนึ่งในทักษะแรกๆ ที่ควรเรียนรู้คือการวางเค้าโครง[อินเทอร์เฟซผู้ใช้](glossary://user%20interface)หรือ UI ของคุณ เมื่อวางเค้าโครง UI มีสามสิ่งหลักที่คุณต้องทำ:
tr: Bir uygulama yaratırken ilk öğrenilecek becerilerden biri [kullanıcı arayüzünü](glossary://user%20interface) yerleştirmektir. Kullanıcı arayüzünü yerleştirirken yapman gereken üç önemli şey vardır:
zh_cn: 创建 App 时，首先要学习的技能之一是如何给[用户界面](glossary://user%20interface)或 UI 布局。给 UI 布局时，你需要做三件主要的事情：
zh_tw: 製作 App 時，首先要學習的技能之一是如何佈局你的[使用者介面](glossary://user%20interface)或 UI。在佈局 UI 時，你有三件主要的工作：

source: Organize your views in different configurations using [container views](glossary://container).
de: Ordne deine Ansichten mit [Container-Ansichten](glossary://container) in verschiedenen Konfigurationen an.
es: Organiza las vistas en diferentes configuraciones usando [vistas de contenedor](glossary://container).
es_419: Organizar tus visualizaciones en distintas configuraciones mediante las [visualizaciones de contenedor](glossary://container).
fr: Organise tes vues dans différentes configurations à l’aide de [vues de conteneur](glossary://container).
it: Organizza le viste in diverse configurazioni usando [viste contenitore](glossary://container).
nl: Maak verschillende configuraties voor je weergaven aan met behulp van [containerweergaven](glossary://container).
pt: Organize as visualizações em diferentes configurações usando [visualizações de contêiner](glossary://container).
sv: Ordna vyer i olika konfigurationer med [behållarvyer](glossary://container).
th: จัดระเบียบมุมมองของคุณด้วยการกำหนดค่าที่แตกต่างกันโดยใช้[มุมมองคอนเทนเนอร์](glossary://container)
tr: [Kapsayıcı görüntülerini](glossary://container) kullanarak görüntülerini farklı konfigürasyonlarda düzenle.
zh_cn: 使用[容器视图](glossary://container)整理不同配置的视图。
zh_tw: 使用[容器顯示區](glossary://container)來以不同的設定排列顯示區。

source: Fine tune the sizing, spacing, alignment, and positioning of your views.
de: Passe präzise Eigenschaften wie Größe, Abstand, Ausrichtung und Position deiner Ansichten an.
es: Ajusta con precisión el tamaño, el espaciado, la alineación y la posición de las vistas.
es_419: Ajustar el tamaño, espacio, alineación y posición de tus visualizaciones.
fr: Ajuste la taille, l’espacement, l’alignement et le positionnement de tes vues.
it: Regola con precisione dimensioni, spaziatura, allineamento e posizionamento delle viste.
nl: Pas de grootte, afstand, uitlijning en positie van de weergaven verder aan.
pt: Ajuste o dimensionamento, o espaçamento, o alinhamento e o posicionamento das visualizações.
sv: Finjustera vyernas storlek, mellanrum, kantjustering och placering.
th: ปรับแต่งการกำหนดขนาด การเว้นระยะห่าง การจัดแนว และการวางตำแหน่งมุมมองของคุณอย่างละเอียด
tr: Görüntülerinin boyutu, aralığı, hizalaması ve konumu ile ilgili ince ayarlar yap.
zh_cn: 微调视图的大小、间距、对齐和位置。
zh_tw: 微調你的顯示區大小、間距、對齊和位置。

source: Debug your views when something goes wrong.
de: Debugge deine Ansichten, wenn etwas schiefgeht.
es: Depura las vistas si algo no va bien.
es_419: Depurar tus visualizaciones cuando ocurra algún problema.
fr: Débogue tes vues lorsqu’une erreur se produit.
it: Esegui il debug delle viste quando qualcosa va storto.
nl: Spoor fouten in je weergaven op als er iets mis gaat.
pt: Depure suas visualizações quando algo der errado.
sv: Felsök vyerna när något blir fel.
th: แก้บั๊กมุมมองของคุณเมื่อมีข้อผิดพลาด
tr: Bir sorun oluşması durumunda görüntülerindeki hataları ayıkla.
zh_cn: 出现错误时调试视图。
zh_tw: 發生錯誤時，為你的顯示區除錯。

# GuideBook..Guide0..StepMy Journal..LearningCenterContent..Paragraph6
source: In this sample, you’ll learn all of these skills and more, and then use them to add views with different layouts to the journal app. Ready to start your journey into view layout?
de: In diesem Beispiel lernst du alle diese Fähigkeiten und noch mehr. Im Anschluss daran verwendest du dein neu erlerntes Wissen, um Ansichten mit verschiedenen Layouts zur Tagebuch-App hinzuzufügen. Bist du bereit, in die Welt der Ansichtenlayouts einzutauchen?
es: En este ejemplo, aprenderás todas estas habilidades y otras, para usarlas para añadir vistas y diversas disposiciones a la app de diario. ¿Quieres empezar tu viaje a la disposición de vistas?
es_419: En esta muestra, aprenderás todas estas habilidades y más, y las usarás para agregar visualizaciones con distintas disposiciones a la app de diario. ¿Tienes todo listo para embarcarte en el viaje de disposición de visualizaciones?
fr: Dans cet échantillon, tu apprendras toutes ces compétences et bien d’autres, puis tu les utiliseras pour ajouter des vues avec différentes dispositions à l’app de journal. Es-tu prêt à commencer ton voyage dans la disposition des vues ?
it: Grazie a questo esempio, acquisirai tutte queste competenze e anche molte altre, che potrai poi utilizzare per aggiungere viste con layout diversi all’app diario. È tutto pronto per dare inizio alla tua esperienza con il layout delle viste?
nl: In dit voorbeeld ga je deze en andere vaardigheden leren en ze vervolgens gebruiken om weergaven met verschillende lay-outs aan de dagboekapp toe te voegen. Ben je klaar om de wereld van de weergavelay-out te ontdekken?
pt: Neste exemplo, você aprenderá todas essas habilidades e outras, e as usará para adicionar visualizações com layouts diferentes ao app de diário. Tudo certo para iniciar a jornada de layout de visualizações?
sv: I det här exemplet lär du dig alla de färdigheterna och mer. Sedan använder du dem för att lägga till vyer med olika layouter i journalappen. Är du redo att börja lära dig om vylayout?
th: ในตัวอย่างนี้ คุณจะได้เรียนรู้ทักษะทั้งหมดนี้และอื่นๆ เพื่อใช้เพิ่มมุมมองที่มีเค้าโครงแตกต่างกันไปยังแอปบันทึกประจำวัน พร้อมจะเริ่มต้นเส้นทางการเรียนรู้เกี่ยวกับเค้าโครงมุมมองหรือยัง
tr: Bu örnekte, bu becerilerin tümünü ve daha fazlasını öğrenecek ve daha sonra günlük uygulamasına farklı yerleşimlere sahip görüntüler eklemek için bunları kullanacaksın. Görüntü yerleşimi yolculuğuna başlamaya hazır mısın?
zh_cn: 在这个示例中，你将学习所有的这些技能及更多内容，然后使用它们给日记 App 添加不同布局的视图。准备好开始视图布局之旅了吗？
zh_tw: 在此範例中，你將學習所有這些和更多其他技能，然後使用它們將具有不同佈局的顯示區加入日記 App。準備好開始你的顯示區佈局之旅了嗎？

source: Start Walkthrough
de: Schritt-für-Schritt-Anleitung starten
es: Iniciar el tutorial
es_419: Iniciar tutorial
fr: Commencer les explications
it: Avvia la guida passo passo
pt: Iniciar Passo a Passo
sv: Starta genomgången
th: เริ่มการสาธิต
tr: Kılavuzu Başlat
zh_cn: 开始演示
zh_tw: 開始演練

source: AX description for button
de: Bedienungshilfen-Beschreibung für Taste
es: Descripción de accesibilidad del botón
es_419: Descripción de accesibilidad del botón
fr: Description d’accessibilité pour le bouton
it: Descrizione di accessibilità per il pulsante
nl: Toegankelijkheidsbeschrijving voor knop
pt: Descrição de acessibilidade do botão
sv: Hjälpmedelsbeskrivning för knapp
th: คำอธิบาย AX สำหรับปุ่ม
tr: Düğme için erişilebilirlik açıklaması
zh_cn: 按钮辅助功能描述
zh_tw: 按鈕的 AX 描述

# GuideBook..Guide0..StepMy Journal..TaskGroup0..title
source: Deep dive into view layout
de: Wissen über Ansichtenlayouts vertiefen
es: Más detalle en el diseño de las vistas
es_419: Adentrarse en la disposición de visualizaciones
fr: Plonge-toi dans la présentation de la vue
it: Perfezionare il layout delle viste
nl: Meer informatie over weergavelay-outs
pt: Mergulhe fundo no layout de visualizações
sv: Gör en djupdykning i vylayout
th: เจาะลึกเกี่ยวกับเค้าโครงมุมมอง
tr: Görüntü yerleşimini derinlemesine öğrenme
zh_cn: 深入了解视图布局
zh_tw: 深入研究顯示區佈局

# GuideBook..Guide0..StepMy Journal..TaskGroup0..Taskcontainers..title
source: Organize your views
de: Ansichten organisieren
es: Organizar las vistas
es_419: Organizar las visualizaciones
fr: Organiser tes vues
it: Organizzare le viste
nl: Weergaven ordenen
pt: Organize as visualizações
sv: Ordna vyer
th: จัดระเบียบมุมมองของคุณ
tr: Görüntülerini düzenleme
zh_cn: 整理视图
zh_tw: 排列你的顯示區

# GuideBook..Guide0..StepMy Journal..TaskGroup0..Taskcontainers..Page0..Paragraph7
source: A view can act as a [container](glossary://container) that holds and organizes other views, known as [subviews](glossary://subview).
de: Eine Ansicht kann als [Container](glossary://container) fungieren, der andere Ansichten enthält und organisiert. Diese werden dann als [Unteransichten](glossary://subview) bezeichnet.
es: Una vista puede actuar como [contenedor](glossary://container) que contiene y organiza otras vistas, conocidas como [vistas secundarias](glossary://subview).
es_419: Una visualización puede servir como [contenedor](glossary://container) que contiene y organiza otras visualizaciones, que se denominan [subvisualizaciones](glossary://subview).
fr: Une vue peut agir comme un [conteneur](glossary://container) qui contient et organise d’autres vues, appelées des [sous-vues](glossary://subview).
it: Una vista può agire come un [contenitore](glossary://container) che contiene e organizza altre viste, note come [viste secondarie](glossary://subview).
nl: Een weergave kan als een [container](glossary://container) fungeren die andere weergaven bevat en ordent, de zogenaamde [subweergaven](glossary://subview).
pt: Uma visualização pode agir como um [contêiner](glossary://container) que mantém e organiza outras visualizações, conhecidas como [subvisualizações](glossary://subview).
sv: En vy kan fungera som en [behållare](glossary://container) där andra vyer lagras och ordnas, så kallade [delvyer](glossary://subview).
th: มุมมองสามารถทำหน้าที่เป็น[คอนเทนเนอร์](glossary://container)ที่บรรจุและจัดระเบียบมุมมองอื่นๆ ซึ่งเรียกว่า[มุมมองย่อย](glossary://subview)ได้
tr: Bir görüntü, [alt görüntü](glossary://subview) olarak bilinen başka görüntüleri içeren ve düzenleyen bir [kapsayıcı](glossary://container) görevi görebilir.
zh_cn: 视图可作为[容器](glossary://container)包含和整理其他视图，被包含的视图叫作[子视图](glossary://subview)。
zh_tw: 顯示區可以作為[容器](glossary://container)來保存和排列其他顯示區，稱為[子顯示區](glossary://subview)。

# GuideBook..Guide0..StepMy Journal..TaskGroup0..Taskcontainers..Page0..Paragraph8
source: The [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) below is an example of a container view that organizes two `Circle` subviews vertically.
de: Die unten aufgeführte Instanz von [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) ist ein Beispiel für eine solche Containeransicht, die zwei `Circle`-Unteransichten (Kreis) vertikal anordnet.
es: La pila [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) siguiente es un ejemplo de una vista de contenedor que organiza en vertical dos vistas secundarias `Circle`.
es_419: La siguiente [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) es un ejemplo de una visualización de contenedor que organiza dos subvisualizaciones `Circle` de forma vertical.
fr: La [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) ci-dessous constitue un exemple de vue de conteneur qui organise deux sous-vues `Circle` verticalement.
it: Il [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) qui sotto è un esempio di vista contenitore che organizza verticalmente due viste secondarie `Circle`.
nl: De [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) hieronder is een voorbeeld van een containerweergave waarin twee `Circle`-subweergaven verticaal worden geordend.
pt: O [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) abaixo é um exemplo de visualização de contêiner que organiza duas subvisualizações `Circle` verticalmente.
sv: [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) nedan är ett exempel på en behållarvy som ordnar två `Circle`-delvyer vertikalt.
th: [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) ด้านล่างคือตัวอย่างของมุมมองคอนเทนเนอร์ที่จัดระเบียบมุมมองย่อย `Circle` สองมุมมองในแนวตั้ง
tr: Aşağıdaki [VStack](doc://com.apple.documentation/documentation/swiftui/vstack), iki `Circle` alt görüntüsünü düşey olarak düzenleyen bir kapsayıcı görüntüsü örneğidir.
zh_cn: 下方的 [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) 是一个容器视图垂直整理两个 `Circle`（圆形）子视图的示例。
zh_tw: 下方的 [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) 是一個容器顯示區的範例，它垂直排列兩個 `Circle` 子顯示區。

# GuideBook..Guide0..StepMy Journal..TaskGroup0..Taskcontainers..Page1..Paragraph9
source: Add one more circle into the `VStack`. Now you have three circles in your stack which causes all of the circle views to shrink.
de: Füge einen weiteren Kreis in `VStack` ein. Jetzt hast du drei Kreise in deinem Stapel, was dazu führt, dass alle Kreisansichten schrumpfen.
es: Añade un círculo más al contenedor `VStack`. Ahora mismo en la pila hay tres círculos, de manera que todas las vistas de círculo se deben hacer más pequeñas.
es_419: Agrega otro círculo a la pila `VStack`. Ahora tienes tres círculos en tu pila, lo que ocasiona que todas las visualizaciones de círculos se reduzcan.
fr: Ajoute un autre cercle à la `VStack`. Tu disposes à présent de trois cercles dans ta pile, ce qui fait diminuer la taille de toutes les vues de cercle.
it: Aggiungi un altro cerchio in `VStack`. Ora, nella pila sono presenti tre cerchi, il che fa sì che tutte le viste dei cerchi si riducano.
nl: Voeg nog een cirkel toe aan de `VStack`. De stapel bevat nu drie cirkels waardoor alle cirkelweergaven kleiner worden.
pt: Adicione mais um círculo ao `VStack`. Agora você tem três círculos na pilha, o que faz com que todas as visualizações de círculo encolham.
sv: Lägg till ytterligare en cirkel i `VStack`. Nu har du tre cirklar i traven, så alla cirkelvyerna krymper.
th: เพิ่มวงกลมอีกหนึ่งวงไปยัง `VStack` ตอนนี้คุณจะมีวงกลมสามวงในสแต็คของคุณซึ่งทำให้มุมมองวงกลมทั้งหมดหดเล็กลง
tr: `VStack`’e bir daire daha ekle. Şimdi yığınında üç daire var ve bu da tüm daire görüntülerinin küçülmesine neden oluyor.
zh_cn: 在 `VStack` 中再添加一个圆形。现在堆栈中有三个圆形了，这会造成所有圆形视图收缩。
zh_tw: 再將一個圓形加入你的 `VStack`。現在你的堆疊中有三個圓形，導致所有圓形顯示區都縮小了。

source: This is because containers, like this `VStack`, divide the space available to their [subviews](glossary://subview). In this case, the container offers the same amount of space to all three circle views, since they have the exact same sizing requirements.
de: Der Grund hierfür ist, dass Container wie diese Instanz von `VStack` den für ihre [Unteransichten](glossary://subview) verfügbaren Platz aufteilen. In diesem Fall stellt der Container denselben Platz für alle drei Kreisansichten bereit, da sie alle dieselben Größenanforderungen aufweisen.
es: Esto ocurre porque los contenedores, como esta `VStack`, dividen el espacio disponible entre sus [vistas secundarias](glossary://subview). En este caso, el contenedor asigna la misma cantidad de espacio a las tres vistas de círculo, ya que tienen exactamente los mismos requisitos de tamaño.
es_419: Esto se debe a que los contenedores, como esta `VStack`, dividen el espacio disponible para sus [subvisualizaciones](glossary://subview). En este caso, el contenedor ofrece la misma cantidad de espacio a las tres visualizaciones de círculos, ya que tienen los mismos requisitos de tamaño.
fr: En effet, les conteneurs, comme cette `VStack`, divisent l’espace disponible pour leurs [sous-vues](glossary://subview). Dans le cas présent, le conteneur accorde la même quantité d’espace aux trois vues de cercle, car elles présentent exactement les mêmes exigences de taille.
it: Questo perché i contenitori, come questo `VStack`, dividono lo spazio disponibile per le loro [viste secondarie](glossary://subview). In questo caso, il contenitore offre la stessa quantità di spazio a tutte e tre le viste cerchio, poiché hanno gli stessi requisiti di dimensione.
nl: Dit komt doordat containers, zoals deze `VStack`, de beschikbare ruimte onder hun [subweergaven](glossary://subview) verdelen. In dit geval stelt de container dezelfde hoeveelheid ruimte beschikbaar aan de drie cirkelweergaven omdat ze dezelfde groottevereisten hebben.
pt: Isso ocorre porque contêineres, como esse `VStack`, dividem o espaço disponível para suas [subvisualizações](glossary://subview). Nesse caso, o contêiner oferece a mesma quantidade de espaço para as três visualizações de círculo, já que elas têm exatamente os mesmos requisitos de tamanho.
sv: Det beror på att behållare, som denna `VStack`, delar upp utrymmet som är tillgängligt för deras [delvyer](glossary://subview). I det här fallet får alla tre cirkelvyerna lika stort utrymme av behållaren eftersom de har exakt likadana storlekskrav.
th: ที่เป็นเช่นนี้เนื่องจากคอนเทนเนอร์ต่างๆ เช่น `VStack` นี้ จะแบ่งพื้นที่ที่มีให้กับ[มุมมองย่อย](glossary://subview)ของตัวเอง ในกรณีนี้ คอนเทนเนอร์มีการจัดปริมาณพื้นที่ที่เท่ากันให้กับมุมมองวงกลมทั้งสามมุมมอง เนื่องจากมุมมองเหล่านั้นมีข้อกำหนดด้านขนาดที่เหมือนกัน
tr: Bunun nedeni, bu `VStack` gibi kapsayıcıların kullanılabilir alanı kendi [alt görüntülerine](glossary://subview) bölmesidir. Bu durumda kapsayıcı, üç daire görüntüsü de aynı büyüklük gereksinimlerine sahip olduğu için bunların hepsine aynı büyüklükte bir alan sunar.
zh_cn: 这是因为容器（例如这个 `VStack`）会将可用空间划分给它的[子视图](glossary://subview)。在这里，容器会向全部三个圆形视图提供相同的空间，因为它们有着完全相同的大小需求。
zh_tw: 這是因為容器（如 `VStack`）會將可用空間劃分給它們的[子顯示區](glossary://subview)。在這種情況下，容器會為所有三個圓形顯示區提供相同大小的空間，因為它們有完全相同的大小需求。
