Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: Can you figure out a way to make this happen? Remember that you can add a `border` to visualize how much space your view needs and compare it to how you think the view should behave.
de: Hast du eine Idee, wie sich das umsetzen lässt? Denk dran: Du kannst `border` zum Anzeigen des Platzes, den deine Ansicht benötigt, hinzufügen. Diesen Rand kannst du dann nutzen, um zu vergleichen, ob sich die Ansicht deiner Meinung nach richtig verhält.
es: ¿Se te ocurre alguna forma para que esto ocurra? Recuerda que puedes añadir un `border` para visualizar cuánto espacio necesita la vista y compáralo con cómo crees que debería ser el comportamiento de la vista.
es_419: ¿Se te ocurre alguna forma de lograr esto? Recuerda que puedes agregar un borde (`border`) para visualizar cuánto espacio necesita la visualización y luego compararlo con la forma en la que crees que se debería comportar.
fr: Trouves-tu un moyen de procéder ? Souviens-toi que tu peux ajouter une `border` pour visualiser l’espace dont a besoin ta vue et comparer avec le résultat que tu attends.
it: Riesci a trovare un modo per farlo? Ricorda che puoi aggiungere `border` per visualizzare quanto spazio serve alla tua vista e confrontarlo con il comportamento che ritieni debba avere la vista.
nl: Kun je bedenken hoe je dit voor elkaar kunt krijgen? Zoals je weet, kun je een `border` toevoegen om te visualiseren hoeveel ruimte je weergave nodig heeft. Vergelijk dit met de manier waarop je denkt dat de weergave zou moeten werken.
pt: Você consegue descobrir uma maneira de fazer isso? Lembre‑se de que você pode adicionar um `border` para visualizar quanto espaço a visualização precisa e compará‑lo a como você acha que a visualização deve se comportar.
sv: Kan du komma på hur du gör det? Kom ihåg att du kan lägga till en `border` som visualiserar hur mycket utrymme som vyn behöver och jämföra den med hur du tycker att vyn ska bete sig.
th: คุณคิดออกไหมว่าจะทำสิ่งนี้ได้อย่างไร อย่าลืมว่าคุณสามารถเพิ่ม `border` เพื่อแสดงภาพพื้นที่ที่มุมมองของคุณต้องใช้ และเปรียบเทียบกับลักษณะการทำงานของมุมมองที่คุณคิดได้
tr: Bu işi gerçekleştirmenin bir yolunu bulabilir misin? Görüntünün ne kadar yere ihtiyacı olduğunu görselleştirmek için bir kenar (`border`) ekleyebileceğini unutma ve bunu görüntünün davranması gerektiğini düşündüğün şekliyle karşılaştır.
zh_cn: 你能找到解决的办法吗？别忘了你可以添加 `border` 来可视化视图所需的空间，并与你预期的视图行为做比较。
zh_tw: 你能想出一個方法來實現這一點嗎？請記住，你可以加入一個 `border` 來視覺化顯示區需要多少空間，並將它和你認為顯示區應有的動作進行比較。

source: There are two ways to align the crown to the bottom of your `HalfCard` view.
de: Es gibt zwei Möglichkeiten, die Krone unten in der `HalfCard`-Ansicht auszurichten.
es: Hay dos maneras de alinear la corona con la parte inferior de la vista `HalfCard`.
es_419: Hay dos formas de alinear la corona en la parte inferior de tu visualización `HalfCard`.
fr: Il existe deux moyens d’aligner la couronne avec le bas de ta vue `HalfCard`.
it: Esistono due modi per allineare la corona alla parte inferiore della vista `HalfCard`.
nl: Er zijn twee manieren om de kroon uit te lijnen met de onderkant van de weergave `HalfCard`.
pt: Há duas maneira de alinhar a coroa à parte inferior da visualização `HalfCard`.
sv: Det finns två sätt att justera kronan till nederdelen av `HalfCard`-vyn.
th: มีสองวิธีในการจัดแนวมงกุฎให้ชิดด้านล่างสุดของมุมมอง `HalfCard`
tr: Tacı, `HalfCard` görüntünün altına hizalamanın iki yolu var.
zh_cn: 使皇冠对齐 `HalfCard` 视图底部的方法有两种。
zh_tw: 有兩種方式來將皇冠對齊 `HalfCard` 顯示區的底部。

source: You can add the `alignment` parameter to the `frame`:
de: Du kannst den Parameter `alignment` (Ausrichtung) zu `frame` hinzufügen:
es: Puedes añadir el parámetro `alignment` al `frame`:
es_419: Puedes agregar el parámetro `alignment` a `frame`:
fr: Tu peux ajouter le paramètre `alignment` à `frame` :
it: Puoi aggiungere il parametro `alignment` a `frame`:
nl: Je kunt de parameter `alignment` toevoegen aan het `frame`:
pt: Você pode adicionar o parâmetro `alignment` ao `frame`:
sv: Du kan lägga till `alignment`-parametern i `frame`:
th: คุณสามารถเพิ่มพารามิเตอร์ `alignment` ไปยัง `frame` ได้:
tr: `alignment` parametresini `frame`’e ekleyebilirsin:
zh_cn: 你可以将 `alignment` 参数添加到 `frame` 中：
zh_tw: 你可以將 `alignment` 參數加入 `frame`：

source: Or, add a `Spacer` above the crown:
de: Oder du kannst `Spacer` über der Krone einfügen:
es: O bien, puedes añadir un `Spacer` por encima de la corona:
es_419: O bien, puedes agregar un espaciador (`Spacer`) arriba de la corona:
fr: Tu peux aussi ajouter un `Spacer` au-dessus de la couronne :
it: Oppure puoi aggiungere uno `Spacer` sopra la corona:
nl: Of voeg een `Spacer` toe boven de kroon:
pt: Ou adicionar um `Spacer` acima da coroa:
sv: Du kan också lägga till en `Spacer` ovanför kronan:
th: หรือเพิ่ม `Spacer` ด้านบนมงกุฎ:
tr: Tacın üst tarafında bir `Spacer` da ekleyebilirsin:
zh_cn: 你也可以在皇冠上方添加一个 `Spacer`：
zh_tw: 或者，在皇冠上方加入一個 `Spacer`：

source: Now that you have fixed the alignment in this card, you can remove any borders that you’ve added.
de: Da du das Problem mit der Ausrichtung in dieser Karte nun gelöst hast, kannst du alle Ränder, die du hinzugefügt hast, wieder entfernen.
es: Ahora que has corregido la alineación de esta carta, puedes eliminar los bordes que has añadido.
es_419: Ahora que ya corregiste la alineación de la carta, puedes eliminar los bordes que habías agregado.
fr: Maintenant que tu as corrigé l’alignement dans cette carte, tu peux supprimer toutes les bordures que tu as ajoutées.
it: Ora che hai corretto l’allineamento della carta, puoi rimuovere i bordi che hai aggiunto.
nl: Nu je de uitlijning in deze kaart hebt gecorrigeerd, kun je alle randen verwijderen die je hebt toegevoegd.
pt: Agora que você corrigiu o alinhamento nesta carta, você pode remover todas as bordas adicionadas.
sv: Nu när du har åtgärdat justeringen på det här kortet kan du ta bort eventuella ramar som du har lagt till.
th: ตอนนี้คุณสามารถแก้ไขการจัดแนวในไพ่ใบนี้ได้ คุณสามารถเอาเส้นขอบที่คุณเพิ่มไว้ออกได้
tr: Bu kartta hizalamayı düzelttiğine göre eklediğin kenarları silebilirsin.
zh_cn: 现在已经解决这张牌中的对齐问题，你可以移除已添加的任何边界。
zh_tw: 現在你已經修正了這張卡片中的對齊方式，你可以刪除任何加入的邊框。

source: Look at that beautiful playing card!
de: Sieh dir diese schöne Spielkarte an!
es: ¡Mira qué carta tan bonita!
es_419: ¡Mira qué bien se ve la carta!
fr: Regarde donc cette superbe carte à jouer !
it: Guarda che bella carta da gioco!
nl: Bekijk die geweldige speelkaart eens!
pt: Veja que maravilha de carta!
sv: Titta vilket snyggt spelkort!
th: ดูไพ่สวยๆ นั่นสิ!
tr: Şu güzelim oyun kartına bak!
zh_cn: 看看这张扑克牌，太漂亮了！
zh_tw: 看看這張漂亮的撲克牌！

source: The next time you’re unsure why your views aren’t displaying the way you want them to, don’t forget that you can add a border or background to help you debug issues with your views.
de: Das nächste Mal, wenn du dir nicht sicher bist, warum deine Ansichten nicht wie vorgesehen angezeigt werden, weißt du nun, dass du immer einen Rand oder einen Hintergrund hinzufügen kannst, um Probleme mit deinen Ansichten leichter beheben zu können.
es: La próxima vez que no tengas claro por qué no se representan las vistas como quieres, recuerda que puedes añadir un borde o un fondo para ayudarte a depurar las vistas.
es_419: La próxima vez que no sepas por qué tus visualizaciones no se muestran como esperas, no olvides que puedes agregar un borde o fondo para ayudarte a depurar los problemas.
fr: La prochaine fois que tu ne sais pas pourquoi tes vues ne s’affichent pas comme tu le souhaites, n’oublie pas que tu peux ajouter une bordure ou un arrière-plan pour te permettre de corriger des problèmes avec tes vues.
it: La prossima volta che non hai la certezza del motivo per cui le tue viste non vengono visualizzate come desideri, non dimenticare che puoi aggiungere un bordo o uno sfondo che ti aiutino a effettuare il debug dei problemi di visualizzazione.
nl: De volgende keer dat je niet zeker weet waarom je weergaven niet op de juiste manier worden weergegeven, kun je een rand of achtergrond toevoegen om problemen met je weergaven op te sporen.
pt: Da próxima vez que você não tiver certeza do porquê das visualizações não estarem exibindo o conteúdo da maneira que você quer, não se esqueça de que você pode adicionar uma borda ou fundo para ajudar a depurar problemas nas visualizações.
sv: Nästa gång du är osäker på varför dina vyer inte ser ut som du vill, kom då ihåg att du kan lägga till en ram eller bakgrund som hjälper dig att felsöka problem med vyerna.
th: ครั้งถัดไปที่คุณไม่แน่ใจว่าเหตุใดมุมมองของคุณจึงไม่แสดงผลอย่างที่คุณต้องการ อย่าลืมว่าคุณสามารถเพิ่มเส้นขอบหรือพื้นหลังเพื่อช่วยคุณแก้บั๊กเกี่ยวกับมุมมองของคุณได้
tr: Bir daha görüntülerinin neden istediğin gibi görünmediğinden emin olamazsan görüntülerinle ilgili sorunlarda hata ayıklamana yardımcı olması için bir kenar ekleyebileceğini unutma.
zh_cn: 下次当你不知为什么视图没有按预期显示时，别忘了可以添加边界或背景来帮助调试视图问题。
zh_tw: 下次當你不確定為什麼你的顯示區沒有依照你想要的方式顯示時，不要忘記你可以加入一個邊框或背景來幫助你為顯示區進行除錯。

# GuideBook..Guide0..StepMy Journal..TaskGroup1..title
source: Extend the journal app
de: Tagebuch-App erweitern
es: Ampliar la app de diario
es_419: Ampliar la app de diario
fr: Développer l’app de journal
it: Migliorare ulteriormente l’app diario
nl: De dagboekapp uitbreiden
pt: Estenda o app diário
sv: Utöka journalappen
th: ต่อเติมแอปบันทึกประจำวัน
tr: Günlük uygulamasını genişletme
zh_cn: 扩展日记 App
zh_tw: 擴展日記 App

# GuideBook..Guide0..StepMy Journal..TaskGroup1..TaskentryBanner..title
source: Create a title banner view
de: Ansicht für Titelbanner erstellen
es: Crea una vista de rótulo de título
es_419: Crear una visualización de banner de título
fr: Création d’une vue de bannière de titre
it: Creare una vista per il banner titolo
nl: Een weergave met een titelstrook aanmaken
pt: Crie uma visualização do banner de título
sv: Skapa en titelbanderollvy
th: สร้างมุมมองป้ายประกาศชื่อเรื่อง
tr: Başlık manşeti görüntüsünü yaratma
zh_cn: 创建标题横幅视图
zh_tw: 製作標題橫幅顯示區

source: The title banner for a journal entry shows the entry’s name along with some flashy decorations.
de: Das Titelbanner für einen Tagebucheintrag zeigt den Namen des Eintrags zusammen mit ein paar auffälligen Verzierungen an.
es: El rótulo del título de una entrada de diario muestra el nombre de la entrada y algunas decoraciones luminosas.
es_419: El banner del título de una entrada de diario muestra el nombre de la entrada junto con algunas decoraciones llamativas.
fr: La bannière de titre d’une entrée de journal affiche le nom de l’entrée avec quelques décorations tape-à-l’œil.
it: Il banner del titolo di una voce del diario mostra il nome della voce insieme ad alcune decorazioni appariscenti.
nl: In de titelstrook voor een dagboeknotitie worden de naam van de notitie en een paar opvallende versieringen weergegeven.
pt: O banner de título de uma entrada de diário mostra o nome da entrada junto com algumas decorações chamativas.
sv: Titelbanderollen för en journalpost visar postens namn tillsammans med några läckra dekorationer.
th: ป้ายประกาศชื่อเรื่องสำหรับรายการบันทึกประจำวันแสดงชื่อของรายการพร้อมกับการตกแต่งที่ฉูดฉาด
tr: Günlük girişinin başlık manşeti, gösterişli süslemelerle girişin adını gösteriyor.
zh_cn: 日记条目的标题横幅会显示条目的名称，以及一些吸引人的装饰。
zh_tw: 日記項目的標題橫幅會顯示項目的名稱以及一些華麗的裝飾。

source: Say you are a software engineer tasked with tweaking the title banner design on the bottom-left of the preview. The designer on your team has given you the design specifications for what they want it to look like which is the view you see at the top of the preview.
de: Gehen wir davon aus, dass du ein:e Softwareentwickler:in bist und beauftragt wurdest, das Design des Titelbanners zu ändern, das sich links unten in der Vorschau befindet. Von der Designabteilung hast du entsprechende Vorgaben erhalten, wie das Design aussehen soll – die Ansicht dafür findest du oben in der Vorschau.
es: Imagínate que como responsable de la ingeniería de software, te encargan modificar el diseño del rótulo de título de la parte inferior izquierda de la vista previa. La persona de tu equipo encargada del diseño te ha indicado las especificaciones del aspecto que quieren darle, que es la vista que ves encima de la vista previa.
es_419: Imagínate que tienes un trabajo de ingeniería de software y necesitas modificar el diseño del banner de un título en la parte inferior izquierda de la previsualización. El diseñador de tu equipo te ha dado las especificaciones de cómo quiere que se vea el banner; que es lo que puedes observar en la parte superior de la vista previa.
fr: Imagine que tu es un ingénieur logiciel chargé de peaufiner la conception de la bannière de titre en bas à gauche de l’aperçu. Le concepteur de ton équipe t’a donné les spécifications de conception pour l’aspect souhaité, qui est la vue que tu vois en haut de l’aperçu.
it: Supponiamo che tu sia un ingegnere informatico incaricato di modificare il design del banner del titolo in basso a sinistra nell’anteprima. Il designer del team ti ha fornito le specifiche del design per ottenere l’aspetto che desidera, ovvero la vista visualizzata nella parte superiore dell’anteprima.
nl: Stel dat je een software-engineer bent die als taak heeft om het ontwerp van de titelstrook in de linkerbenedenhoek van de voorvertoning aan te passen. De ontwerper in je team heeft je de specificaties voor het gewenste ontwerp gegeven. Dit is de weergave boven in de voorvertoning.
pt: Digamos que você seja responsável pela engenharia de software e deva ajustar o design do banner de título na parte inferior esquerda da pré‑visualização. A pessoa responsável pelo design na sua equipe forneceu as especificações do design, que é o que você vê na parte superior da pré‑visualização.
sv: Säg att du är en programvaruutvecklare som har fått i uppdrag att finputsa designen på titelbanderollen i förhandsvisningens nedre vänstra hörn. Du har fått designspecifikationerna från designern i ditt team som vill att banderollen ska se ut som den vy du ser överst i förhandsvisningen.
th: สมมติว่าคุณเป็นวิศวกรซอฟต์แวร์ที่ได้รับมอบหมายให้ปรับเปลี่ยนการออกแบบป้ายประกาศชื่อเรื่องที่ด้านซ้ายล่างสุดของการแสดงตัวอย่าง นักออกแบบในทีมของคุณได้ให้ข้อกำหนดการออกแบบที่ต้องการกับคุณมา ซึ่งเป็นมุมมองที่คุณเห็นอยู่ที่ด้านบนสุดของการแสดงตัวอย่าง
tr: Diyelim, bir yazılım mühendisi olarak önizlemenin sol alt tarafındaki başlık manşeti tasarımını değiştirme görevi sana verildi. Ekibindeki tasarımcı da olmasını istedikleri tasarım özelliklerini sana verdi. Bu, önizlemenin en üstünde gördüğün görüntüdür.
zh_cn: 假设你是一名软件工程师，负责调整预览左下方的标题横幅设计。团队中的设计师已经给了你他们想要的设计规格，也就是你在预览顶部看到的视图。
zh_tw: 假設你是一位軟體工程師，負責調整預覽左下角的標題橫幅設計。你團隊中的設計者已經為你提供了他們想要的外觀設計範例，就是你在預覽上方看到的顯示區。

source: Do your best to make your title banner look like the design mock-up on the top half of the preview.
de: Gib dein Bestes, damit das Titelbanner genauso aussieht wie das Designmodell in der oberen Hälfte der Vorschau.
es: Haz todo lo que puedas para hacer que el rótulo de título sea como el boceto de diseño de la parte superior de la previsualización.
es_419: ¡Haz tu mejor esfuerzo para que el banner del título se vea como el modelo de diseño de la mitad superior de la vista previa!
fr: Fais de ton mieux pour que la bannière de titre ressemble à la maquette de conception située dans la partie supérieure de l’aperçu !
it: Fai del tuo meglio affinché il banner del titolo assomigli al modello del design nella metà superiore dell’anteprima.
nl: Doe je best om de titelstrook er net zo uit te laten zien als het model in de bovenste helft van de voorvertoning!
pt: Dê o seu melhor para fazer com que o banner de título fique igual ao modelo do design na metade superior da pré‑visualização.
sv: Gör ditt bästa för att titelbanderollen ska se ut som designmodellen på den övre halvan av förhandsvisningen.
th: ทำให้ดีที่สุดเพื่อสร้างป้ายประกาศชื่อเรื่องของคุณให้มีลักษณะเหมือนกับตัวอย่างจำลองการออกแบบที่อยู่ครึ่งบนของการแสดงตัวอย่าง
tr: Başlık manşetinin önizlemenin üst yarısındaki tasarım modeline benzemesini sağlamak için elinden geleni yap.
zh_cn: 尽你所能，让你的标题横幅看起来像预览上半部分的设计模型。
zh_tw: 盡力讓你的標題橫幅看起來像預覽上半部的設計模型。

source: Start by adding the yellow circle at the top-left corner.
de: Beginne mit der Arbeit, indem du links oben in der Ecke den gelben Kreis einfügst.
es: Empieza por añadir el círculo amarillo de la esquina superior izquierda.
es_419: Empieza agregando el círculo amarillo en la esquina superior izquierda.
fr: Commence par ajouter le cercle jaune dans l’angle supérieur gauche.
it: Inizia aggiungendo il cerchio giallo nell’angolo in alto a sinistra.
nl: Voeg om te beginnen de gele cirkel in de linkerbovenhoek toe.
pt: Comece adicionando o círculo amarelo no canto superior esquerdo.
sv: Börja med att lägga till den gula cirkeln i det övre vänstra hörnet.
th: เริ่มต้นโดยเพิ่มวงกลมสีเหลืองที่มุมซ้ายบนสุด
tr: Sarı daireyi sol üst köşeye ekleyerek başla.
zh_cn: 首先添加左上角的黄色圆形。
zh_tw: 首先在左上角加入黃色圓圈。

source: Place a `Circle` view on top of the blue circle using the existing [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack). You’ll also need to use the `.frame(width:height:)` and `.foregroundColor(_:)` modifiers to adjust the size and color of the circle view.
de: Platziere mit der vorhandenen Instanz von [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) eine `Circle`-Ansicht über dem blauen Kreis. Du musst außerdem die Modifikatoren `.frame(width:height:)` und `.foregroundColor(_:)` verwenden, um die Größe und Farbe der Kreisansicht anzupassen.
es: Pon una vista `Circle` encima del círculo azul de la pila [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack). También tendrás que usar los modificadores `.frame(width:height:)` y `.foregroundColor(_:)` para ajustar el tamaño y el color de la vista del círculo.
es_419: Coloca una visualización `Circle` arriba del círculo azul utilizando la pila [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) existente. También necesitarás usar los modificadores `.frame(width:height:)` y `.foregroundColor(_:)` para ajustar el tamaño y color de la visualización del círculo.
fr: Place une vue `Circle` au-dessus du cercle bleu en utilisant la [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) existante. Tu devras également utiliser les modificateurs `.frame(width:height:)` et `.foregroundColor(_:)` pour ajuster la taille et la couleur de la vue de cercle.
it: Posiziona una vista `Circle` sopra il cerchio blu, utilizzando [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) esistente. Dovrai anche usare i modificatori `.frame(width:height:)` e `.foregroundColor(_:)` per regolare dimensioni e colore della vista cerchio.
nl: Plaats een `Circle`-weergave boven op de blauwe cirkel met behulp van de bestaande [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack). Je moet ook de modifiers `.frame(width:height:)` en `.foregroundColor(_:)` gebruiken om de grootte en kleur van de cirkelweergave aan te passen.
pt: Use o [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) existente para colocar uma visualização `Circle` em cima do círculo azul. Você também precisará usar os modificadores `.frame(width:height:)` e `.foregroundColor(_:)` para ajustar o tamanho e a cor da visualização do círculo.
sv: Placera en `Circle`-vy ovanpå den blå cirkeln med din befintliga [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack). Du måste också använda modifierarna `.frame(width:height:)` och `.foregroundColor(_:)` till att justera storleken och färgen på cirkelvyn.
th: วางมุมมอง `Circle` ทับบนวงกลมสีน้ำเงินโดยใช้ [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) ที่มีอยู่ คุณยังต้องใช้ปุ่มปรับค่า `.frame(width:height:)` และ `.foregroundColor(_:)` เพื่อปรับขนาดและสีของมุมมองวงกลมอีกด้วย
tr: Var olan [ZStack’i](doc://com.apple.documentation/documentation/swiftui/zstack) kullanarak mavi dairenin üstüne bir `Circle` görüntüsü yerleştir. Daire görüntüsünün büyüklüğünü ve rengini ayarlamak için `.frame(width:height:)` ve `.foregroundColor(_:)` niteleyicilerini de kullanman gerekecek.
zh_cn: 使用现有的 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) 将 `Circle`（圆形）视图放在蓝色圆形的上面。你还需要使用 `.frame(width:height:)` 和 `.foregroundColor(_:)`（前景颜色）修饰符来调整圆形视图的大小和颜色。
zh_tw: 使用現有的 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) 在藍色圓圈上方放置一個 `Circle` 顯示區。你還需要使用 `.frame(width:height:)` 和 `.foregroundColor(_:)` 修飾符來調整圓形顯示區的大小和顏色。

source: Nice! But the yellow circle isn’t exactly where it’s supposed to be. 😣
de: Super! Nur befindet sich der gelbe Kreis nicht dort, wo er sein sollte. 😣
es: ¡Muy bien! Pero el círculo amarillo no está exactamente donde debería estar. 😣
es_419: ¡Bien! Pero el círculo amarillo no está en la posición correcta. 😣
fr: Joli ! Mais le cercle jaune n’est pas exactement à l’endroit où il devrait être. 😣
it: Bello! Tuttavia il cerchio giallo non è esattamente dove dovrebbe essere. 😣
nl: Een goed begin! Maar de gele cirkel bevindt zich niet helemaal op de goede plek. 😣
pt: Muito bom! Mas o círculo amarelo não está exatamente onde deveria. 😣
sv: Bra gjort! Men den gula cirkeln är inte precis där den ska vara. 😣
th: ดีมาก! แต่วงกลมสีเหลืองไม่ได้อยู่ในตำแหน่งที่ควรจะอยู่ 😣
tr: Güzel ama sarı daire tam olarak olması gereken yerde değil. 😣
zh_cn: 很好！但黄色圆形的位置不太对。😣
zh_tw: 很好！但黃色圓圈並不是放在它應有的位置上。😣

source: You can adjust a view’s position by adding the [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) modifier to the yellow circle.
de: Du kannst die Position einer Ansicht anpassen, indem du den Modifikator für [Versatz](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) zum gelben Kreis hinzufügst.
es: Puedes ajustar la posición de una vista añadiendo al círculo amarillo el modificador [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)).
es_419: Puedes ajustar la posición de una visualización al agregar el modificador [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) al círculo amarillo.
fr: Tu peux ajuster la position d’une vue en ajoutant un modificateur de [décalage](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) à ton cercle jaune.
it: Puoi regolare la posizione di una vista aggiungendo il modificatore [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) al cerchio giallo.
nl: Je kunt de positie van een weergave aanpassen door de [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:))-modifier aan de gele cirkel toe te voegen.
pt: Você pode adicionar o modificador [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) ao círculo amarelo para ajustar a posição de uma visualização.
sv: Du kan justera en vys position genom att lägga till [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:))-modifieraren i den gula cirkeln.
th: คุณสามารถปรับตำแหน่งของมุมมองได้โดยเพิ่มปุ่มปรับค่า[ระยะห่าง](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:))ไปยังวงกลมสีเหลือง
tr: Görüntünün konumunu, sarı daireye [uzaklık](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) niteleyicisini ekleyerek ayarlayabilirsin.
zh_cn: 你可以通过将 [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:))（偏移）修饰符添加到黄色圆形，来调整视图的位置。
zh_tw: 你可以將 [offset](doc://com.apple.documentation/documentation/swiftui/view/offset(x:y:)) 修飾符加入黃色圓圈來調整顯示區的位置。
