Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: `Shape` views expand to fill the entire space that’s offered by the container view. Because there are three circle views that need to share the space in the `VStack` equally, their sizes adapt accordingly.
de: `Shape`-Ansichten füllen den gesamten Platz, der von der Containeransicht bereitgestellt wird. Da drei Kreisansichten vorhanden sind, die sich den Platz in `VStack` gleichermaßen teilen müssen, wird ihre Größe entsprechend angepasst.
es: Las vistas `Shape` se amplían para rellenar todo el espacio que ofrece la vista de contenedor. Puesto que hay tres vistas circulares que deben compartir el espacio de `VStack` equitativamente, los tamaños se adaptan según sea necesario.
es_419: Las visualizaciones `Shape` se expanden para rellenar el espacio que ofrece la visualización de contenedor. Como hay tres visualizaciones de círculos que necesitan compartir el espacio en `VStack` de manera equitativa, sus tamaños se adaptan según sea necesario.
fr: Les vues `Shape` s’élargissent pour remplir tout l’espace qui est offert par la vue de conteneur. Puisque trois vues de cercle doivent partager l’espace de la `VStack` de manière égale, leur taille s’adapte en conséquence.
it: Le viste `Shape` si espandono per riempire l’intero spazio disponibile nella vista contenitore. Poiché sono presenti tre viste cerchio che devono condividere equamente lo spazio in `VStack`, le loro dimensioni cambiano di conseguenza.
nl: `Shape`-weergaven vullen de hele ruimte die de containerweergave hen biedt. Omdat er drie cirkelweergaven zijn die dezelfde ruimte in de `VStack` eerlijk moeten delen, worden hun grootten hieraan aangepast.
pt: As visualizações `Shape` se expandem para preencher todo o espaço oferecido pela visualização de contêiner. Como existem três visualizações de círculo que precisam compartilhar o espaço no `VStack` igualmente, seus tamanhos são adaptados de acordo.
sv: `Shape`-vyer expanderar så att de fyller hela utrymmet som behållarvyn erbjuder. Eftersom det finns tre cirkelvyer som måste dela på utrymmet i `VStack` lika ändras deras storlekar så att de ryms.
th: มุมมอง `Shape` จะขยายจนเต็มพื้นที่ทั้งหมดที่มุมมองคอนเทนเนอร์มีให้ เนื่องจากมีมุมมองวงกลมสามมุมมองที่ต้องแชร์พื้นที่ใน `VStack` อย่างเท่าๆ กัน ขนาดของมุมมองเหล่านั้นจึงปรับให้สอดคล้องกัน
tr: `Shape` görüntüleri, kapsayıcı görüntü tarafından sunulan tüm alanı dolduracak şekilde genişler. `VStack`’teki alanı eşit olarak paylaşması gereken üç daire görüntüsü olduğu için bunların büyüklükleri ona göre ayarlanır.
zh_cn: `Shape`（形状）视图会扩展以填满容器视图所提供的整个空间。由于有三个圆形视图需要均分 `VStack` 中的空间，它们的大小会因此相应地调整。
zh_tw: `Shape` 顯示區會擴展來填滿容器顯示區提供的整個空間。因為有三個圓形顯示區需要平均分配 `VStack` 裡的空間，所以它們的大小會相應調整。

source: See what happens when you add in a `Capsule()` or `Ellipse()`.
de: Sieh dir an, was passiert, wenn du `Capsule()` (Kapsel) oder `Ellipse()` (Ellipse) einfügst.
es: Mira lo que ocurre cuando añades una `Capsule()` o una `Ellipse()`.
es_419: Elige qué quieres que pase cuando agregas una `Capsule()` o `Ellipse()`.
fr: Regarde ce qui se produit lorsque tu ajoutes une `Capsule()` ou une `Ellipse()`.
it: Scopri cosa accade quando aggiungi elementi come `Capsule()` o `Ellipse()`.
nl: Kijk wat er gebeurt als je een `Capsule()` of `Ellipse()` toevoegt.
pt: Veja o que acontece quando você adiciona um `Capsule()` ou `Ellipse()`.
sv: Se vad som händer när du lägger till en `Capsule()` eller `Ellipse()`.
th: ดูสิ่งที่เกิดขึ้นเมื่อคุณเพิ่ม `Capsule()` หรือ `Ellipse()`
tr: Bir `Capsule()` veya `Ellipse()` eklediğinde ne olacağını gör.
zh_cn: 看看加入 `Capsule()`（胶囊）或 `Ellipse()`（椭圆）时会发生什么。
zh_tw: 看看當你加入一個 `Capsule()` 或 `Ellipse()` 時會發生什麼。

source: You can also organize your views horizontally using a [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
de: Du kannst deine Ansichten mit einer Instanz von [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) auch horizontal anordnen.
es: También puedes organizar las vistas en horizontal mediante una pila [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
es_419: También puedes organizar tus visualizaciones de forma horizontal mediante una [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
fr: Tu peux également organiser tes vues horizontalement à l’aide d’une [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
it: Puoi anche organizzare le viste orizzontalmente utilizzando [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
nl: Je kunt je weergaven ook horizontaal organiseren met behulp van een [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
pt: Você também pode organizar as visualizações horizontalmente usando um [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
sv: Du kan också ordna vyer horisontellt med en [HStack](doc://com.apple.documentation/documentation/swiftui/hstack).
th: คุณยังสามารถจัดระเบียบมุมมองในแนวนอนโดยใช้ [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) ได้อีกด้วย
tr: Bir [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) kullanarak görüntülerini yatay olarak da düzenleyebilirsin.
zh_cn: 你还可以使用 [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) 来水平整理视图。
zh_tw: 你也可以使用 [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) 來水平排列顯示區。

source: Inside your `VStack`, under the circle views, add an `HStack` container to organize the views horizontally:
de: Füge innerhalb von `VStack` unter der Kreisansicht einen `HStack`-Container ein, der die Ansichten horizontal organisiert:
es: Dentro de la `VStack`, debajo de las vistas de círculo, añade un contenedor `HStack` que organice las vistas en horizontal:
es_419: Dentro de tu pila `VStack`, debajo de las visualizaciones de círculos, agrega un contenedor `HStack` para organizar las visualizaciones de forma horizontal:
fr: À l’intérieur de ta `VStack`, sous les vues de cercle, ajoute un conteneur `HStack` pour organiser les vues horizontalement :
it: All’interno di `VStack`, sotto le viste cerchio, aggiungi un contenitore per organizzare le viste `HStack` orizzontalmente:
nl: Voeg in de `VStack` onder de cirkelweergaven een `HStack`-container toe die de weergaven horizontaal ordent:
pt: Dentro do `VStack`, abaixo das visualizações de círculo, adicione um contêiner `HStack` para organizar as visualizações horizontalmente:
sv: Inuti `VStack`, under cirkelvyerna, lägger du till en `HStack`-behållare för att ordna vyerna horisontellt:
th: ภายใน `VStack` ของคุณ ด้านล่างมุมมองวงกลม ให้เพิ่มคอนเทนเนอร์ `HStack` เพื่อจัดระเบียบมุมมองในแนวนอน:
tr: `VStack`’inin içinde, daire görüntülerinin altına görüntüleri yatay olarak düzenlemek için bir `HStack` kapsayıcısı ekle:
zh_cn: 在 `VStack` 内的圆形视图下方，添加一个 `HStack` 容器来水平整理视图：
zh_tw: 在你的 `VStack` 中的在圓形顯示區下方，加入一個 `HStack` 容器來水平排列顯示區：

source: You can also organize your views on top of each other using a [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
de: Du kannst deine Ansichten mit einer Instanz von [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) auch übereinander anordnen.
es: También puedes organizar las vistas unas sobre otras mediante una pila [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
es_419: También puedes organizar tus visualizaciones una sobre la otra mediante una [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
fr: Tu peux aussi organiser tes vues les unes sur les autres à l’aide d’une [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
it: Puoi anche organizzare le viste sovrapponendole l’una all’altra utilizzando [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
nl: Je kunt je weergaven op elkaar plaatsen met behulp van een [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
pt: Você também pode organizar suas visualizações umas sobre as outras usando um [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
sv: Du kan också ordna vyerna ovanpå varandra med en [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack).
th: คุณยังสามารถจัดระเบียบมุมมองของคุณให้ซ้อนทับกันโดยใช้ [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) ได้อีกด้วย
tr: Görüntülerini bir [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) kullanarak üst üste olacak şekilde de düzenleyebilirsin.
zh_cn: 你还可以使用 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack)（Z 轴堆栈）来上下堆叠视图。
zh_tw: 你也可以使用 [ZStack](doc://com.apple.documentation/documentation/swiftui/zstack) 將顯示區排列在彼此上方。

source: Add this code under the `HStack`, then change up the type of stack that’s holding your shape views to see how it changes the layout.
de: Füge diesen Code unter `HStack` ein. Ändere anschließend den Typ des Stapels, der die Formansichten enthält, und sieh dir an, wie sich das Layout ändert.
es: Añade este código a continuación de la `HStack` y cambia el tipo de pila que configura las vistas con forma para poder ver cómo va modificando la disposición.
es_419: Agrega este código debajo de `HStack` y cambia el tipo de pila que contiene tus visualizaciones para ver cómo cambia la disposición.
fr: Ajoute ce code sous la `HStack`, puis change le type de pile qui contient tes vues de forme pour voir comment cela modifie la disposition.
it: Aggiungi questo codice sotto `HStack`, quindi cambia il tipo di pila che contiene le viste forma per vedere come cambia il layout.
nl: Voeg deze code toe onder de `HStack` en wijzig vervolgens het type stapel waarin je vormweergaven worden bewaard om te zien hoe de lay-out verandert.
pt: Adicione este código abaixo do `HStack` e altere o tipo de pilha que contém as visualizações de formas para ver como ele altera o layout.
sv: Lägg till den här koden under `HStack` och ändra sedan typen av trave som innehåller formvyerna så att du ser hur det ändrar layouten.
th: เพิ่มโค้ดนี้ด้านล่าง `HStack` จากนั้นเปลี่ยนประเภทของสแต็คที่บรรจุมุมมองรูปร่างของคุณอยู่เพื่อดูว่าสแต็คประเภทนั้นทำให้เค้าโครงเปลี่ยนไปอย่างไร
tr: Bu kodu `HStack`’in alt tarafına ekle, sonra yerleşimini nasıl değiştireceğini görmek için şekil görüntülerini tutan yığın türünü değiştir.
zh_cn: 在 `HStack` 下方添加这些代码，然后更改支撑形状视图的堆栈的类型，看看它是如何更改布局的。
zh_tw: 在 `HStack` 下方加入這段程式碼，然後更改保存形狀顯示區的堆疊類型，看看它會如何改變佈局。

source: A stack can also contain other stacks. Here is an example of an `HStack` that contains two `VStack` views, and each `VStack` contains an [Image view](doc://com.apple.documentation/documentation/swiftui/image) and a `RoundedRectangle()` view.
de: Ein Stapel kann ebenfalls andere Stapel enthalten. Hier ist ein Beispiel für den Stapel `HStack`, in dem sich zwei `VStack`-Ansichten befinden. Jede Instanz von `VStack` enthält eine [Image-Ansicht](doc://com.apple.documentation/documentation/swiftui/image) und eine `RoundedRectangle()`-Ansicht (abgerundetes Rechteck).
es: Una pila también puede contener otras pilas. Aquí tienes un ejemplo de una `HStack` que contiene dos vistas `VStack`, y cada una de esas `VStack` contiene una [vista de imagen](doc://com.apple.documentation/documentation/swiftui/image) y una vista de `RoundedRectangle()`.
es_419: Una pila también puede contener otras pilas. Aquí tienes un ejemplo de una `HStack` que contiene dos visualizaciones `VStack`, y cada `VStack` contiene una [visualización de imagen](doc://com.apple.documentation/documentation/swiftui/image) y una visualización `RoundedRectangle()`.
fr: Une pile peut également contenir d’autres piles. Voici un exemple de `HStack` qui contient deux vues `VStack`, et chaque `VStack` contient une [vue d’image](doc://com.apple.documentation/documentation/swiftui/image) et une vue `RoundedRectangle()`.
it: Una pila può anche contenere altre pile. Ecco un esempio di `HStack` che contiene due viste `VStack` e ogni `VStack` contiene una vista [Image](doc://com.apple.documentation/documentation/swiftui/image) e una vista `RoundedRectangle()`.
nl: Een stapel kan ook andere stapels bevatten. Dit is een voorbeeld van een `HStack` die twee `VStack`-weergaven bevat, waarbij elke `VStack` een [Image view](doc://com.apple.documentation/documentation/swiftui/image) en een `RoundedRectangle()`-weergave bevat.
pt: Uma pilha também pode conter outras pilhas. Este é um exemplo de um `HStack` que contém duas visualizações `VStack`, e cada `VStack` contém uma [Visualização de imagem](doc://com.apple.documentation/documentation/swiftui/image) e uma visualização `RoundedRectangle()`.
sv: En trave kan också innehålla andra travar. Här är ett exempel på en `HStack` som innehåller två `VStack`-vyer, och varje `VStack` innehåller en [bildvy](doc://com.apple.documentation/documentation/swiftui/image) och en `RoundedRectangle()`-vy.
th: สแต็คยังสามารถมีสแต็คอื่นๆ ได้อีกด้วย นี่เป็นตัวอย่างของ `HStack` ที่มีมุมมอง `VStack` สองมุมมอง และแต่ละ `VStack` ก็มี[มุมมองภาพ](doc://com.apple.documentation/documentation/swiftui/image)และมุมมอง `RoundedRectangle()`
tr: Bir yığın başka yığınlar içerebilir. Burada iki `VStack` görüntüsü içeren bir `HStack` örneği bulunmaktadır. Her bir `VStack`’te bir [Resim görüntüsü](doc://com.apple.documentation/documentation/swiftui/image) ve bir `RoundedRectangle()` görüntüsü var.
zh_cn: 堆栈还可以包含其他堆栈。以下是一个 `HStack` 包含两个 `VStack` 视图的示例，每个 `VStack` 均包含一个 [Image 视图](doc://com.apple.documentation/documentation/swiftui/image)和一个 `RoundedRectangle()`（圆角矩形）视图。
zh_tw: 一個堆疊也可以包含其他堆疊。這是一個包含兩個 `VStack` 顯示區的 `HStack` 範例，每個 `VStack` 包含一個[影像顯示區](doc://com.apple.documentation/documentation/swiftui/image)和一個 `RoundedRectangle()` 顯示區。

source: Add this into your code and see how it lays out in the view:
de: Füge dies zu deinem Code hinzu und sieh dir an, wie sich das in der Ansicht bemerkbar macht:
es: Añade este componente al código y observa cómo queda la disposición en la vista:
es_419: Agrega esto a tu código y observa cómo se coloca en la visualización:
fr: Ajoute ceci à ton code et observe la disposition dans la vue :
it: Aggiungi quanto segue nel codice e osserva come cambia il layout nella vista:
nl: Voeg dit aan je code toe en bekijk welke invloed dit heeft op de lay-out van de weergave:
pt: Adicione isso ao código e veja como ele é distribuído na visualização:
sv: Lägg till det här i koden och se hur layouten i vyn ändras:
th: เพิ่มสิ่งนี้ลงในโค้ดของคุณแล้วดูว่าเค้าโครงจะเป็นอย่างไรในมุมมอง:
tr: Bunu koduna ekle ve görüntünün nasıl olacağını gör:
zh_cn: 将这些代码添加到你的代码中，看看它在视图中的布局方式：
zh_tw: 將這個加入你的程式碼並且看看它會如何佈局顯示區：

source: SwiftUI organizes and tracks the relationships of views using a [view hierarchy](glossary://view%20hierarchy).
de: SwiftUI organisiert und verfolgt die Beziehung zwischen Ansichten mithilfe einer [Ansichtenhierarchie](glossary://view%20hierarchy).
es: SwiftUI organiza las relaciones de las vistas y hace un seguimiento de ellas mediante la [jerarquía de vistas](glossary://view%20hierarchy).
es_419: SwiftUI organiza y hace un seguimiento de las relaciones de visualizaciones mediante una [jerarquía de visualizaciones](glossary://view%20hierarchy).
fr: SwiftUI organise et suit les relations entre les vues à l’aide d’une [hiérarchie de vue](glossary://view%20hierarchy).
it: SwiftUI organizza e monitora il rapporto tra le viste utilizzando una [gerarchia delle viste](glossary://view%20hierarchy).
nl: SwiftUI gebruikt een [weergavehiërarchie](glossary://view%20hierarchy) om de relaties tussen weergaven te ordenen en bij te houden.
pt: O SwiftUI organiza e rastreia os relacionamentos de visualizações usando uma [hierarquia de visualização](glossary://view%20hierarchy).
sv: SwiftUI ordnar och spårar förhållanden mellan vyer med en [vyhierarki](glossary://view%20hierarchy).
th: SwiftUI จัดระเบียบและติดตามความสัมพันธ์ของมุมมองโดยใช้[ลำดับชั้นมุมมอง](glossary://view%20hierarchy)
tr: SwiftUI, görüntüler arasındaki ilişkileri bir [görüntü hiyerarşisi](glossary://view%20hierarchy) kullanarak düzenler ve izler.
zh_cn: SwiftUI 使用[视图层次](glossary://view%20hierarchy)整理和跟踪视图的关系。
zh_tw: SwiftUI 使用[顯示區階層](glossary://view%20hierarchy)來排列和追蹤顯示區的關係。

source: There are more containers than just `HStack`, `VStack`, and `ZStack` views. To explore different containers and how to use them to lay out your content, see [Picking container views for your content](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
de: Es gibt aber mehr Container als nur `HStack`-, `VStack`- und `ZStack`-Ansichten. Weitere Infos zu den verschiedenen Containern und der Art und Weise, wie sie deine Inhalte darstellen können, findest du unter [Picking container views for your content (Auswählen von Containeransicht für deine Inhalte)](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
es: Las vistas`HStack`, `VStack` y `ZStack` no son los únicos contenedores. Si quieres explorar los distintos tipos de contenedores y saber cómo se pueden usar para disponer el contenido, visita [Seleccionar vistas de contenedor para el contenido (en inglés)](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
es_419: Existen otros contenedores además de las visualizaciones `HStack`, `VStack` y `ZStack`. Para explorar distintos contenedores y ver cómo puedes usarlos para colocar tu contenido, echa un vistazo a [Seleccionar visualizaciones de contenedor para tu contenido](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
fr: Il existe d’autres conteneurs que les vues `HStack`, `VStack` et `ZStack`. Pour explorer les différents conteneurs et la manière dont ils peuvent mettre en page ton contenu, consulte [Choisir des vues de conteneur pour ton contenu](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
it: Esistono altri contenitori oltre alle viste `HStack`, `VStack` e `ZStack`. Per scoprire i diversi contenitori e come utilizzarli per disporre i contenuti, consulta [Scegliere una vista contenitore per i contenuti](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
nl: Er zijn meer containers dan alleen de weergaven `HStack`, `VStack` en `ZStack`. Raadpleeg [Picking container views for your content](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content) als je meer wilt weten over de verschillende containers en hun invloed op de lay-out van je inhoud.
pt: Existem outros contêineres além das visualizações `HStack`, `VStack` e `ZStack`. Para explorar contêineres diferentes e como usá‑los para distribuir conteúdo, consulte [Picking container views for your content](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
sv: Det finns fler behållare än bara `HStack`-, `VStack`- och `ZStack`-vyerna. Du kan utforska olika behållare och hur du använder dem till att skapa layouter av ditt innehåll i [Picking container views for your content](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content).
th: คอนเทนเนอร์มีมากกว่าแค่เพียงมุมมอง `HStack`, `VStack` และ `ZStack` ในการสำรวจคอนเทนเนอร์ต่างๆ และวิธีใช้คอนเทนเนอร์เหล่านั้นเพื่อวางเค้าโครงเนื้อหาของคุณได้ ให้ดูที่[การเลือกมุมมองคอนเทนเนอร์สำหรับเนื้อหาของคุณ](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content)
tr: `HStack`, `VStack` ve `ZStack` görüntüleri dışında başka kapsayıcılar da vardır. Farklı kapsayıcıları ve bunların içeriklerini yerleştirmede nasıl kullanılacağını keşfetmek için [İçeriklerin için kapsayıcı görüntülerini seçme](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content) bölümüne bak.
zh_cn: 容器并非只有 `HStack`、`VStack` 和 `ZStack` 视图。如果要探索不同的容器以及如何使用它们对内容进行布局，你可以参阅[为内容挑选容器视图](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content)。
zh_tw: 除了 `HStack`、`VStack` 和 `ZStack` 顯示區之外，還有更多的容器。若要探索不同的容器以及如何使用它們來佈局你的內容，請參閱 [Picking container views for your content](doc://com.apple.documentation/documentation/swiftui/picking-container-views-for-your-content)。

# GuideBook..Guide0..StepMy Journal..TaskGroup0..TaskpatternChallenge..title
source: Design Challenge #1: Match a layout using containers
de: Designherausforderung #1: Ein Layout mit Containern nachbauen
es: Reto 1 de diseño: Imitar una disposición usando contenedores
es_419: Reto de diseño 1: Haz coincidir una disposición usando contenedores
fr: Défi de conception n° 1 : Reproduire une disposition à l’aide de conteneurs
it: Attività di progettazione n.1: far corrispondere un layout utilizzando i contenitori
nl: Ontwerpuitdaging 1: Gebruik containers om een lay-out aan te maken die er hetzelfde uitziet
pt: Desafio de Design #1: Altere um layout usando contêineres
sv: Designutmaning 1: Matcha en layout med behållare
th: คำท้าการออกแบบ #1: จับคู่เค้าโครงโดยใช้คอนเทนเนอร์
tr: Tasarım Meydan Okuması 1: Kapsayıcıları kullanarak yerleşime uydurma
zh_cn: 设计挑战 #1：使用容器匹配布局
zh_tw: 設計挑戰 #1：使用容器來符合佈局

source: As a software engineer, you often have to match the designer’s [UI](glossary://user%20interface) mock-up in code.
de: Als Softwareentwickler:in musst du oft dafür sorgen, dass die mit Code geschriebene [Benutzeroberfläche](glossary://user%20interface) mit dem Modell der Designabteilung übereinstimmt.
es: Como especialista en software, es frecuente que tengas que reproducir en código el boceto de la [IU](glossary://user%20interface) del equipo de diseño.
es_419: El trabajo de ingeniería de software consiste a menudo en hacer coincidir el modelo de [IU](glossary://user%20interface) del diseño usando código.
fr: En tant qu’ingénieur logiciel, tu dois souvent faire correspondre l’[IU](glossary://user%20interface) du concepteur au code de la maquette.
it: In qualità di ingegnere informatico, spesso devi far corrispondere il modello di [UI](glossary://user%20interface) del designer al codice.
nl: Als software-engineer moet je vaak het model van de [gebruikersinterface](glossary://user%20interface) van de ontwerper implementeren in de code.
pt: Como responsável pela engenharia de software, você geralmente precisa fazer com que o código reproduza o modelo de [IU](glossary://user%20interface) da pessoa responsável pelo design.
sv: Som programvaruutvecklare måste du ofta matcha designerns [UI](glossary://user%20interface)-modell i koden.
th: ในฐานะวิศวกรซอฟต์แวร์ คุณมักจะต้องจับคู่ตัวอย่างจำลอง [UI](glossary://user%20interface) ของนักออกแบบในโค้ด
tr: Bir yazılım mühendisi olarak çoğunlukla kodunu tasarımcının [kullanıcı arayüzü](glossary://user%20interface) modeline benzetmen gerekir.
zh_cn: 作为一名软件工程师，你经常需要用代码来还原设计师的 [UI](glossary://user%20interface) 模型。
zh_tw: 作為一名軟體工程師，你經常需要在程式碼中比對設計者的 [UI](glossary://user%20interface) 模型。
