Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: You can see that the `Rectangle` views adjust how much space they take up, but the `Text` and `Image` stay exactly the same size. Weird right?
de: Wie du sehen kannst, passen sich die `Rectangle`-Ansichten dem verfügbaren Platz an, aber die `Text`- und `Image`-Ansichten behalten ihre Größe. Komisch, oder?
es: Observa que las vistas `Rectangle` ajustan la cantidad de espacio que ocupan, pero `Text` e `Image` siguen teniendo exactamente el mismo tamaño. Raro, ¿verdad?
es_419: Puedes ver que las visualizaciones `Rectangle` ajustan el espacio que toman, pero el tamaño de las visualizaciones `Text` y `Image` se queda exactamente igual. Bastante raro, ¿no crees?
fr: Tu peux voir que les vues `Rectangle` ajustent l’espace qu’elles occupent, mais les vues `Text` et `Image` restent exactement de la même taille. Étrange, non ?
it: Puoi osservare che le viste `Rectangle` modificano lo spazio occupato, ma `Text` e `Image` rimangono esattamente della stessa dimensione. Strano, vero?
nl: Zoals je ziet, wordt de grootte van de `Rectangle`-weergaven aangepast, maar houden de `Text`- en `Image`-weergave dezelfde grootte. Raar hè?
pt: Veja que as visualizações `Rectangle` ajustam quanto espaço elas ocupam, mas `Text` e `Image` permanecem com o mesmo tamanho. Não é estranho?
sv: Du kan se att `Rectangle`-vyerna anpassar hur mycket utrymme de tar upp, men `Text` och `Image` har fortfarande precis samma storlek. Konstigt, eller hur?
th: คุณจะเห็นว่ามุมมอง `Rectangle` มีการปรับขนาดพื้นที่ที่ใช้ แต่ `Text` และ `Image` ยังคงมีขนาดเดิมทุกอย่าง แปลกใช่ไหมล่ะ
tr: `Rectangle` görüntülerinin kapladıkları yer miktarını ayarladıklarını görebilirsin ama `Text` ve `Image` görüntüleri tamamen aynı boyutta kalır. İlginç, değil mi?
zh_cn: 你可以看到 `Rectangle` 视图调整了它们所占用的空间，但 `Text` 和 `Image` 仍保持完全相同的大小，奇怪了！
zh_tw: 你可以看到 `Rectangle` 顯示區調整了它們使用的空間，但 `Text` 和 `Image` 保持完全相同的大小。很奇怪吧？

source: Because all views are unique, different types of views have their own space requirements within a container.
de: Da alle Ansichten individuell sind, haben die verschiedenen Ansichtstypen im Container jeweils unterschiedliche Platzanforderungen.
es: Puesto que todas las vistas son únicas, los distintos tipos de vistas tienen sus propios requisitos de espacio dentro de los contenedores.
es_419: Debido a que todas las visualizaciones son únicas, cada tipo de visualización tiene sus propios requisitos de espacio para cuando está dentro de un contenedor.
fr: Comme toutes les vues sont uniques, différents types de vues ont différentes exigences en matière d’espace au sein d’un conteneur.
it: Siccome tutte le viste sono uniche, i vari tipi di vista dispongono dei propri requisiti di spazio all’interno di un contenitore.
nl: Omdat alle weergaven uniek zijn, hebben verschillende weergavetypen hun eigen ruimtevereisten in een container.
pt: Como todas as visualizações são únicas, tipos diferentes de visualizações têm seus próprios requisitos de espaço dentro de um contêiner.
sv: Eftersom alla vyer är unika behöver olika typer av vyer varierande mängd utrymme inuti en behållare.
th: เนื่องจากมุมมองทั้งหมดต่างมีลักษณะเฉพาะของตัวเอง มุมมองประเภทต่างๆ จึงมีความต้องการพื้นที่ภายในคอนเทนเนอร์ของตัวเอง
tr: Görüntülerin hepsi benzersiz olduğu için farklı türlerde görüntülerin bir kapsayıcı içinde kendilerine özel alan gereksinimleri vardır.
zh_cn: 由于所有视图都是唯一的，所以不同类型的视图在容器中有不同的空间需求。
zh_tw: 因為所有顯示區都是獨有的，不同類型的顯示區會在容器中有不同的空間需求。

source: Views are somewhat magical, in that certain view types control how they resize when placed in a container:
de: In dieser speziellen Ansicht steuern Typen, wie sich die Größe der Ansichten ändert, wenn sie in einem Container platziert werden:
es: Las vistas son algo mágico, en el sentido de que determinados tipos de vistas controlan cómo cambian de tamaño cuando se colocan en un contenedor:
es_419: Además, se puede decir que las visualizaciones son mágicas, en el sentido de que algunos tipos de visualizaciones controlan cómo se redimensionan cuando se colocan en un contenedor:
fr: Les vues ont quelque chose de magique, dans le sens où certains types de vues contrôlent la façon dont elles sont redimensionnées lorsqu’elles sont placées dans un conteneur :
it: Le viste sono in un certo senso magiche, poiché alcuni tipi di vista controllano il modo in cui si ridimensionano quando vengono inserite in un contenitore:
nl: Weergaven zijn een beetje magisch omdat sommige weergavetypen bepalen hoe de grootte ervan in een container wordt aangepast:
pt: De certa forma, as visualizações são mágicas, já que alguns tipos de visualizações controlam como elas são redimensionadas quando colocadas em um contêiner:
sv: Vyer är lite magiska ibland eftersom vissa typer av vyer styr hur deras storlekar ändras när de placeras i en behållare:
th: มุมมองเป็นสิ่งที่ค่อนข้างมหัศจรรย์ ในมุมมองบางประเภทสามารถควบคุมวิธีปรับขนาดเมื่อใส่ในคอนเทนเนอร์ได้:
tr: Bazı görüntü türleri bir kapsayıcıya yerleştirildiklerinde büyüklüklerinin nasıl değişeceğini denetleyebildikleri için görüntüler biraz büyülüdür diyebiliriz:
zh_cn: 视图有点神奇，因为某些视图类型可以控制被放在容器中时的大小调整方式：
zh_tw: 顯示區有點神奇，因為某些顯示區類型能控制當它們在放在容器中時要如何調整大小：

source: Expanding to fill the available space, such as `Rectangle` or other [Shapes](doc://com.apple.documentation/documentation/swiftui/shape).
de: Erweitern, um den verfügbaren Platz zu füllen, z. B. `Rectangle` oder andere [Formen](doc://com.apple.documentation/documentation/swiftui/shape).
es: Vistas que se expanden para rellenar el espacio disponible, como `Rectangle` u otras [figuras](doc://com.apple.documentation/documentation/swiftui/shape).
es_419: Hay algunas que se expanden para rellenar el espacio disponible, como `Rectangle` u otras visualizaciones de [formas](doc://com.apple.documentation/documentation/swiftui/shape).
fr: Élargissement pour remplir l’espace disponible, telles que `Rectangle` ou d’autres [Formes](doc://com.apple.documentation/documentation/swiftui/shape).
it: Espandendosi per riempire lo spazio disponibile, come `Rectangle` o altre [Shapes](doc://com.apple.documentation/documentation/swiftui/shape).
nl: Weergaven die de beschikbare ruimte helemaal vullen, zoals `Rectangle`-weergaven of andere [Shapes](doc://com.apple.documentation/documentation/swiftui/shape).
pt: Se expandem para preencher o espaço disponível, como `Rectangle` ou outros [Shapes](doc://com.apple.documentation/documentation/swiftui/shape).
sv: Expandering fyller det tillgängliga utrymmet, till exempel `Rectangle` eller andra [former](doc://com.apple.documentation/documentation/swiftui/shape).
th: การขยายเพื่อเติมเต็มพื้นที่ที่มี เช่น `Rectangle` หรือ[รูปร่าง](doc://com.apple.documentation/documentation/swiftui/shape)อื่นๆ
tr: `Rectangle` veya başka [şekiller](doc://com.apple.documentation/documentation/swiftui/shape) gibi, kullanılabilir alanı dolduracak şekilde genişleme.
zh_cn: 扩展来填充可用空间，如 `Rectangle` 或其他 [Shape](doc://com.apple.documentation/documentation/swiftui/shape)（形状）。
zh_tw: 擴展來填滿可用空間，如 `Rectangle` 或其他[形狀](doc://com.apple.documentation/documentation/swiftui/shape)。

source: Resizing to fit their content, such as `Text(“Supercalifragilisticexpialidocious”)` or `Image("myCoolImage")`.
de: Ändern der Größe, um sich dem Inhalt anzupassen, z. B. `Text(“Supercalifragilisticexpialidocious”)` oder `Image("myCoolImage")`.
es: Redimensionarse para ajustarse a su contenido, como `Text(“Supercalifragilisticexpialidocious”)` o `Image("myCoolImage")`.
es_419: Hay otras que ajustan su tamaño según su contenido, como `Text("Supercalifragilisticoespialidoso")` o `Image("miImagenEspecial")`.
fr: Redimensionnement pour s’adapter à leur contenu, comme `Text(“Supercalifragilisticexpidélilicieux”)` ou `Image("myCoolImage")`.
it: Ridimensionandosi in base al loro contenuto, come `Text("Supercalifragilisticexpialidocious")` o `Image("myCoolImage")`.
nl: Er zijn weergaven die zich aanpassen aan de grootte van de inhoud, zoals `Text(“Supercalifragilisticexpialidocious”)` of `Image("myCoolImage")`.
pt: Se redimensionam para que o conteúdo caiba, como `Text(“Inconstitucionalissimamente”)` ou `Image("myCoolImage")`.
sv: Ändrar storlek så att deras innehåll passar, som `Text(“Supercalifragilisticexpialidocious”)` eller `Image("myCoolImage")`.
th: การปรับขนาดให้พอดีกับเนื้อหา เช่น `Text(“Supercalifragilisticexpialidocious”)` หรือ `Image("myCoolImage")`
tr: `Text(“Supercalifragilisticexpialidocious”)` veya `Image("myCoolImage")` gibi içerikleri sığdırmak için büyüklüğünü değiştirme.
zh_cn: 调整大小来适合它的内容，如 `Text(“Supercalifragilisticexpialidocious”)` 或 `Image("myCoolImage")`。
zh_tw: 調整大小來符合其內容，例如 `Text(“Supercalifragilisticexpialidocious”)` 或 `Image("myCoolImage”)`。

source: Maintaining a specific size that doesn’t change, like [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper).
de: Beibehalten einer bestimmten Größe, die sich nicht ändert, z. B. [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper).
es: Conservar un tamaño específico que no cambia, como los [Incrementos](doc://com.apple.documentation/documentation/swiftui/stepper).
es_419: Y también hay unas que mantienen un tamaño específico que no cambia, como las visualizaciones de incrementos [`Stepper`](doc://com.apple.documentation/documentation/swiftui/stepper).
fr: Conserver une taille spécifique, qui ne change pas, comme [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper).
it: Mantenendo una dimensione specifica che non cambia, come [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper).
nl: Er zijn weergaven met een specifieke grootte die niet verandert, zoals [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper).
pt: Mantêm um tamanho específico que não muda, como [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper).
sv: Behåller en angiven storlek som inte ändras, som [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper).
th: รักษาขนาดเฉพาะที่จะไม่เปลี่ยนแปลง เช่น [ค่าเป็นขั้น](doc://com.apple.documentation/documentation/swiftui/stepper)
tr: [Adımlayıcı](doc://com.apple.documentation/documentation/swiftui/stepper) gibi değişmeyen belirli bir büyüklüğü koruma.
zh_cn: 保持不会改变的特定大小，如 [Stepper](doc://com.apple.documentation/documentation/swiftui/stepper)（步进器）。
zh_tw: 維持不變的特定大小，例如[Stepper](doc://com.apple.documentation/documentation/swiftui/stepper)。

source: To adjust the amount of space either the `Text` or `Rectangle` views need, you can specify which view needs to take up more space. Try adding the `.frame` modifier to the `Text`, `Image`, and `Rectangle` views one at a time, and notice how each view changes:
de: Um den benötigten Platz einer `Text`- oder `Rectangle`-Ansicht anzupassen, kannst du festlegen, welche Ansicht mehr Platz einnehmen soll. Füge den `.frame`-Modifikator nacheinander jeweils zur `Text`-, `Image`- und `Rectangle`-Ansicht hinzu und achte darauf, wie sich die entsprechende Ansicht ändert:
es: Para ajustar la cantidad de espacio que necesitan las vistas `Text` o `Rectangle`, puedes especificar qué necesidades de vistas ocupan más espacio. Prueba a añadir el modificador `.frame` a las vistas `Text`, `Image` y `Rectangle`, una a una, y observa cómo cambia cada vista:
es_419: Para ajustar el espacio que necesitan las visualizaciones `Text` o `Rectangle`, puedes especificar cuál visualización debe ocupar más espacio. Intenta agregar el modificador `.frame` a las visualizaciones `Text`, `Image` y `Rectangle`, una a la vez, y observa cómo cambia cada visualización:
fr: Pour ajuster l’espace nécessaire aux vues `Text` ou `Rectangle`, tu peux indiquer quelle est la vue qui a besoin de plus d’espace. Essaie d’ajouter le modificateur `.frame` aux vues `Text`, `Image` et `Rectangle` une par une, et regarde de quelle manière chaque vue change :
it: Per regolare la quantità di spazio occupato dalle viste `Text` o `Rectangle`, puoi specificare quale vista deve occupare più spazio. Prova ad aggiungere il modificatore `.frame` alle viste `Text`, `Image` e `Rectangle`, una alla volta, e osserva come cambia ogni vista:
nl: Om de hoeveelheid ruimte aan te passen die de `Text`- of `Rectangle`-weergave nodig heeft, kun je opgeven welke weergave meer ruimte in beslag moet nemen. Voeg de `.frame`-modifier achtereenvolgens aan de `Text`-, `Image`- en `Rectangle`-weergave toe en kijk hoe elke weergave verandert:
pt: Para ajustar a quantidade de espaço que as visualizações `Text` ou `Rectangle` precisam, você pode especificar qual visualização precisa usar mais espaço. Tente adicionar o modificador `.frame` às visualizações `Text`, `Image` e `Rectangle`, uma de cada vez, e observe como cada visualização muda:
sv: Om du vill justera utrymmet som antingen `Text`- eller `Rectangle`-vyn behöver kan du ange vilken vy som behöver ta upp mer utrymme. Prova att lägga till `.frame`-modifieraren i `Text`-, `Image`- och `Rectangle`-vyerna en i taget och lägg märke till hur varje vy förändras:
th: ในการปรับปริมาณพื้นที่ที่มุมมอง `Text` หรือ `Rectangle` ใช้ คุณสามารถระบุได้ว่ามุมมองใดต้องใช้พื้นที่มากขึ้น ลองเพิ่มปุ่มปรับค่า `.frame` ไปยังมุมมอง `Text`, `Image` และ `Rectangle` ทีละมุมมอง แล้วดูว่าแต่ละมุมมองเปลี่ยนไปอย่างไร:
tr: `Text` veya `Rectangle` görüntülerinin ihtiyaç duydukları alan miktarını ayarlamak için hangi görüntünün daha çok yer kaplaması gerektiğini belirtebilirsin. `.frame` niteleyicisini `Text`, `Image` ve `Rectangle` görüntülerine teker teker eklemeyi dene ve her bir görüntünün nasıl değiştiğine dikkat et:
zh_cn: 如果要调整 `Text` 或 `Rectangle` 视图所需的空间，你可以指定哪个视图需要占用更多的空间。试着将每次将 `.frame` 修饰符添加到 `Text`、`Image` 和 `Rectangle` 视图中的一个，然后留意各个视图是如何变化的：
zh_tw: 若要調整 `Text`或 `Rectangle` 顯示區所需的空間量，你可以指定哪個顯示區需要佔用更多空間。嘗試一次將 `.frame` 修飾符加入到 `Text`、`Image` 和 `Rectangle` 顯示區，並注意每個顯示區的變化：

source: The [frame modifier](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) allows you to adjust the size of a view.
de: Mit dem [Modifikator für den Rahmen](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) kannst du die Größe einer Ansicht anpassen.
es: El [modificador `frame`](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) te permite ajustar específicamente el tamaño de una vista.
es_419: El modificador [`frame`](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) te permite ajustar el tamaño de una visualización.
fr: Le [modificateur frame](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) te permet de régler la taille d’une vue.
it: Il [modificatore frame](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) ti consente di regolare la dimensione di una vista.
nl: Met de [frame modifier](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) kun je de grootte van een weergave aanpassen.
pt: O [frame modifier](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)) permite que você ajuste o tamanho de uma visualização.
sv: Med [frame](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:))-modifieraren kan du justera storleken i en vy.
th: [ปุ่มปรับค่ากรอบ](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:))ช่วยให้คุณปรับขนาดของมุมมองได้
tr: [Frame niteleyicisi](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:)), bir görüntünün büyüklüğünü ayarlamana olanak tanır.
zh_cn: [框架修饰符](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:))可让你调整视图的大小。
zh_tw: [外框修飾符](doc://com.apple.documentation/documentation/SwiftUI/View/frame(width:height:alignment:))能讓你調整顯示區的大小。

source: Try adding the `height` parameter to one of your `Rectangle` views to see how it changes:
de: Füge den Parameter `height` (Höhe) zu einer deiner `Rectangle`-Ansichten hinzu, um dir anzusehen, wie sie sich verändert:
es: Prueba a añadir el parámetro de altura (`height`) a una de las vistas `Rectangle` para ver cómo cambia:
es_419: Intenta agregar el parámetro `height` (alto) a una de tus visualizaciones `Rectangle` para ver cómo cambia:
fr: Essaie d’ajouter le paramètre `height` à l’une de tes vues `Rectangle` pour voir comment elle change :
it: Prova ad aggiungere il parametro altezza a una delle viste `Rectangle` per vedere come cambia:
nl: Voeg de parameter `height` toe aan één van je `Rectangle`-weergaven om te zien hoe deze verandert:
pt: Tente adicionar o parâmetro `height` a uma das visualizações `Rectangle` para ver como ela é alterada:
sv: Prova att lägga till `height`-parametern i en av `Rectangle`-vyerna för att se hur den förändras:
th: ลองเพิ่มพารามิเตอร์ `height` ไปยังหนึ่งในมุมมอง `Rectangle` ของคุณเพื่อดูว่ามุมมองเปลี่ยนไปอย่างไร:
tr: `Rectangle` görüntülerinden birine yükseklik (`height`) parametresini eklemeyi dene ve nasıl değiştiğini gör:
zh_cn: 尝试将 `height`（高）参数添加到其中一个 `Rectangle` 视图，看看它是如何变化的：
zh_tw: 嘗試將 `height` 參數加入其中一個 `Rectangle` 顯示區，看看它是如何變化的：

source: Providing fixed values for the `width` and `height` limits how adaptive the view can be. 🙃
de: Feste Werte für `width` (Breite) und `height` (Höhe) festzulegen, schränkt die Anpassungsfähigkeit der Ansicht ein. 🙃
es: Especificar valores fijos para la anchura (`width`) y la altura (`height`) limita el grado de adaptación de la vista. 🙃
es_419: Considera que usar valores fijos para el ancho (`width`) y el alto (`height`) limita el grado de adaptabilidad de las visualizaciones. 🙃
fr: La fourniture de valeurs fixes pour `width` et `height` limite la façon dont la vue peut s’adapter. 🙃
it: Fornire valori fissi per `width` e `height` limita l’adattabilità della vista. 🙃
nl: Als je vaste waarden opgeeft voor de `width` en `height`, beperk je de mate waarin de weergave zichzelf kan aanpassen. 🙃
pt: Ao dar valores fixos a `width` e `height`, você limita o quão adaptável a visualização pode ser. 🙃
sv: Om du använder fasta värden för `width` och `height` begränsar du hur anpassningsbar vyn kan vara. 🙃
th: การระบุค่าคงที่สำหรับ `width` และ `height` จะจำกัดความสามารถในการปรับขนาดของมุมมอง 🙃
tr: Genişlik (`width`) ve yükseklik (`height`) için sabit değerler verilmesi görüntünün ne kadar uyarlanabilir olacağını sınırlar. 🙃
zh_cn: 为 `width`（宽）和 `height` 提供固定值会限制视图的适应度。🙃
zh_tw: 為 `width` 和 `height` 提供固定值會限制顯示區的適應能力。🙃

source: A better way to do this is to give a maximum, minimum, or ideal width and height for a view. This allows the view to resize as necessary based on how much space is available in the container.
de: Besser ist es, für die Höhe und Breite der Ansicht maximale, minimale und ideale Werte festzulegen. Dadurch kann die Größe der Ansicht in Abhängigkeit von der Größe des Containers geändert werden.
es: Una forma mejor de hacerlo es darle a una vista un máximo, un mínimo o una anchura y altura ideales. Esto permite que la vista se redimensione según sea necesario en función del espacio disponible en el contenedor.
es_419: Por esto, es mejor definir valores máximos, mínimos o ideales para una visualización, ya que esto permite que la visualización cambie de tamaño según sea necesario en función del espacio disponible en el contenedor.
fr: Une façon plus efficace de réaliser cela consiste à donner une largeur et une hauteur maximales, minimales ou idéales pour une vue. Cela permet le redimensionnement de la vue selon les besoins, en fonction de l’espace disponible dans le conteneur.
it: Un modo migliore di farlo è indicare una larghezza e un’altezza massime, minime o ideali di una vista. In questo modo, la vista verrà ridimensionata come necessario, sulla base dello spazio disponibile nel contenitore.
nl: Een betere manier om dit te doen is om een maximale, minimale of ideale breedte en hoogte voor een weergave op te geven. Hierdoor kan het formaat van de weergave zo nodig worden gewijzigd op basis van de beschikbare ruimte in de container.
pt: Uma maneira melhor de se fazer isso é dar valores máximos, mínimos ou ideais para largura e altura de uma visualização. Isso permite que a visualização se redimensione conforme necessário, com base no espaço disponível no contêiner.
sv: Ett bättre sätt att göra det här är att ange en högsta, lägsta eller idealisk bredd och höjd för en vy. Det tillåter att vyn ändrar storlek vid behov beroende på hur mycket utrymme det finns i behållaren.
th: วิธีที่ดีกว่านั้นคือระบุความกว้างและความสูงสูงสุด ต่ำสุด หรือเหมาะสมที่สุดสำหรับมุมมอง การทำงานนี้จะช่วยให้มุมมองสามารถปรับขนาดได้ตามความจำเป็นตามปริมาณพื้นที่ที่มีในคอนเทนเนอร์
tr: Bunu yapmanın daha iyi bir yolu, görüntü için maksimum, minimum veya ideal bir genişlik ve yükseklik vermektir. Bu, görüntü büyüklüğünün kapsayıcıdaki kullanılabilir alana göre gerektiği şekilde değiştirilmesine olanak tanır.
zh_cn: 更好的方法是为视图设定最大、最小或理想宽和高。这可让视图基于容器中提供了多少空间来按需调整大小。
zh_tw: 更好的方法是為顯示區指定最大、最小或理想的寬度和高度。這能讓顯示區根據容器的可用空間來調整大小。

source: Add one of these modifiers to your `Image` view:
de: Füge einen dieser Modifikatoren zu deiner `Image`-Ansicht hinzu:
es: Añade uno de estos modificadores a la vista `Image`:
es_419: Agrega uno de estos modificadores a tu visualización `Image`:
fr: Ajoute l’un de ces modificateurs à ta vue `Image` :
it: Aggiungi uno di questi modificatori alla vista `Image`:
nl: Voeg een van deze modifiers aan de `Image`-weergave toe:
pt: Adicione um desses modificadores à visualização `Image`:
sv: Lägg till en av de här modifierarna i `Image`-vyn:
th: เพิ่มหนึ่งในปุ่มปรับค่าเหล่านี้ไปยังมุมมอง `Image` ของคุณ:
tr: Bu niteleyicilerden birini `Image` görüntüne ekle:
zh_cn: 将这些修饰符中的一个添加到 `Image` 视图中：
zh_tw: 將這些修飾符的其中一個加入你的 `Image` 顯示區：
