Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: Remember that there are many different ways to layout a view and the code snippet below is just one example:
de: Wie du dich sicher erinnern kannst, gibt es viele verschiedene Möglichkeiten, das Layout für eine Ansicht zu erstellen. Das Codebeispiel unten ist nur eine von vielen:
es: Recuerda que hay muchas maneras distintas de disponer una vista; el fragmento de código siguiente es solo un ejemplo:
es_419: Recuerda que hay muchas maneras de colocar una visualización; el fragmento de código de abajo sólo es un ejemplo:
fr: N’oublie pas que la disposition d’une vue peut-être réalisée de bien des manières et que l’extrait de code ci-dessous n’est qu’un exemple :
it: Ricorda che esistono molti modi diversi per configurare un layout per una vista e il frammento di codice qui sotto ne è solo un esempio:
nl: Vergeet niet dat er veel verschillende manieren zijn om de lay-out van een weergave in te stellen. Het onderstaande codefragment is slechts een voorbeeld:
pt: Lembre‑se de que há muitas maneiras de criar um layout de uma visualização; o fragmento de código abaixo é apenas um exemplo:
sv: Kom ihåg att det finns många sätt att layouta en vy och att kodsnutten nedan bara är ett exempel:
th: อย่าลืมว่าการวางเค้าโครงมุมมองมีหลายวิธีที่แตกต่างกันไป และส่วนย่อยของโค้ดด้านล่างเป็นเพียงตัวอย่างหนึ่งเท่านั้น:
tr: Bir görüntü yerleşimini düzenlemenin birçok farklı yolu olduğunu unutma. Aşağıdaki kod parçacığı yalnızca bir örnek:
zh_cn: 要记住，视图布局的方法有多种，下方的代码片段只是一个示例：
zh_tw: 請記住，有許多不同的方式來佈局顯示區，下方的程式碼片段只是一個範例：

source: Remember that setting the `minHeight` and `maxHeight` allows the view to scale for different screen sizes.
de: Denk daran, dass durch Festlegen von `minHeight` (Mindesthöhe) und `maxHeight` (Maximalhöhe) die Ansicht auf die verschiedenen Bildschirmgrößen skaliert werden kann.
es: Recuerda que al ajustar los valores de `minHeight` y `maxHeight` permiten que la vista se adapte a los distintos tamaños de pantalla.
es_419: Recuerda que al configurar `minHeight` y `maxHeight` se permite que la visualización se ajuste según los distintos tamaños de pantalla.
fr: Souviens-toi que la définition de `minHeight` et de `maxHeight` permet à la vue de se redimensionner pour différentes tailles d’écran.
it: Ricorda che impostare `minHeight` e `maxHeight` consente il ridimensionamento della vista per schermi di diverse dimensioni.
nl: Weet je nog dat de weergave zich aan verschillende schermformaten kan aanpassen als je de `minHeight` en `maxHeight` instelt?
pt: Lembre-se de que você pode definir `minHeight` e `maxHeight` para permitir que a visualização seja dimensionada em tamanhos de tela diferentes.
sv: Kom ihåg att inställningarna `minHeight` och `maxHeight` gör så att vyn kan skalas för olika skärmstorlekar.
th: จำไว้ว่าการตั้งค่า `minHeight` และ `maxHeight` จะช่วยให้มุมมองปรับขนาดสำหรับขนาดหน้าจอที่แตกต่างกันได้
tr: `minHeight` ile `maxHeight`’ı ayarlamanın görüntünün farklı ekran boyutlarına göre ölçeklenmesini sağladığını unutma.
zh_cn: 要记住，设定 `minHeight`（最小高度）和 `maxHeight`（最大高度）后，视图会根据不同的屏幕大小进行缩放。
zh_tw: 記住，設定 `minHeight` 和 `maxHeight` 可以讓顯示區為不同的螢幕大小進行縮放。

source: And similar to what you did for the sleep tracker, you can push your card title to the edge by setting the maximum height to `.infinity`.
de: Ähnlich wie beim Schlaftracker kannst du für die Maximalhöhe den Wert `.infinity` (unendlich) festlegen und somit den Kartentitel an die obere Kante verschieben.
es: De forma parecida a lo que hiciste con la app de seguimiento del sueño, puedes llevar el título de la tarjeta hasta el borde estableciendo la altura máxima en `.infinity`.
es_419: De forma similar a lo que hiciste para el monitor de sueño, puedes mover el título de la carta al borde configurando el valor máximo de altura como `.infinity`.
fr: Tout comme tu l’as fait pour le moniteur de sommeil, tu peux pousser le titre de ta carte vers le bord en définissant la hauteur maximale sur `.infinity`.
it: Analogamente a come hai fatto per il tracker del sonno, puoi spingere il titolo della scheda fino al bordo, impostando l’altezza massima su `.infinity`.
nl: Net als bij de slaaptracker, kun je de titel van de kaart naar de rand duwen door de maximale hoogte op `.infinity` in te stellen.
pt: E que, de maneira semelhante ao que você fez no rastreador de sono, você pode definir a altura máxima como `.infinity` para empurrar o título do cartão até a margem.
sv: Du kan också puffa korttiteln mot kanten genom att ställa in värdet `.infinity` för maxhöjden, ungefär som du gjorde med sömnspåraren.
th: คล้ายกับที่คุณทำกับตัวติดตามการนอนหลับ คุณสามารถผลักชื่อบัตรของคุณไปที่ขอบได้โดยตั้งค่าความสูงที่สูงสุดให้กับ `.infinity`
tr: Uyku izleyici için yaptığına benzer şekilde maksimum yüksekliği `.infinity`’ye ayarlayarak kart başlığını kenara itebilirsin.
zh_cn: 与睡眠跟踪器的处理方式类似，你可以将最大高度设为 `.infinity`，来将你的卡片标题推到边缘处。
zh_tw: 就像你為睡眠追蹤器所做的一樣，你可以將最大高度設定為 `.infinity`來將卡片標題推到邊緣。

source: Add another frame to your `HStack`:
de: Füge einen weiteren Rahmen zu `HStack` hinzu:
es: Añade otro marco a la `HStack`:
es_419: Agrega otro marco a tu `HStack`:
fr: Ajoute un autre cadre à ta `HStack` :
it: Aggiungi un’altra cornice a `HStack`:
nl: Voeg nog een `frame` aan je `HStack` toe`:
pt: Adicione outro quadro ao `HStack`:
sv: Lägg till en annan ram i `HStack`:
th: เพิ่มอีกกรอบไปยัง `HStack` ของคุณ`:
tr: `HStack`’ine başka bir çerçeve ekle:
zh_cn: 将另一个框架添加到 `HStack`：
zh_tw: 將另一個框架加入你的 `HStack`：

source: Next, add some padding to create space between the title and the edge of your card.
de: Füge als Nächstes einen Randabstand hinzu, um einen Abstand zwischen Titel und Kante deiner Karte herzustellen.
es: A continuación, añade algo de relleno para crear espacio entre el título y el borde de la tarjeta.
es_419: Después, agrega algo de relleno para separar el título del borde de la carta.
fr: Ensuite, ajoute un remplissage pour créer de l’espace entre le titre et le bord de ta carte.
it: Quindi, aggiungi una spaziatura interna per creare un po’ di spazio tra il titolo e il bordo della scheda.
nl: Voeg nu wat padding toe om ruimte tussen de titel en de rand van de kaart te creëren.
pt: Depois, adicione um preenchimento para criar espaço entre o título e a margem do cartão.
sv: Härnäst lägger du till lite tomrum för att skapa avstånd mellan titeln och kanten på kortet.
th: ถัดไป ให้เพิ่มการขยายขอบเล็กน้อยเพื่อสร้างพื้นที่ระหว่างชื่อและขอบบัตรของคุณ
tr: Sonra, başlıkla kartının kenarı arasında aralık olması için biraz boşluk ekle.
zh_cn: 下一步，添加一些填补来为标题和卡片边缘之间创建空间。
zh_tw: 接下來，加入一些填充來在卡片的標題和邊緣之間建立空間。

source: Add `padding` to everything by adding it to the `VStack` below your `frame` modifier:
de: Du kannst `padding` auf einen Schlag zu allem hinzufügen, indem du die Instanz in `VStack` unter dem `frame`-Modifikator einfügst:
es: Añade relleno (`padding`) a todo al mismo tiempo incluyéndolo en el contenedor `VStack`, debajo del modificador `frame`:
es_419: Agrega `padding` a todo a la vez; para hacerlo, agrégalo a la `VStack` debajo de tu modificador `frame`.
fr: Ajoute `padding` à tous les éléments en même temps en l’ajoutant à la `VStack` sous ton modificateur `frame`.
it: Applica `padding` a tutti i contenuti, aggiungendolo a `VStack` sotto il modificatore `frame`:
nl: Voeg overal tegelijk `padding` toe door padding aan de `VStack` toe te voegen onder de `frame`-modifier:
pt: Adicione `padding` a tudo de uma vez, bastando adicioná‑lo ao `VStack` abaixo do modificador `frame`:
sv: Lägg till `padding` överallt genom att lägga till den i `VStack` nedanför `frame`-modifieraren:
th: เพิ่ม `padding` ไปที่ทุกอย่างพร้อมกันโดยเพิ่มไปยัง `VStack` ด้านล่างปุ่มปรับค่า `frame` ของคุณ:
tr: Boşluğu (`padding`) `frame` niteleyicinin alt tarafındaki `VStack`’e ekleyerek her şeye boşluk ekle:
zh_cn: 通过将 `padding` 添加到 `VStack` 的 `frame` 修饰符下方，来为所有内容添加 `padding`：
zh_tw: 將 `padding` 加入到 `frame` 修飾符下方的 `VStack` 中，可立即為所有內容加入填充：

source: Now tackle the alignment of your card title. Align it to the leading edge when someone is editing their journal, and center-align the card title when they’re displaying the journal.
de: Kümmere dich jetzt um die Ausrichtung des Kartentitels. Im Bearbeitungsstatus sollte der Kartentitel links ausgerichtet sein, wenn eine Person das Tagebuch bearbeitet. Beim Anzeigen des Tagebuchs sollte der Kartentitel zentriert sein.
es: Ahora concéntrate en la alineación del título de la tarjeta. Alinéalo al borde inicial cuando alguien edite su diario y céntralo cuando solo esté mostrando el diario.
es_419: Ahora debes encargarte de la alineación del título de la carta. Alinéalo en el borde inicial cuando alguien esté editando su diario, y luego alinéalo en el centro cuando se esté mostrando el diario.
fr: Attaque-toi maintenant à l’alignement du titre de ta carte. Aligne-la sur le bord principal quand quelqu’un modifie son journal et aligne le titre de la carte sur le centre quand quelqu’un affiche le journal.
it: Ora dedicati all’allineamento del titolo della scheda. Allinealo al bordo anteriore quando qualcuno sta modificando il proprio diario e allinea al centro il titolo della scheda quando viene visualizzato il diario.
nl: Richt je nu op de uitlijning van de kaarttitel. Lijn de kaarttitel uit met de voorste rand als iemand het dagboek bewerkt en centreer de kaarttitel als iemand het dagboek weergeeft.
pt: Agora lide com o alinhamento do título do cartão. Alinhe‑o à margem condutora quando uma pessoa estiver editando o diário e alinhe o título do cartão ao centro quando ela estiver exibindo o diário.
sv: Nu får du tackla kantjusteringen för kortets titel. Kantjustera den till den ledande kanten när någon redigerar sin journal och centrera korttiteln när någon visar sin journal.
th: ตอนนี้ให้จัดการการจัดแนวชื่อบัตรของคุณ โดยจัดให้ชิดขอบด้านหน้าเมื่อมีคนกำลังแก้ไขบันทึกประจำวันของเขา และจัดแนวชื่อบัตรให้อยู่กึ่งกลางเมื่อเขาแสดงผลบันทึกประจำวัน
tr: Şimdi kart başlığının hizalamasını hallet. Kart başlığını, biri günlüğünü düzenlerken öndeki kenara, günlüğü görüntülerken de ortaya hizala.
zh_cn: 现在来处理卡片标题的对齐问题。用户编辑日记时，让卡片标题对齐到前缘，用户显示日记时则让它对齐到中心。
zh_tw: 現在來解決卡片標題對齊的問題。當有人正在編輯他們的日記時，將它與前緣對齊，並且在他們顯示日記時將卡片標題置中對齊。

source: Try coding this yourself, using the solution if needed:
de: Versuche, die Aufgabe alleine zu programmieren. Wenn du nicht weiterkommst, findest du hier die Lösung:
es: Intenta programarlo por tu cuenta, pero usa esta solución si la necesitas:
es_419: Intenta programar esto por tu cuenta, y consulta la solución si la necesitas:
fr: Essaie de coder cela par toi-même, en utilisant la solution si nécessaire :
it: Prova a programmare il codice da te, utilizzando la soluzione se necessario:
nl: Probeer dit zelf te programmeren en gebruik de oplossing als je vast komt te zitten:
pt: Tente você mesmo codificar e use a solução caso necessário:
sv: Försök att koda det här på egen hand, men använd lösningen om du behöver:
th: ลองเขียนโค้ดส่วนนี้ด้วยตัวคุณเอง โดยใช้วิธีแก้ปัญหาหากจำเป็น:
tr: Bunu kendin kodlamayı dene, gerekirse çözümü kullan:
zh_cn: 试着自己编写实现此功能的代码，需要时可使用解决方案：
zh_tw: 嘗試自己編寫這個程式碼，如有需要，請使用解決方案：

source: Add the `.frame` modifier with a `maxWidth` of `.infinity` to stretch your `Text` view horizontally and fill the available space.
de: Füge den `.frame`-Modifikator mit dem Wert `.infinity` für `maxWidth` hinzu, um deine `Text`-Ansicht horizontal zu dehnen und den zur Verfügung stehenden Platz zu füllen.
es: Añade el modificador `.frame` con un valor de `.infinity` para `maxWidth` para estirar la vista `Text` en horizontal y rellenar el espacio disponible.
es_419: Al agregar el modificador `.frame` con el valor `maxWidth` en `.infinity`, la visualización `Text` se extenderá de forma horizontal para rellenar el espacio disponible.
fr: Ajoute le modificateur `.frame` avec une `maxWidth` de `.infinity` pour étirer ta vue `Text` horizontalement et remplir tout l’espace disponible.
it: Aggiungi il modificatore `.frame` con `maxWidth` di `.infinity` per espandere in orizzontale la vista `Text` e riempire ogni spazio disponibile.
nl: Voeg de `.frame`-modifier met een `maxWidth` van `.infinity` toe om de `Text`-weergave horizontaal uit te rekken en de beschikbare ruimte te vullen.
pt: Adicione o modificador `.frame` com um `maxWidth` de`.infinity` para esticar a visualização `Text` horizontalmente e preencher o espaço disponível.
sv: Lägg till `.frame`-modifieraren med `.infinity` som `maxWidth` så att `Text`-vyn sträcks ut horisontellt och fyller det tillgängliga utrymmet.
th: เพิ่มปุ่มปรับค่า `.frame` ที่มี `maxWidth` เป็น `.infinity` เพื่อยืดมุมมอง `Text` ของคุณออกไปในแนวนอนและเติมเต็มพื้นที่ที่มี
tr: `.frame` niteleyicisini `.infinity`’ye ayarlanmış bir `maxWidth` ile ekleyerek `Text` görüntünü yatay olarak uzat ve mevcut alanı doldur.
zh_cn: 添加 `maxWidth` 为 `.infinity` 的 `.frame` 修饰符，`Text` 视图会水平拉伸并填充任何可用的空间。
zh_tw: 加入帶有 `.infinity` 的 `maxWidth` 的 `.frame` 修飾符來水平擴展你的 `Text` 顯示區並填滿可用空間。

source: The `alignment` parameter tells `SwiftUI` that any content inside the `frame` aligns to the leading edge in the editing state, and center-aligned in the displaying state.
de: Der Parameter `alignment` weist `SwiftUI` an, dass Inhalte innerhalb von `frame` im Bearbeitungsstatus links und im Anzeigestatus zentriert ausgerichtet sein sollen.
es: El parámetro `alignment` indica a `SwiftUI` que cualquier contenido de `frame` se alinee al borde inicial en estado de edición y se centre cuando esté en estado de visualización.
es_419: El parámetro `alignment` indica a `SwiftUI` que el contenido dentro de `frame` debe estar alineado con el borde inicial durante el estado de edición, y alineado en el centro durante el estado de visualización.
fr: Le paramètre `alignment` indique à `SwiftUI` que tout contenu à l’intérieur de `frame` est aligné sur le bord avant dans l’état de modification et aligné au centre dans l’état d’affichage.
it: Il parametro `alignment` indica a `SwiftUI` che qualsiasi contenuto all’interno di `frame` si allinea al bordo iniziale se lo stato di modifica è attivo e allineato al centro nello stato di visualizzazione.
nl: De parameter `alignment` geeft `SwiftUI` opdracht om alle inhoud in `frame` uit lijnen met de voorste rand als de bewerkingsmodus actief is en te centreren als de weergavemodus actief is.
pt: O parâmetro `alignment` diz à `SwiftUI` que qualquer conteúdo dentro do `frame` se alinha à margem condutora quando no estado de edição e ao centro quando no estado de exibição.
sv: Parametern `alignment` säger åt `SwiftUI` att allt innehåll inuti `frame` ska kantjusteras till den ledande kanten i redigeringsläget och centreras i visningsläget.
th: พารามิเตอร์ `alignment` บอก `SwiftUI` ว่าเนื้อหาทั้งหมดภายใน `frame` จะจัดชิดขอบด้านหน้าในสถานะการแก้ไขและจัดอยู่ตรงกลางในสถานะการแสดงผล
tr: `alignment` parametresi, `SwiftUI`’ya `frame`’de bulunan içeriklerin düzenleme durumundayken öndeki kenara, görüntüleme durumundayken ortaya hizalanacağını söyler.
zh_cn: `alignment` 参数会告诉 `SwiftUI`，`frame` 中的所有内容在编辑状态下会对齐到前缘，在显示状态下会对齐到中心。
zh_tw: `alignment` 參數會告訴 `SwiftUI`，`frame` 內的任何內容在編輯狀態下都要對齊前緣，並且在顯示狀態下則要置中對齊。

source: Expand the preview to take up half of the screen. Notice how the emoji are squished in the middle of the view for both the editing and display state?
de: Erweitere die Vorschau, sodass sie die Hälfte des Bildschirms einnimmt. Ist dir aufgefallen, dass die Emojis im Bearbeitungs- und im Anzeigestatus in der Mitte der Ansicht zusammengequetscht erscheinen?
es: Amplía la previsualización para ocupar la mitad de la pantalla. Observa cómo quedan aplastados los emoji en medio de la vista tanto para el estado de edición como de visualización.
es_419: Expande la vista previa para que ocupe la mitad de la pantalla. Observa cómo los emojis se amontonan en la mitad de la visualización tanto para el estado de edición como el de visualización.
fr: Agrandis l’aperçu pour qu’il prenne la moitié de l’écran. Tu peux remarquer comment les Emoji sont entassés au milieu de la vue pour l’état de modification et d’affichage.
it: Espandi l’anteprima fino a occupare metà dello schermo. Vedi come le emoji appaiono schiacciate al centro della vista sia nello stato di visualizzazione che in quello di modifica?
nl: Vergroot de voorvertoning zodat deze het halve scherm beslaat. Zie je hoe de emoji's in het midden van de weergave worden samengedrukt in zowel de bewerkings- als de weergavemodus?
pt: Expanda a pré‑visualização para que ela ocupe metade da tela. Reparou como os emojis ficam espremidos no meio da visualização, tanto no estado de edição quanto no estado de exibição?
sv: Expandera förhandsvisningen så att den fyller halva skärmen. Ser du hur emojierna är hopträngda i mitten av vyn för både redigerings- och visningsläget?
th: ขยายการแสดงตัวอย่างให้ใช้พื้นที่ครึ่งหน้าจอ สังเกตไหมว่าอิโมจิถูกบีบอยู่ที่กึ่งกลางของมุมมองสำหรับทั้งสถานะการแก้ไขและการแสดงผล
tr: Önizlemeyi, ekranın yarısını kaplayacak şekilde genişlet. Hem düzenleme hem de görüntüleme durumunda görüntünün ortasındaki emojilerin nasıl sıkışık göründüğüne dikkat ettin mi?
zh_cn: 扩展预览以占据屏幕的一半空间。注意到编辑状态和显示状态下，视图中间的表情符号是如何被压扁的吗？
zh_tw: 展開預覽來使用一半的螢幕。注意表情符號是如何在編輯和顯示狀態的顯示區中間被擠壓的？

source: Try coding a solution; use this hint if you get stuck:
de: Probiere, eine Lösung dafür zu programmieren und verwende den Hinweis, falls du nicht weiterkommst:
es: Intenta programar una solución; usa esta pista si no sabes cómo avanzar:
es_419: Intenta programar una solución, usa esta pista si tienes problemas:
fr: Essaie de coder une solution, en utilisant cette astuce si tu es bloqué :
it: Prova a programmare una soluzione, usa questo suggerimento se ti blocchi:
nl: Probeer een oplossing te programmeren. Gebruik deze tip als je vast komt te zitten:
pt: Tente programar uma solução e use esta dica caso não consiga sair do lugar:
sv: Försök att koda en lösning och använd det här tipset om du fastnar:
th: ลองเขียนโค้ดเพื่อแก้ปัญหา ใช้คำใบ้นี้หากคุณไปต่อไม่ได้:
tr: Bir çözüm kodlamayı dene; sıkışırsan bu ipucunu kullan:
zh_cn: 试着用代码写一个解决方案；遇到困难时可以使用这个提示：
zh_tw: 嘗試設計解決方案的程式碼，如果遇到困難，請使用這個提示：

source: Add your code to the button label in the editing state and the `ForEach` statement that shows the emojis in the display state.
de: Füge deinen Code zum Etikett der Taste im Bearbeitungsstatus und zur `ForEach`-Anweisung hinzu, die im Anzeigestatus die Emojis anzeigt.
es: Añade el código a la etiqueta del botón en el estado de edición y a la sentencia `ForEach` que muestra los emojis en estado de visualización.
es_419: Agrega tu código a la etiqueta del botón en el estado de edición y el enunciado `ForEach` que muestra los emojis en el estado de visualización.
fr: Ajoute ton code à l’étiquette du bouton dans l’état de modification et l’instruction `ForEach` qui affiche les Emoji dans l’état d’affichage.
it: Aggiungi il codice all’etichetta del pulsante nello stato di modifica e all’istruzione `ForEach` che mostra le emoji nello stato di visualizzazione.
nl: Voeg je code toe aan het knoplabel in de bewerkingsmodus en de `ForEach`-instructie die de emoji's weergeeft in de weergavemodus.
pt: Adicione código à etiqueta do botão no estado de edição e a instrução `ForEach` que mostra os emojis no estado de exibição.
sv: Lägg till koden för knappetiketten i redigeringsläget och `ForEach`-uttrycket som visar emojierna i visningsläget.
th: เพิ่มโค้ดของคุณไปยังป้ายชื่อปุ่มในสถานะการแก้ไขและชุดคำสั่ง `ForEach` ที่แสดงอิโมจิในสถานะการแสดงผล
tr: Kodunu, düzenleme durumundaki düğme etiketine ve emojileri görüntüleme durumunda gösteren `ForEach` ifadesine ekle.
zh_cn: 编辑状态下将代码添加到按钮标签，显示状态下将代码添加到显示表情符号的 `ForEach`（针对每个）语句。
zh_tw: 將你的程式碼加入處於編輯狀態的按鈕標籤，和顯示表情符號處於顯示狀態的 `ForEach` 語句。

source: How about adding a gap between the circular buttons and the emoji in the editing state?
de: Soll ein Abstand zwischen den kreisförmigen Tasten und dem Emoji im Bearbeitungsstatus hinzugefügt werden?
es: ¿Y si añades un espacio vacío entre los botones circulares y los emojis en el estado de edición?
es_419: ¿Qué te parece si agregas un espacio entre los botones circulares y los emojis en el estado de edición?
fr: Que dirais-tu d’ajouter un blanc entre les boutons circulaires et les Emoji dans l’état de modification ?
it: Che ne dici di aggiungere uno spazio tra i pulsanti circolari e le emoji nello stato di modifica?
nl: Misschien is het een goed idee om ruimte tussen de ronde knoppen en de emoji's toe te voegen in de bewerkingsmodus?
pt: Que tal adicionar um espaço entre os botões circulares e o emoji no estado de edição?
sv: Vad sägs om att lägga till ett mellanrum mellan de runda knapparna och emojierna i redigeringsläget?
th: ลองเพิ่มช่องว่างระหว่างปุ่มวงกลมและอิโมจิในสถานะการแก้ไข
tr: Düzenleme durumunda dairesel düğmeler ile emoji arasına bir boşluk eklemeye ne dersin?
zh_cn: 编辑状态下，在圆形按钮和表情符号之间添加一个间隔怎么样？
zh_tw: 在編輯狀態下，在圓形按鈕和表情符號之間加入一個空隙怎麼樣？

source: Remember that there are multiple ways to achieve the same results. Try using one or more of the modifiers you’ve learned to create some space.
de: Wie du dich sicher erinnern kannst, gibt es viele verschiedene Möglichkeiten, um zu demselben Ergebnis zu gelangen. Probiere einen oder mehrere der Modifikatoren aus, die du zum Schaffen von Platz kennengelernt hast.
es: Recuerda que hay varias maneras de conseguir los mismos resultados. Prueba uno o varios de los modificadores que has aprendido para crear algo de espacio.
es_419: Recuerda que hay varias formas de conseguir los mismos resultados. Intenta usar uno o varios modificadores que has aprendido para crear espacio.
fr: N’oublie pas que tu peux atteindre les mêmes résultats de différentes manières. Essaie d’utiliser un ou plusieurs des modificateurs que tu as découverts pour créer de l’espace.
it: Ricorda che esistono più modi per ottenere gli stessi risultati. Sfrutta uno o più modificatori che hai imparato a usare per creare spazio.
nl: Vergeet niet dat er verschillende manieren zijn om hetzelfde resultaat te bereiken. Gebruik een of meer van de modifiers die je kent om ruimte te creëren.
pt: Lembre-se de que existem várias maneiras de chegar aos mesmos resultados. Tente usar um ou mais modificadores que você aprendeu para criar algum espaço.
sv: Kom ihåg att det finns många sätt att åstadkomma samma sak. Prova att använda en eller flera av modifierarna du har lärt dig för att skapa lite utrymme.
th: อย่าลืมว่ามีหลายวิธีที่จะทำให้ได้ผลลัพธ์เดียวกัน ลองใช้ปุ่มปรับค่ามากกว่าหนึ่งปุ่มที่คุณได้เรียนรู้มาเพื่อสร้างพื้นที่บางส่วน
tr: Aynı sonucu elde etmenin birçok yolu olduğunu unutma. Biraz alan yaratmak için öğrendiğin niteleyicilerden birini veya birden fazlasını kullanmayı dene.
zh_cn: 要记住，获得同一结果的方法有多种。尝试使用你学到的一个或多个修饰符来创建一些空间。
zh_tw: 請記住，有好幾種方法可以達成相同的結果。嘗試使用你學習過的一或多種修飾符來建立一些空間。
