Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: Notice how the background color of the `Image` view no longer fills in the entire row? That’s because adding a `Spacer` inside an `HStack` causes the stack to expand to fill in any remaining horizontal space, and pushes the `Image` view to the `.trailing` edge.
de: Ist dir aufgefallen, dass die Hintergrundfarbe der `Image`-Ansicht nicht mehr die gesamte Zeile füllt? Das liegt daran, dass durch Einfügen von `Spacer` in `HStack` der Stapel angewiesen wird, den verbleibenden horizontalen Platz auszufüllen und die `Image`-Ansicht zur `.trailing`-Kante zu verschieben.
es: Fíjate en que el color de fondo de la vista `Image` ya no rellena toda la fila. Eso ocurre porque añadir un `Spacer` dentro de la `HStack` hace que la pila se extienda para rellenar el espacio horizontal que quede, empujando la vista `Image` hasta el lado final.
es_419: ¿Ves que el color del fondo de la visualización `Image` ya no rellena toda la fila? Esto se debe a que agregar `Spacer` dentro de `HStack` ocasiona que la pila se expanda para rellenar el espacio horizontal restante y envía la visualización `Image` al borde `.trailing`.
fr: Tu remarqueras que la couleur d’arrière-plan de la vue `Image` ne remplit plus tout le rang. En effet, lʼajout dʼun `Spacer` à l’intérieur d’une `HStack` fera que la pile sʼagrandira pour remplir tout espace horizontal restant, ce qui poussera la vue `Image` vers le bord `.trailing`.
it: Vedi come il colore di sfondo della vista `Image` non riempie più l’intera riga? Ciò avviene perché aggiungendo uno `Spacer` all’interno di `HStack` fa in modo che la pila si espanda per riempire tutto lo spazio orizzontale rimanente, spostando la vista `Image` sul bordo `.trailing`.
nl: Is het je opgevallen dat de achtergrondkleur van de `Image`-weergave niet langer de hele rij vult? Dit komt doordat de stapel de resterende horizontale ruimte volledig vult als je een `Spacer` in een `HStack` toevoegt, waardoor de `Image`-weergave naar de `.trailing`-rand wordt geduwd.
pt: Reparou como a cor de fundo da visualização `Image` não preenche mais a linha inteira? Isso acontece porque a adição de um `Spacer` dentro de um `HStack` faz com que a pilha se expanda para preencher qualquer espaço horizontal remanescente e empurre a visualização `Image` para a margem `.trailing`.
sv: Ser du hur bakgrundsfärgen i `Image`-vyn inte längre fyller i hela raden? Det beror på att `HStack` expanderar traven tills den fyller allt återstående horisontellt utrymme när du lägger till en `Spacer` inuti den, och traven puffar `Image`-vyn mot `.trailing`-kanten.
th: สังเกตไหมว่าสีพื้นหลังของมุมมอง `Image` จะไม่แสดงเต็มทั้งแถวอีกต่อไป นั่นเป็นเพราะการเพิ่ม `Spacer` ภายใน `HStack` จะทำให้สแต็คขยายจนเต็มพื้นที่ในแนวนอนที่เหลือทั้งหมด และผลักมุมมอง `Image` ไปที่ขอบ `.trailing`
tr: `Image` görüntüsünün arka plan renginin artık sıranın tamamını doldurmadığına dikkat ettin mi? Bunun nedeni, `HStack`’in içine`Spacer` eklemenin, yığının kalan yatay alanı doldurmak üzere genişleyip `Image` görüntüsünü sondaki (`.trailing`) kenara itmesine neden olmasıdır.
zh_cn: 留意到 `Image` 视图的背景颜色是如何不再填充整行的吗？这是因为在 `HStack` 内添加一个 `Spacer`，会导致堆栈扩展以填满任何剩余的水平空间，并且将 `Image` 视图推至 `.trailing` 边缘。
zh_tw: 注意 `Image` 顯示區的背景顏色不再填滿整個橫列。這是因為 `HStack` 中的 `Spacer` 會擴展堆疊來填滿所有剩餘的水平空間，並將 `Image` 顯示區推到 `.trailing` 邊緣。

source: Try adding another book to the last shelf.
de: Versuche, ein anderes Buch zum letzten Regal hinzuzufügen.
es: Intenta añadir otro libro al último estante.
es_419: Intenta agregar otro libro al último estante.
fr: Essaie d’ajouter un autre livre à la dernière étagère.
it: Prova ad aggiungere un altro libro all’ultimo scaffale.
nl: Voeg nog een boek aan de laatste plank toe.
pt: Tente adicionar outro livro à última prateleira.
sv: Försök att lägga till en till bok på den sista hyllan.
th: ลองเพิ่มหนังสืออีกหนึ่งเล่มไปที่ชั้นวางสุดท้าย
tr: Son rafa başka bir kitap eklemeyi dene.
zh_cn: 试着将另一本书添加到最后一个书架。
zh_tw: 嘗試在最後一個書架上加入另一本書。

source: Add this code inside the `HStack` below the other `Image`:
de: Füge diesen Code in `HStack` unter der anderen Instanz von `Image` (Bild) ein:
es: Añade este código dentro de la `HStack`, debajo de la otra `Image`:
es_419: Agrega este código dentro de `HStack`, debajo de la otra visualización `Image`:
fr: Ajoute ce code à l’intérieur de la `HStack` sous l’autre `Image` :
it: Aggiungi questo codice all’interno di `HStack` sotto l’altra `Image`:
nl: Voeg deze code toe in de `HStack` onder de andere `Image`:
pt: Adicione este código dentro do `HStack` abaixo da outra `Image`:
sv: Lägg till den här koden inuti `HStack` nedanför din andra `Image`:
th: เพิ่มโค้ดนี้ภายใน`HStack` ด้านล่าง `Image` อีกรายการ`:
tr: Bu kodu `HStack` içinde diğer `Image`’ın altına ekle:
zh_cn: 在 `HStack` 内的另一个 `Image` 下方添加这些代码：
zh_tw: 將這段程式碼加入其他 `Image` 下方的 `HStack` 內：

source: Notice how the `Spacer` only fills in the empty space that’s left in the `HStack`?
de: Siehst du, wie `Spacer` (Abstandshalter) nur den leeren Platz ausfüllt, der in `HStack` übrig bleibt?
es: Observa cómo el `Spacer` solo rellenará el espacio vacío que queda en la pila `HStack`.
es_419: ¿Ves cómo `Spacer` sólo rellena el espacio vacío que queda en `HStack`?
fr: Tu peux voir que le `Spacer` ne remplit que l’espace vide restant dans la `HStack`.
it: Vedi come `Spacer` riempie solo lo spazio vuoto rimanente in `HStack`?
nl: Zoals je ziet, vult de `Spacer` alleen de lege ruimte die nog over is in de `HStack`.
pt: Reparou como o `Spacer` preenche apenas o espaço vazio que resta no `HStack`?
sv: Ser du hur `Spacer` bara fyller det tomma utrymmet som är kvar i `HStack`?
th: สังเกตไหมว่า `Spacer` จะเติมเต็มเฉพาะพื้นที่ว่างที่เหลือใน `HStack` เท่านั้น
tr: `Spacer`’ın nasıl yalnızca `HStack`’te kalan boş alanı doldurduğuna dikkat ettin mi?
zh_cn: 留意到 `Spacer` 是如何只填充 `HStack` 中的剩余空白空间的吗？
zh_tw: 注意 `Spacer` 會如何只填入 `HStack` 中剩餘的空白空間？

source: You just learned about three different ways to align your books:
de: Jetzt weißt du, wie du Bücher auf drei verschiedene Weisen ausrichten kannst:
es: Acabas de aprender tres maneras de alinear los libros:
es_419: Acabas de aprender tres formas de alinear tus libros:
fr: Tu viens de découvrir trois différents moyens d’aligner tes livres :
it: Hai appena imparato tre diversi modi per allineare i libri:
nl: Je hebt zojuist drie verschillende manieren geleerd om je boeken uit te lijnen:
pt: Você acabou de aprender três maneiras diferentes de alinhar os livros:
sv: Du har precis lärt dig tre olika sätt att kantjustera böckerna:
th: คุณเพิ่งได้เรียนรู้เกี่ยวกับสามวิธีที่แตกต่างกันในการจัดแนวหนังสือของคุณ:
tr: Az önce kitaplarını hizalamanın üç farklı yolunu öğrendin:
zh_cn: 你刚刚学会了对齐图书的三种不同方法：
zh_tw: 你剛剛學習了三種不同的方法來對齊你的書籍：

source: Using the alignment parameter in the container view
de: Durch Verwenden des Parameters zum Ausrichten in einer Containeransicht
es: Usar el parámetro `alignment` en la vista de contenedor
es_419: Usar el parámetro de alineación en la visualización de contenedor
fr: Utilisation du paramètre d’alignement dans la vue de conteneur
it: Utilizzare il parametro allineamento nella vista contenitore
nl: De parameter `alignment` gebruiken in de containerweergave
pt: Usando o parâmetro de alinhamento na visualização de contêiner
sv: Använda alignment-parametern i behållarvyn
th: การใช้พารามิเตอร์การจัดแนวในมุมมองคอนเทนเนอร์
tr: Kapsayıcı görüntüsünde hizalama parametresini kullanma
zh_cn: 在容器视图中使用对齐参数
zh_tw: 在容器顯示區中使用對齊參數

source: Adding a frame modifier with the alignment parameter
de: Durch Hinzufügen eines Modifikators für den Rahmen zusammen mit dem Parameter zum Ausrichten
es: Añadir un modificador `frame` con el parámetro `alignment`
es_419: Agregar un modificador de marco con el parámetro de alineación
fr: Ajout d’un modificateur d’image avec le paramètre d’alignement
it: Aggiungere un modificatore della cornice con il parametro allineamento
nl: Een `frame`-modifier toevoegen met de parameter `alignment`
pt: Adicionando um modificador de moldura com o parâmetro de alinhamento
sv: Lägga till en frame-modifierare med alignment-parametern
th: การเพิ่มปุ่มปรับค่ากรอบด้วยพารามิเตอร์การจัดแนว
tr: Hizalama parametresiyle bir çerçeve (frame) niteleyicisi ekleme
zh_cn: 添加带对齐参数的框架修饰符
zh_tw: 使用對齊參數加入外框修飾符

source: Utilizing a `Spacer` to align your views
de: Durch Verwenden von `Spacer` zum Ausrichten der Ansichten
es: Utilizar un `Spacer` para alinear las vistas
es_419: Usar un espaciador para alinear las visualizaciones
fr: Utiliser un `Spacer` pour aligner les vues
it: Utilizzare uno `Spacer` per allineare le viste
nl: Een `Spacer` gebruiken om weergaven uit te lijnen
pt: Usando um `Spacer` para alinhar as visualizações
sv: Använda en `Spacer` till att kantjustera vyer
th: การใช้ `Spacer` เพื่อจัดแนวมุมมองของคุณ
tr: Görüntülerini hizalamak için bir `Spacer`’dan yararlanma
zh_cn: 利用 `Spacer` 来对齐视图
zh_tw: 運用 `Spacer` 來對齊顯示區

source: Different types of views and circumstances require different techniques. To learn more about the size and spacing of views, see [Laying out a simple view](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
de: Unterschiedlichen Ansichtstypen und Rahmenbedingungen erfordern jeweils andere Techniken. Weitere Infos zu Größen und Abständen von Ansichten findest du unter [Laying out a simple view (Layout für eine einfache Ansicht erstellen)](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
es: Los distintos tipos de vistas y circunstancias requieren diferentes técnicas. Para aprender más sobre el tamaño y el espaciado de las vistas, consulta el apartado [Disponer una visualización sencilla](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
es_419: Diferentes tipos de visualizaciones y circunstancias requieren diferentes técnicas. Para obtener detalles sobre el tamaño y el espaciado de las visualizaciones, consulta [Organizar una visualización simple](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
fr: Différents types de vues et de circonstances requièrent des techniques différentes. Pour en savoir plus sur la taille et l’espacement des vues, consulte la rubrique [Disposition d’une vue simple](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
it: Tipi di viste e circostanze diverse richiedono tecniche differenti. Per ulteriori informazioni sulle dimensioni e sulla spaziatura delle viste, consulta [Impostare il layout di una vista semplice](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
nl: Voor verschillende weergavetypen zijn verschillende technieken vereist. Raadpleeg [Laying out a simple view](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) als je meer wilt leren over de grootte en afstanden van weergaven.
pt: Tipos diferentes de visualizações e circunstâncias exigem técnicas diferentes. Para saber mais sobre o tamanho e espaçamento de visualizações, confira [Laying out a simple view](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
sv: Olika typer av vyer och förhållanden kräver olika tekniker. Du kan lära dig mer om storlekar och avstånd mellan vyer i [Laying out a simple view](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view).
th: มุมมองและสถานการณ์ที่แตกต่างกันต้องใช้เทคนิคที่แตกต่างกัน ในการเรียนรู้เพิ่มเติมเกี่ยวกับขนาดและระยะห่างของมุมมอง ให้ดูที่[การวางเค้าโครงมุมมองอย่างง่าย](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view)
tr: Farklı türlerde görüntüler ve durumlar farklı teknikler gerektirir. Görüntülerin büyüklüğü ve aralığı hakkında daha fazla bilgi edinmek için [Basit Görüntü Yerleştirme](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view) bölümüne bak.
zh_cn: 不同类型的视图和环境所需的技术不同。如果要进一步了解视图的大小和间距，你可以参阅[布局一个简单的视图](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view)。
zh_tw: 不同類型的顯示區和環境需要不同的技術。若要瞭解更多顯示區大小和間距的相關資訊，請參閱 [Laying out a simple view](doc://com.apple.documentation/documentation/swiftui/laying-out-a-simple-view)。

source: What if you want to space the books further apart from each other?
de: Was wäre denn, wenn du mehr Abstand zwischen den Büchern haben möchtest?
es: ¿Qué hacer si quieres separar los libros entre sí más todavía?
es_419: ¿Y si quisieras separar más los libros?
fr: Et si tu veux espacer davantage les livres ?
it: Come si fa a distanziare molto i libri l’uno dall’altro?
nl: Stel dat je de ruimte tussen de boeken groter wilt maken.
pt: E se você quiser que os livros fiquem mais afastados uns dos outros?
sv: Vad gör du om du vill att böckerna ska vara längre från varandra?
th: จะทำอย่างไรหากคุณต้องการให้หนังสือเว้นระยะห่างจากกันมากขึ้น
tr: Kitapları birbirinden daha uzağa koymak istiyorsan ne olacak?
zh_cn: 如果想让图书之间的距离更远，该怎么办？
zh_tw: 如果你想讓書籍之間的距離更遠一些，該怎麼做？

source: Try specifying the spacing inside the `HStack`:
de: Versuche, den Abstand in `HStack` festzulegen:
es: Prueba a especificar el espaciado dentro de la pila `HStack`:
es_419: Intenta especificar el espaciado dentro de `HStack`:
fr: Essaie d’indiquer l’espacement à l’intérieur de la `HStack` :
it: Prova a specificare la spaziatura all’interno di `HStack`:
nl: Probeer de tussenruimte in de `HStack` op te geven`:
pt: Tente especificar o espaçamento dentro do `HStack`:
sv: Försök att ange mellanrummen inuti `HStack`:
th: ลองระบุการเว้นระยะห่างภายใน `HStack` ดูสิ`:
tr: Aralığı `HStack`’in içinde belirtmeyi dene:
zh_cn: 试着在 `HStack` 内指定间距：
zh_tw: 嘗試指定 `HStack` 內的間距：

source: This specifies the horizontal spacing between every [subview](glossary://subview) inside the `HStack`.
de: Damit legst du den horizontalen Abstand zwischen den jeweiligen [Unteransichten](glossary://subview) in `HStack` fest.
es: Así especificas el espaciado horizontal que queda entre cada [vista secundaria](glossary://subview) dentro de la pila `HStack`.
es_419: Esto especifica el espaciado horizontal entre cada [subvisualización](glossary://subview) dentro de `HStack`.
fr: Cela précise l’espacement horizontal entre chaque [sous-vue](glossary://subview) à l’intérieur de la `HStack`.
it: Questa azione specifica la spaziatura orizzontale tra ogni [vista secondaria](glossary://subview) all’interno di `HStack`.
nl: Hiermee stel je de horizontale ruimte tussen elke [subweergave](glossary://subview) in de `HStack` in.
pt: Isso especifica o espaçamento horizontal entre cada [subvisualização](glossary://subview) dentro do `HStack`.
sv: Det här anger det horisontella utrymmet mellan varje [delvy](glossary://subview) inuti `HStack`.
th: การทำเช่นนี้จะระบุการเว้นระยะห่างในแนวนอนระหว่าง[มุมมองย่อย](glossary://subview)ทุกมุมมองภายใน `HStack`
tr: Bu, `HStack`’in içinde bulunan [alt görüntüler](glossary://subview) arasındaki yatay aralığı belirtir.
zh_cn: 这会指定 `HStack` 内各个[子视图](glossary://subview)之间的水平间距。
zh_tw: 這會指定 `HStack` 中每個[子顯示區](glossary://subview)之間的水平間距。

source: If you want to position the books further from the edge, you can also add padding to the `.trailing` edge of the book:
de: Wenn die Bücher weiter entfernt von der Kante positioniert werden sollen, kannst du auch einen Randabstand zur `.trailing`-Kante des Buchs hinzufügen:
es: Si quieres colocar los libros más alejados del borde, también puedes añadir relleno al borde final, `.trailing`, del libro:
es_419: Si quieres colocar los libros más lejos del borde, también puedes agregar relleno al borde `.trailing` del libro:
fr: Si tu veux positionner les livres plus loin du bord, tu peux également ajouter un remplissage au bord `.trailing` du livre :
it: Se desideri posizionare i libri più lontano dal bordo, puoi aggiungere una spaziatura interna al bordo `.trailing` del libro:
nl: Als je de afstand tussen de boeken en de rand wilt vergroten, kun je ook padding aan de `.trailing`-rand van het boek toevoegen:
pt: Caso queira posicionar os livros mais longe da borda, você também pode adicionar preenchimento à margem `.trailing` do livro:
sv: Om du vill placera böckerna längre bort från kanten kan du också lägga till tomrum för bokens `.trailing`-kant:
th: ถ้าคุณต้องการให้หนังสืออยู่ห่างจากขอบมากขึ้น คุณยังสามารถเพิ่มการขยายขอบไปที่ขอบ `.trailing` ของหนังสือได้อีกด้วย:
tr: Kitapları kenardan daha uzağa yerleştirmek istiyorsan kitabın sondaki (`.trailing`) kenarına da boşluk ekleyebilirsin:
zh_cn: 如果想让图书离边缘更远一些，你还可以给图书的 `.trailing` 边缘添加填补：
zh_tw: 如果你希望書籍的位置離開邊緣遠一點，還可以在書籍的 `.trailing` 邊緣加入填充：

source: This adds a little space to the trailing edge of the book. Try exploring other padding options such as `.leading`, `.top`, `.bottom`, `.horizontal`, and so on.
de: Dadurch wird ein kleiner Abstand an der rechten Seite des Buchs hinzugefügt. Probiere auch die anderen Optionen für Randabstände aus, wie z. B. `.leading`, `.top`, `.bottom` oder `.horizontal`.
es: Esto añadirá un poquito de espacio al borde final del libro. Prueba con otras opciones de relleno como en la parte izquierda (`.leading`), superior (`.top`), inferior (`.bottom`), horizontal (`.horizontal`), etc.
es_419: Esto agrega un poco de espacio al borde final del libro. Intenta explorar otras opciones de relleno como `.leading`, `.top`, `.bottom`, `.horizontal`, etc.
fr: Cela ajoute un petit espace au bord arrière du livre. Essaie d’explorer d’autres options de remplissage, telles que `.leading`, `.top`, `.bottom`, `.horizontal`, etc.
it: Questa azione aumenta leggermente lo spazio del bordo posteriore del libro. Prova a esplorare altre opzioni di spaziatura interna, come `.leading`, `.top`, `.bottom`, `.horizontal` e così via.
nl: Hiermee voeg je een beetje ruimte tussen de `.trailing`-rand van het boek toe. Experimenteer met andere paddingopties zoals `.leading`, `.top`, `.bottom` en `.horizontal`.
pt: Isso adiciona um pouco de espaço à margem de trilha do livro. Tente explorar outras opções de preenchimento, como `.leading`, `.top`, `.bottom`, `.horizontal` e assim por diante.
sv: Det här lägger till lite utrymme för bokens avslutande kant. Prova att undersöka andra tomrumsalternativ som `.leading`, `.top`, `.bottom`, `.horizontal` och så vidare.
th: การทำเช่นนี้จะเพิ่มพื้นที่เล็กน้อยไปยังขอบด้านหลังของหนังสือ ลองสำรวจตัวเลือกการขยายขอบอื่นๆ เช่น `.leading`, `.top`, `.bottom`, `.horizontal` เป็นต้น
tr: Bu, kitabın sondaki kenarına biraz boşluk ekler. `.leading`, `.top`, `.bottom`, `.horizontal` ve benzeri gibi diğer boşluk seçeneklerini keşfetmeyi dene.
zh_cn: 这会给图书的末尾边缘增加一点空间。尝试探索其他填补选项，如 `.leading`、`.top`、`.bottom` 和 `.horizontal` 等等。
zh_tw: 這會在書籍的後緣加入一些空間。請嘗試探索其他填充選項，例如 `.leading`、`.top`、`.bottom` 和 `.horizontal` 等。

source: Now, what if you want to position all of the books and shelves away from the edge of the screen?
de: Und was wäre denn, wenn du alle Bücher und Regale von der Bildschirmkante entfernt positionieren möchtest?
es: ¿Y si quisieras colocar todos los libros y estantes más separados del borde de la pantalla?
es_419: ¿Qué pasa si quieres colocar todos los libros y estantes lejos del borde de la pantalla?
fr: Et si tu veux positionner la totalité des livres et des étagères loin du bord de l’écran ?
it: Come si fa a posizionare tutti i libri e gli scaffali lontano dal bordo dello schermo?
nl: Stel nu dat je alle boeken en planken verder van de rand van het scherm vandaan wilt plaatsen.
pt: E se você quiser posicionar todos os livros e prateleiras longe da borda da tela?
sv: Så vad gör du nu om du vill placera alla böckerna och hyllorna längre bort från skärmkanten?
th: ตอนนี้ จะทำอย่างไรหากคุณต้องการให้หนังสือและชั้นวางทั้งหมดอยู่ห่างจากขอบของหน้าจอ
tr: Peki ama ya kitapların ve rafların tümünü ekranın kenarından uzağa yerleştirmek istiyorsan?
zh_cn: 现在，如果你想让所有图书和书架都远离屏幕边缘，该怎么办？
zh_tw: 現在，如果你想讓所有的書籍和書架位置離開螢幕邊緣，應該怎麼做？

source: You could add horizontal padding to every row of shelves and books, but that’s a lot of work and not easy to maintain. Instead, you should always apply modifiers to the [container view](glossary://container). In this case, the container is the `VStack`.
de: Du könntest einen horizontalen Randabstand zu jeder Regal- und Bücherzeile hinzufügen. Allerdings ist das eine Menge Arbeit und das Ganze lässt sich nicht leicht aufrechterhalten. Du solltest stattdessen immer Modifikatoren auf die [Containeransicht](glossary://container) anwenden. In diesem Fall ist die Containeransicht die Instanz von `VStack`.
es: Podrías añadir relleno horizontal a todas las filas de estantes y libros, pero eso sería muy trabajoso y nada fácil de mantener. En vez de eso, siempre deberías aplicar modificadores a la [vista de contenedor](glossary://container). En este caso, el contenedor es `VStack`.
es_419: Podrías agregar un relleno horizontal a cada fila de estantes y libros, pero esto sería mucho trabajo y no sería fácil de mantener. En su lugar, se recomienda siempre aplicar modificadores a la [visualización de contenedor](glossary://container). En este caso, esta visualización es la pila `VStack`.
fr: Tu pourrais ajouter un remplissage horizontal à chaque rang d’étagères et de livres, mais cela représente beaucoup de travail et ce n’est pas facile à maintenir. Au lieu de cela, tu devrais toujours appliquer les modificateurs à la [vue de conteneur](glossary://container). Dans le cas présent, la vue de conteneur est la `VStack`.
it: Puoi aggiungere una spaziatura interna orizzontale a ogni fila di scaffali e libri, ma si tratta di un lavoro lungo e non semplice da mantenere. Invece, dovresti applicare sempre i modificatori alla [vista contenitore](glossary://container). In questo caso, la vista contenitore è `VStack`.
nl: Je kunt horizontale padding aan elke rij met planken en boeken toevoegen, maar dat is een hoop werk en niet eenvoudig om te onderhouden. In plaats daarvan moet je altijd modifiers toepassen op de [containerweergave](glossary://container). In dit geval is de `VStack` de containerweergave.
pt: Você pode adicionar um preenchimento horizontal a cada fileira de prateleiras e livros, mas isso dá muito trabalho e não é fácil de manter. Em vez disso, você sempre deve aplicar modificadores à [visualização de contêiner](glossary://container). Nesse caso, o contêiner é o `VStack`.
sv: Du skulle kunna lägga till ett horisontellt tomrum i varje rad med hyllor och böcker, men det är ett stort jobb och inte enkelt att upprätthålla. Istället bör du alltid använda modifierare i [behållarvyn](glossary://container). I det här fallet är `VStack` behållaren.
th: คุณสามารถเพิ่มการขยายขอบในแนวนอนไปยังแถวของชั้นวางและหนังสือทุกแถวได้ แต่นั่นเป็นงานที่หนักและดูแลรักษาได้ยาก คุณจึงควรปรับใช้ปุ่มปรับค่ากับ[มุมมองคอนเทนเนอร์](glossary://container)แทนเสมอ ในกรณีนี้ คอนเทนเนอร์คือ `VStack`
tr: Her raf ve kitap sırasına yatay boşluk ekleyebilirsin ama bu çok zaman alır ve sürdürmesi de kolay değildir. Bunun yerine, niteleyicileri her zaman [kapsayıcı görüntüye](glossary://container) uygulamalısın. Bu durumda `VStack` kapsayıcı görüntüdür.
zh_cn: 你可以给每一行书架和图书添加水平填补，但工作量会很大且不易维护。你应改为将修饰符始终应用到[容器视图](glossary://container)。在这里，容器是 `VStack`。
zh_tw: 你可以為每一排書架和書籍加入水平填充，但這是一項大工程而且不容易維護。你反而應該總是將修飾符套用到[容器顯示區](glossary://container)。在這種情況下，容器是 `VStack`。
