Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: In your first design challenge, your mission is to update the `PatternChallengeView` body, which is drawn in the bottom-half of the preview, to match the top-half of the preview.
de: In deiner ersten Designherausforderung ist es deine Aufgabe, den Hauptteil von `PatternChallengeView`, der in der unteren Hälfte der Vorschau gezeichnet wird, so zu aktualisieren, dass er mit der oberen Hälfte der Vorschau übereinstimmt.
es: En tu primer desafío de diseño, tu misión consiste en actualizar el cuerpo `PatternChallengeView`, que se dibuja en la mitad inferior de la vista previa, para que coincida con la mitad superior de la vista previa.
es_419: En tu primer reto de diseño, tu misión es actualizar el cuerpo de `PatternChallengeView`, que se dibuja en la mitad inferior de la vista previa, de modo que coincide con la mitad superior.
fr: Lors de ton premier défi de conception, ta mission consiste à mettre à jour le corps `PatternChallengeView`, qui est dessiné dans la moitié inférieure de l’aperçu, afin qu’il corresponde à la moitié supérieure de l’aperçu.
it: Nella prima attività di progettazione, la tua missione consiste nell’aggiornare il corpo di `PatternChallengeView`, che viene disegnato nella metà inferiore dell’anteprima, in modo da farlo corrispondere alla metà superiore dell’anteprima.
nl: In je eerste ontwerpuitdaging moet je de `PatternChallengeView`-body die wordt getekend in de onderste helft van de voorvertoning bijwerken zodat deze overeenkomt met de bovenste helft van de voorvertoning.
pt: No primeiro desafio de design, sua missão é atualizar o corpo `PatternChallengeView` (desenhado na metade inferior da pré‑visualização) para que fique igual à metade superior da pré‑visualização.
sv: I din första designutmaning ska du uppdatera `PatternChallengeView`-bodyn, som ritas upp i den nedre halvan av förhandsvisningen, så att den matchar den övre halvan av förhandsvisningen.
th: ในคำท้าการออกแบบครั้งแรกของคุณ ภารกิจของคุณคืออัปเดตเนื้อหา `PatternChallengeView` ซึ่งวาดอยู่ครึ่งล่างของการแสดงตัวอย่าง ให้ตรงกับครึ่งบนของการแสดงตัวอย่าง
tr: İlk tasarım meydan okumanda görevin, önizlemenin alt yarısına çizilen `PatternChallengeView` gövde kısmını önizlemenin üst yarısıyla eşleşecek şekilde güncellemek.
zh_cn: 在第一个设计挑战中，你的任务是更新预览下半部分中绘制的 `PatternChallengeView`（模式挑战视图）主体，让它与预览的上半部分吻合。
zh_tw: 在你的第一個設計挑戰中，你的任務是更新在預覽下半部繪製的 `PatternChallengeView` 主體，讓它符合預覽的上半部。

source: Try it out now, and don’t be shy about using the hints if you get stuck.
de: Probiere es jetzt aus. Du kannst jederzeit die Tipps verwenden, falls du nicht weiterkommst.
es: Prueba a hacerlo ahora, y no dudes en usar las pistas si no puedes avanzar.
es_419: Inténtalo ahora, y no dudes en usar las pistas si las necesitas.
fr: Essaie maintenant, et n’hésite pas à utiliser les astuces si tu bloques.
it: Prova subito e non esitare a usare i suggerimenti se ti blocchi.
nl: Probeer het maar eens. En aarzel niet om de tips te gebruiken als je vast komt te zitten.
pt: Experimente fazer isso agora e não se envergonhe de usar as dicas caso não consiga sair do lugar.
sv: Försök nu, och var inte orolig för att använda tipsen ifall du fastnar.
th: ลองทำเลย และอย่าอายที่จะใช้คำใบ้หากคุณไปต่อไม่ได้
tr: Şimdi bir dene ve sıkışırsan ipuçlarını kullanmaktan çekinme.
zh_cn: 现在试试看，遇到困难时可以尽情使用提示。
zh_tw: 立刻嘗試，如果遇到困難，不要害羞使用提示。

source: Do you notice that the top mock-up stacks two rectangles vertically? How can you edit this line of code to match what you see in the top-half of the preview?
de: Ist dir aufgefallen, dass der obere Entwurf zwei Rechtecke vertikal stapelt? Wie kannst du diese Codezeile bearbeiten, damit sie mit dem übereinstimmt, was du in der oberen Hälfte der Vorschau siehst?
es: ¿Te has dado cuenta de que el boceto de la parte de arriba tiene dos rectángulos apilados en vertical? ¿Cómo puedes editar esta línea de código para que coincida con lo que ves en la mitad superior de la vista previa?
es_419: ¿Observaste que el modelo superior apila dos rectángulos de forma vertical? ¿Cómo puedes editar esta línea de código para que coincida con lo que ves en la mitad superior de la vista previa?
fr: As-tu remarqué que la maquette du haut empile deux rectangles verticalement ? Comment peux-tu modifier cette ligne de code pour qu’elle corresponde à ce que tu vois dans la moitié supérieure de l’aperçu ?
it: Hai notato che il modello superiore impila due rettangoli in verticale? Come si modifica questa riga di codice per far sì che corrisponda a ciò che visualizzi nella metà superiore dell’anteprima?
nl: Is het je opgevallen dat het model in de bovenste helft twee rechthoeken bevat die verticaal zijn gestapeld? Hoe kun je deze regel code wijzigen om hetzelfde te bereiken in de onderste helft?
pt: Reparou que o modelo superior empilha dois retângulos verticalmente? Como você pode editar essa linha de código para que o resultado seja igual ao que você vê na metade superior da pré‑visualização?
sv: Märkte du att den övre modellen travar två rektanglar vertikalt? Hur kan du redigera den här kodraden så att den matchar det du ser i den övre halvan av förhandsvisningen?
th: คุณสังเกตไหมว่าตัวอย่างจำลองด้านบนมีสี่เหลี่ยมสองรูปซ้อนกันในแนวตั้ง คุณจะแก้ไขโค้ดบรรทัดนี้อย่างไรเพื่อให้ตรงกับสิ่งที่คุณเห็นในครึ่งบนของการแสดงตัวอย่าง
tr: Üstteki modelin iki dikdörtgeni düşey olarak üst üste koyduğuna dikkat ettin mi? Bu kod satırını, önizlemenin üst yarısında gördüğünle eşleşecek şekilde nasıl düzenleyebilirsin?
zh_cn: 你有注意到顶部模型垂直堆放了两个矩形吗？你该如何编辑这行代码，来与预览的上半部分内容吻合？
zh_tw: 你是否注意到頂部模型垂直堆疊了兩個矩形？你要如何編輯這行程式碼以符合你在預覽的上半部所看到的內容？

source: What do you have to add to the `ZStack` in the highlighted code to make the top rectangle in your design look like the top rectangle in the preview?
de: Was musst du im hervorgehobenen Code zu `ZStack` hinzufügen, um das oberste Rechteck im Modell so aussehen zu lassen wie das obere Rechteck in der Vorschau?
es: ¿Qué tienes que añadir al contenedor `ZStack` en el código resaltado para hacer que el rectángulo de arriba de tu diseño sea como el rectángulo superior de la vista previa?
es_419: ¿Qué tienes que agregar a la pila `ZStack`, en el código resaltado, para hacer que el rectángulo superior de tu diseño se vea como el rectángulo superior de la vista previa?
fr: Que dois-tu ajouter à la `ZStack`, dans le code mis en surbrillance, pour que le rectangle supérieur de ta conception ressemble au rectangle supérieur de l’aperçu ?
it: Cosa bisogna aggiungere a ZStack, nel codice evidenziato, per far sì che il rettangolo superiore del design abbia lo stesso aspetto del rettangolo superiore dell’anteprima?
nl: Wat moet je toevoegen aan de gemarkeerde code in de `ZStack` om ervoor te zorgen dat de bovenste rechthoek in je ontwerp er net zo komt uit te zien als de bovenste rechthoek in de voorvertoning?
pt: O que você precisa adicionar ao `ZStack` no código destacado para fazer com que o retângulo superior do design se pareça com o retângulo superior da pré‑visualização?
sv: Vad måste du lägga till i `ZStack` i den markerade koden så att den övre rektangeln i designen ser ut som den övre rektangeln i förhandsvisningen?
th: คุณต้องเพิ่มอะไรไปยัง `ZStack` ในโค้ดที่ไฮไลท์อยู่เพื่อทำให้สี่เหลี่ยมด้านบนในการออกแบบของคุณมีลักษณะเหมือนกับสี่เหลี่ยมด้านบนในการแสดงตัวอย่าง
tr: Tasarımında üstteki dikdörtgenin önizlemedeki üstteki dikdörtgen gibi görünmesini sağlamak için vurgulanan kodda `ZStack`’e ne eklemen gerekir?
zh_cn: 你要在高亮标记的代码中给 `ZStack` 添加什么，才能让设计中的顶部矩形看起来像是预览中的顶部矩形？
zh_tw: 你必須在 `ZStack` 中加入什麼，才能在反白顯示的程式碼中讓設計的上方矩形看起來像預覽中的上方矩形？

source: The rectangle with the two circles on it is pretty close to the design mock-up.
de: Das Rechteck mit den zwei Kreisen kommt dem Designmodell schon ziemlich nahe.
es: El rectángulo que tiene dos círculos encima se parece mucho al boceto de diseño.
es_419: El rectángulo con los dos círculos se parece bastante al modelo del diseño.
fr: Le rectangle avec les deux cercles dessus est assez proche de la maquette de conception.
it: Il rettangolo con i due cerchi è abbastanza vicino al modello del design.
nl: De rechthoek met de twee cirkels is bijna hetzelfde als het model.
pt: O retângulo com os dois círculos se parece bastante com o modelo do design.
sv: Rektangeln med de två cirklarna på den är rätt så nära designmodellen.
th: สี่เหลี่ยมที่มีวงกลมสองวงด้านบนค่อนข้างจะใกล้เคียงกับตัวอย่างจำลองการออกแบบ
tr: Üzerinde iki daire olan dikdörtgen, tasarım modeline oldukça yakın.
zh_cn: 上方有两个圆形的矩形，与设计模型十分接近了。
zh_tw: 上面有兩個圓形的矩形非常接近設計模型。

source: Can you guess what you have to change to make it the same?
de: Weißt du, was du ändern müsstest, um sie gleich aussehen zu lassen?
es: ¿Se te ocurre qué tienes que cambiar para que sean iguales?
es_419: ¿Puedes adivinar qué tienes que cambiar para que sea el mismo?
fr: Peux-tu dire ce que tu dois modifier pour qu’il soit identique ?
it: Riesci a indovinare cosa devi cambiare per renderlo uguale?
nl: Kun je bedenken wat je moet wijzigen om ze precies hetzelfde te maken?
pt: Você consegue adivinhar o que é necessário mudar para torná-lo igual?
sv: Kan du gissa vad du måste ändra så att den blir likadan?
th: คุณสามารถเดาได้ไหมว่าคุณต้องเปลี่ยนสิ่งใดเพื่อทำให้เหมือนกัน
tr: Bunları aynı yapmak için neleri değiştirmen gerektiğini tahmin edebilir misin?
zh_cn: 你能猜到要更改什么，才能使它完全一致吗？
zh_tw: 你能猜到你必須更改什麼才能讓它變成一樣嗎？

source: Wow, you made it through that whole challenge! If your design looks a little funky, here is a hint of what your code could look like to match the design mock-up:
de: Wow, du hast es durch die gesamte Herausforderung geschafft! Wenn dein Design ein kleines bisschen komisch aussieht, findest du hier einen Tipp, wie der Code aussehen könnte, um mit dem Designmodell übereinzustimmen:
es: ¡Hala!, ¡has hecho todo el reto! Si el diseño ha quedado un poco curioso, aquí tienes una pista de cómo debería ser el código para que el resultado quede como el boceto de diseño:
es_419: ¡Asombroso, completaste el reto! Si tu diseño se ve un poco raro, aquí tienes una pista de cómo podría verse tu código para que coincida con el modelo del diseño:
fr: Ouah, tu as réussi à relever la totalité du défi ! Si ta conception a l’air un peu bizarre, voici un indice de ce à quoi ton code pourrait ressembler pour correspondre à la maquette de conception :
it: Ce l’hai fatta, complimenti! Se il design ti sembra un po’ strano, ecco un suggerimento su come potrebbe apparire il codice per corrispondere al modello del design:
nl: Wauw, je hebt de hele uitdaging afgerond! Als je ontwerp er nog een beetje anders uitziet, kun je hier bekijken hoe je code eruit zou moeten zien om precies overeen te komen met het model:
pt: Uau, você conseguiu passar pelo desafio inteiro! Se o design estiver um pouco estranho, confira esta dica de como o código pode ficar para ser igual ao modelo do design:
sv: Wow, du tog dig igenom hela utmaningen! Om din design ser lite konstig ut får du ett tips här om hur koden skulle kunna se ut för att matcha designmodellen.
th: ว้าว คุณผ่านคำท้าทั้งหมดนั้นมาได้แล้ว! ถ้าการออกแบบของคุณดูแปลกๆ ไปหน่อย นี่คือคำใบ้ว่าโค้ดของคุณควรมีลักษณะอย่างไรเพื่อให้ตรงกับตัวอย่างจำลองการออกแบบ:
tr: Vay canına, bütün meydan okumayı tamamladın! Tasarımın biraz tuhaf görünüyorsa kodunun tasarım modeliyle eşleşmesi için nasıl olması gerektiğiyle ilgili bir ipucu işte burada:
zh_cn: 哇，你完成了整个挑战！如果你的设计看起来有点古怪，这个提示可以告诉你与设计模型更吻合的代码看起来应该是什么样：
zh_tw: 哇！你通過了整個挑戰！如果你的設計看起來有點奇怪，這裡的提示能告訴你與設計模型相符合的程式碼看起來應該是如何：

# GuideBook..Guide0..StepMy Journal..TaskGroup0..TaskviewSizing..title
source: Modify and determine view sizes
de: Größe von Ansichten ändern und festlegen
es: Modificar y determinar los tamaños de las vistas
es_419: Modificar y determinar el tamaño de las visualizaciones
fr: Modifier et déterminer les tailles des vues
it: Modificare e determinare le dimensioni delle viste
nl: De grootte van weergaven bepalen en aanpassen
pt: Modifique e determine os tamanhos das visualizações
sv: Ändra och fastställa vystorlekar
th: แก้ไขและกำหนดขนาดมุมมอง
tr: Görüntü büyüklüklerini değiştirme ve belirleme
zh_cn: 修改和确定视图大小
zh_tw: 修改和決定顯示區大小

source: A SwiftUI [View](doc://com.apple.documentation/documentation/swiftui/view) determines its size based on the space offered by its [container](glossary://container) view.
de: Eine SwiftUI-[Ansicht](doc://com.apple.documentation/documentation/swiftui/view) legt ihre Größe auf Grundlage des Platzes fest, den sie von ihrer [Container](glossary://container)ansicht zur Verfügung gestellt bekommt.
es: El tamaño de una [vista](doc://com.apple.documentation/documentation/swiftui/view) de SwiftUI queda determinado por el espacio ofrecido por su vista de [contenedor](glossary://container).
es_419: Una [visualización](doc://com.apple.documentation/documentation/swiftui/view) de SwiftUI determina su tamaño según el espacio que ofrece su visualización de [contenedor](glossary://container).
fr: Une [vue](doc://com.apple.documentation/documentation/swiftui/view) SwiftUI détermine sa taille en fonction de l’espace offert par sa vue [conteneur](glossary://container).
it: Una [Vista](doc://com.apple.documentation/documentation/swiftui/view) SwiftUI determina la sua dimensione in base allo spazio offerto dalla vista [contenitore](glossary://container).
nl: De grootte van een [View](doc://com.apple.documentation/documentation/swiftui/view) in SwiftUI wordt bepaald door de ruimte die de [container](glossary://container)weergave beschikbaar stelt.
pt: Uma [Visualização](doc://com.apple.documentation/documentation/swiftui/view) de SwiftUI determina seu tamanho com base no espaço oferecido por sua visualização de [contêiner](glossary://container).
sv: En SwiftUI-[vy](doc://com.apple.documentation/documentation/swiftui/view) avgör sin storlek baserad på utrymmet som finns i dess [behållar](glossary://container)vy.
th: [มุมมอง](doc://com.apple.documentation/documentation/swiftui/view) SwiftUI กำหนดขนาดของตัวเองตามพื้นที่ที่มุมมอง[คอนเทนเนอร์](glossary://container)มีให้
tr: Bir SwiftUI [görüntüsü](doc://com.apple.documentation/documentation/swiftui/view), kendi büyüklüğünü [kapsayıcı](glossary://container) görüntüsü tarafından sunulan alana göre belirler.
zh_cn: SwiftUI [视图](doc://com.apple.documentation/documentation/swiftui/view)基于它的[容器](glossary://container)视图所提供的空间来确定它的大小。
zh_tw: SwiftUI [顯示區](doc://com.apple.documentation/documentation/swiftui/view)會根據其[容器](glossary://container)顯示區提供的空間來決定其大小。

source: Different views have different space requirements. Not all views take up the same amount of space. Time for an experiment! Add the following code into the `HStack`:
de: Die verschiedenen Ansichten haben jeweils andere Anforderungen und benötigen daher unterschiedlich viel Platz. Also ist es Zeit für ein Experiment! Füge den folgenden Code in `HStack` ein:
es: Las distintas vistas tienen diferentes requisitos de espacio. No todas las vistas ocupan la misma cantidad de espacio. ¡Es el momento de experimentar! Añade el código siguiente al contenedor `HStack`:
es_419: Las distintas visualizaciones tienen distintos requisitos de espacios. No todas las visualizaciones toman la misma cantidad de espacio. ¡Es hora de hacer un experimento! Agrega el siguiente código a la `HStack`:
fr: Des vues différentes ont des exigences d’espace différentes. Toutes les vues ne prennent pas le même espace. Il est temps de faire une expérience ! Ajoute le code suivant dans la `HStack` :
it: Le varie viste hanno requisiti di spazio diversi. Non tutte le viste occupano la stessa quantità di spazio. È il momento di fare un esperimento. Aggiungi il seguente codice a `HStack`:
nl: Verschillende weergaven hebben verschillende ruimtevereisten. Niet alle weergaven nemen dezelfde hoeveelheid ruimte in beslag. Tijd voor een experiment! Voeg de volgende code toe aan de `HStack`:
pt: Diferentes visualizações têm diferentes requisitos de espaço. Nem todas as visualizações ocupam o mesmo espaço. Hora de uma experiência! Adicione o seguinte código ao `HStack`:
sv: Olika vyer har olika utrymmeskrav. Alla vyer tar inte lika stor plats. Dags för ett experiment! Lägg till följande kod inuti `HStack`:
th: มุมมองต่างๆ มีข้อกำหนดด้านพื้นที่ที่แตกต่างกัน ไม่ใช่ทุกมุมมองที่ใช้พื้นที่เท่ากัน ถึงเวลาทำการทดลองแล้ว! เพิ่มโค้ดต่อไปนี้ไปยัง `HStack`:
tr: Farklı görüntülerin farklı alan gereksinimleri vardır. Her görüntü aynı büyüklükte yer kaplamaz. Deneme zamanı! Aşağıdaki kodu `HStack`’e ekle:
zh_cn: 不同视图所需的空间也不同。并非所有视图都会占用相同的空间。是时候试验一下了！在 `HStack` 中添加以下代码：
zh_tw: 不同的顯示區有不同的空間需求。並非所有顯示區都佔用相同大小的空間。是時候做個實驗了！將以下程式碼加入到 `HStack` 中：

source: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("I’m squished") } Rectangle()
de: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Ich bin platt") } Rectangle()
es: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Estoy aplastada") } Rectangle()
es_419: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Estoy aplastada") } Rectangle()
fr: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Je suis écrabouillée") } Rectangle()
it: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Sono schiacciata") } Rectangle()
nl: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Ik ben geplet") } Rectangle()
pt: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Estou espremida") } Rectangle()
sv: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Jag blir klämd") } Rectangle()
th: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("ฉันถูกบีบ") } Rectangle()
tr: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("Ezildim") } Rectangle()
zh_cn: //#-learning-code-snippet(3.viewSizing) VStack { Image(systemName: "ladybug") Text("我被压扁了") } Rectangle()

source: Notice how your `Text` view and ladybug are squished? No matter how big you make the preview, the `Text` and `Image` views take up exactly the amount of space they need, but the rectangle fills in the rest of the space in the `HStack`.
de: Ist dir aufgefallen, wie deine `Text`-Ansicht und dein Marienkäfer zusammengedrückt werden? Egal, wie groß du die Vorschau machst – die `Text`- und `Image`-Ansicht nehmen exakt nur so viel Platz ein, wie sie benötigen, aber das Rechteck füllt den restlichen Raum in `HStack`.
es: ¿Te parece que la vista `Text` y la mariquita están aplastados? Sin importar lo grande que hagas la previsualización, las vistas `Text` e `Image` ocupan exactamente la cantidad de espacio que necesitan, pero el rectángulo rellena el resto de espacio en el contenedor `HStack`.
es_419: ¿Observas cómo tu visualización `Text` y la catarina están aplastadas? No importa cuánto agrandes la vista previa, las visualizaciones `Text` e `Image` ocupan exactamente la misma cantidad de espacio, pero el rectángulo rellena el resto del espacio en la pila `HStack`.
fr: Tu vois comment la vue `Text` et la coccinelle sont compressées ? Quelle que soit la taille de l’aperçu, la vue `Text` et la vue `Image` occupent exactement l’espace dont elles ont besoin, mais le rectangle remplit le reste de l’espace de la `HStack`.
it: Vedi come la vista `Text` e la coccinella (ladybug) risultano schiacciati? Indipendentemente dalle dimensioni dell’anteprima, le viste `Text` e `Image` occupano esattamente lo spazio di cui hanno bisogno, ma il rettangolo riempie il resto dello spazio in `HStack`.
nl: Zie je hoe de `Text`-weergave en het lieveheersbeestje worden geplet? Hoe groot je de voorvertoning ook maakt, de `Text`- en `Image`-weergave nemen niet meer dan de benodigde ruimte in beslag, terwijl de rechthoek de rest van de ruimte in de `HStack` vult.
pt: Reparou como a visualização `Text` e a joaninha estão espremidos? Independentemente do quão grande a pré‑visualização seja, as visualizações `Text` e `Image` ocupam exatamente o espaço que precisam, mas o retângulo preenche o restante do espaço no `HStack`.
sv: Märker du hur `Text`-vyn och nyckelpigan kläms ihop? Oavsett hur stor du gör förhandsvisningen kommer `Text`- och `Image`-vyerna att ta upp exakt det utrymme de behöver, men rektangeln fyller i resten av utrymmet i `HStack`.
th: สังเกตไหมว่ามุมมอง `Text` และเต่าทองถูกบีบ ไม่ว่าคุณจะทำให้การแสดงตัวอย่างมีขนาดใหญ่เท่าใด มุมมอง `Text` และ `Image` จะใช้ปริมาณพื้นที่ที่จำเป็นเท่านั้น แต่สี่เหลี่ยมจะเติมเต็มพื้นที่ที่เหลือใน `HStack`
tr: `Text` görüntünün ve uğur böceğinin nasıl ezildiğine dikkat ettin mi? Önizlemeyi ne kadar büyük yaparsan yap `Text` ve `Image` görüntüleri tam ihtiyaç duydukları kadar alanı kaplar ama dikdörtgen `HStack`’te kalan yeri doldurur.
zh_cn: 留意到了 `Text`（文本）视图和瓢虫是如何被压扁的吗？无论预览有多大，`Text` 和 `Image`（图像）视图会正好占用它们所需的空间大小，但矩形会填满 `HStack` 中的剩余空间。
zh_tw: 注意到你的 `Text` 顯示區和瓢蟲是如何被擠壓的嗎？無論你製作多大的預覽，`Text` 和 `Image` 顯示區都完全佔用了它們所需的空間大小，但矩形填滿了 `HStack` 中的剩餘空間。

source: Time for another experiment. Add this `Rectangle()` above the `VStack` in the `HStack`:
de: Zeit für ein weiteres Experiment. Füge in `HStack` die Instanz `Rectangle()` über `VStack` ein:
es: ¡Otro experimento! Añade este `Rectangle()` encima del contenedor `VStack` incluido en el `HStack`:
es_419: ¡Es hora de hacer otro experimento! Agrega este `Rectangle()` arriba de `VStack` en `HStack`:
fr: Faisons une autre expérience. Ajoute ce `Rectangle()` au-dessus de la `VStack` dans la `HStack`:
it: È il momento di un nuovo esperimento! Aggiungi `Rectangle()` sopra `VStack` in `HStack`:
nl: Tijd voor nog een experiment. Voeg deze `Rectangle()` toe boven de `VStack` in de `HStack`:
pt: Hora de outra experiência. Adicione este `Rectangle()` acima do `VStack` no `HStack`:
sv: Det är dags för ett till experiment. Lägg till denna `Rectangle()` ovanför `VStack` i `HStack`:
th: ถึงเวลาทำอีกหนึ่งการทดลอง เพิ่ม `Rectangle()` นี้เหนือ `VStack` ใน `HStack`:
tr: Başka bir deneme zamanı. Bu `Rectangle()`’ı `HStack`’in içindeki `VStack`’in üst tarafına ekle:
zh_cn: 是时候进行另一个试验了。将这个 `Rectangle()` 添加到 `HStack` 中的 `VStack` 上方：
zh_tw: 是時候進行另一個實驗了。在 `HStack` 中的 `VStack` 上方加入這個 `Rectangle()`：
