Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: Try adding it yourself, using the following hint if you get stuck:
de: Versuche, ihn selbst hinzuzufügen. Wenn du nicht weiterkommst, kannst du diesen Tipp verwenden:
es: Intenta añadirla sin ayuda; si llegas a un punto muerto, aquí tienes una pista:
es_419: Intenta agregarlo por tu cuenta, y usa la siguiente pista si tienes problemas:
fr: Essaie de l’ajouter par toi-même, en utilisant l’astuce suivante si tu es bloqué :
it: Prova ad aggiungerlo tu, utilizzando il seguente suggerimento se ti blocchi nel tragitto:
nl: Probeer dit zelf te doen. Gebruik de volgende tip als je vast komt te zitten:
pt: Tente adicioná-lo você mesmo e use a dica a seguir caso não consiga sair do lugar:
sv: Försök att lägga till den på egen hand, men använd följande tips om du fastnar:
th: ลองเพิ่มปุ่มปรับค่าด้วยตัวเองโดยใช้คำใบ้ต่อไปนี้หากคุณไปต่อไม่ได้:
tr: Kendin eklemeyi dene, sıkışırsan aşağıdaki ipucunu kullan:
zh_cn: 试一下自己添加，遇到困难时可使用以下提示：
zh_tw: 嘗試自己加入，如果遇到困難，請使用以下提示：

source: Awesome! Now try adding an orange circle to the bottom-left of the banner to match the image.
de: Fantastisch! Versuche jetzt, den orangefarbenen Kreis links unten zum Banner hinzuzufügen, sodass das Banner mit dem Bild übereinstimmt.
es: Genial; ahora intenta añadir un círculo naranja a la parte inferior izquierda del rótulo para que sea igual que la imagen.
es_419: Genial, ahora intenta agregar un círculo naranja en la parte inferior izquierda del banner para que coincida con la imagen.
fr: Super ! Maintenant essaie d’ajouter un cercle orange en bas à gauche de la bannière pour correspondre à l’image.
it: Fantastico, ora prova ad aggiungere il cerchio arancione in basso a sinistra nel banner in modo che corrisponda all’immagine.
nl: Super! Voeg nu een oranje cirkel in de linkerbenedenhoek van de strook toe, net als op de afbeelding.
pt: Ótimo! Agora tente adicionar um círculo laranja na parte inferior esquerda do banner para ficar igual à imagem.
sv: Strålande! Försök nu att lägga till en orange cirkel i det nedre vänstra hörnet av banderollen för att matcha bilden.
th: เจ๋งไปเลย! ตอนนี้ให้ลองเพิ่มวงกลมสีส้มที่ด้านซ้ายล่างสุดของป้ายประกาศเพื่อให้เหมือนกับภาพ
tr: Harika! Şimdi manşetin sol alt tarafına görüntüyle eşleşecek turuncu bir daire eklemeyi dene.
zh_cn: 太棒了！现在尝试在横幅左下方添加橙色圆形来匹配图像。
zh_tw: 太棒了！現在嘗試在橫幅左下方加入橙色圓形以符合影像。

source: Use the color, `Color.bannerOrange`.
de: Verwende die Farbe: `Color.bannerOrange`.
es: Utilizar el color, `Color.bannerOrange`.
es_419: Usa el color `Color.bannerOrange`.
fr: Utilise la couleur, `Color.bannerOrange`.
it: Utilizza il colore `Color.bannerOrange`.
nl: Gebruik de kleur `Color.bannerOrange`.
pt: Use a cor, `Color.bannerOrange`.
sv: Använd färgen `Color.bannerOrange`.
th: ใช้สี `Color.bannerOrange`
tr: `Color.bannerOrange` rengini kullan.
zh_cn: 使用颜色 `Color.bannerOrange`。
zh_tw: 使用顏色 `Color.bannerOrange`。

source: If you need a hint, the solution is in the next step.
de: Wenn du einen Tipp brauchst, findest du die Lösung im nächsten Schritt.
es: Si necesitas ayuda, la solución está en el próximo paso.
es_419: Si necesitas una pista, encontrarás la solución en el siguiente paso.
fr: Si tu as besoin d’une astuce, la solution se trouve à l’étape suivante.
it: Se hai bisogno di un suggerimento, la soluzione si trova al passaggio successivo.
nl: Als je een tip nodig hebt, kun je de oplossing in de volgende stap vinden.
pt: Se precisar de uma dica, a solução está no próximo passo.
sv: Om du behöver ett tips finns lösningen i nästa steg.
th: ถ้าคุณต้องการคำใบ้ วิธีแก้ปัญหาอยู่ในขั้นตอนถัดไป
tr: İpucuna ihtiyacın varsa çözüm bir sonraki adımda.
zh_cn: 如果需要提示，解决方案就在下一步。
zh_tw: 如果你需要提示，解決方案就在下一個步驟中。

source: To add the orange circle, create a `Circle` view and use the `.frame(width:)`, `.foregroundColor(_:)`, and `.offset(x:y:)` modifiers to adjust its size, position, and color.
de: Erstelle zum Hinzufügen des orangefarbenen Kreises eine `Circle`-Ansicht und verwende die `.frame(width:)`-, `.foregroundColor(_:)`- und `.offset(x:y:)`-Modifikatoren, um die Größe, Position und Farbe anzupassen.
es: Para añadir el círculo naranja, crea una vista `Circle` y usa los modificadores `.frame(width:)`, `.foregroundColor(_:)` y `.offset(x:y:)` para ajustar su tamaño, posición y color.
es_419: Para agregar el círculo naranja, crea una visualización `Circle` y usa los modificadores `.frame(width:)`, `.foregroundColor(_:)` y `.offset(x:y:)` para ajustar su tamaño, posición y color.
fr: Pour ajouter le cercle orange, crée une vue `Circle` et utilise les modificateurs `.frame(width:)`, `.foregroundColor(_:)` et `.offset(x:y:)` pour ajuster sa taille, sa position et sa couleur.
it: Per aggiungere il cerchio arancione, crea una vista `Circle` e utilizza i modificatori `.frame(width:)`, `.foregroundColor(_:)` e `.offset(x:y:)` per regolarne le dimensioni, la posizione e il colore.
nl: Om de oranje cirkel toe te voegen, maak je een `Circle`-weergave aan en gebruik je de modifiers `.frame(width:)`, `.foregroundColor(_:)` en `.offset(x:y:)` om de grootte, positie en kleur ervan aan te passen.
pt: Para adicionar o círculo laranja, crie uma visualização `Circle` e use os modificadores `.frame(width:)`, `.foregroundColor(_:)` e `.offset(x:y:)` para ajustar o tamanho, posição e cor.
sv: Lägg till den orangea cirkeln genom att skapa en`Circle`-vy och använda modifierarna `.frame(width:)`, `.foregroundColor(_:)` och `.offset(x:y:)` till att justera dess storlek, placering och färg.
th: ในการเพิ่มวงกลมสีส้ม ให้สร้างมุมมอง `Circle` แล้วใช้ปุ่มปรับค่า `.frame(width:)`, `.foregroundColor(_:)` และ `.offset(x:y:)` เพื่อปรับขนาด ตำแหน่ง และสีของวงกลม
tr: Turuncu daireyi eklemek için bir `Circle` görüntüsü yarat ve büyüklüğünü, konumunu ve rengini ayarlamak için `.frame(width:)`, `.foregroundColor(_:)` ve `.offset(x:y:)` niteleyicilerini kullan.
zh_cn: 如果要添加橙色圆形，你可以创建一个 `Circle` 视图，然后使用 `.frame(width:)`、`.foregroundColor(_:)` 和 `.offset(x:y:)` 修饰符来调整它的大小、位置和颜色。
zh_tw: 若要加入橙色圓圈，請製作一個 `Circle` 顯示區，並使用 `.frame(width:)`、`.foregroundColor(_:)` 和 `.offset(x:y:)` 修飾符來調整其大小、位置和顏色。

source: If you still need help, here’s the code for the circle:
de: Du benötigst trotzdem noch Hilfe? Hier ist der Code für den Kreis:
es: Si necesitas ayuda, este es el código del círculo:
es_419: Si aún necesitas ayuda, aquí tienes el código para el círculo:
fr: Si tu as besoin d’une aide supplémentaire, voici le code pour le cercle :
it: Se hai ancora bisogno di aiuto, ecco il codice del cerchio:
nl: Als het nog steeds niet helemaal lukt, kun je hier de code voor de cirkel bekijken:
pt: Se você ainda precisar de ajuda, este é o código do círculo:
sv: Om du fortfarande behöver hjälp finns koden för cirkeln här:
th: ถ้าคุณยังต้องการความช่วยเหลือ นี่คือโค้ดสำหรับวงกลม:
tr: Hâlâ yardıma ihtiyacın varsa işte dairenin kodu:
zh_cn: 如果仍然需要帮助，这是圆形的代码：
zh_tw: 如果你仍需要協助，這裡有圓圈的程式碼：

source: The left side of the banner looks great. Time to use those layout skills on the right side of the banner.
de: Die linke Seite des Banners sieht toll aus. Jetzt ist es an der Zeit, deine Layoutfähigkeiten für die rechte Seite des Banners einzusetzen.
es: ¡El lado izquierdo del rótulo está genial! Es el momento de usar esas habilidades de disposición en el lado derecho del rótulo.
es_419: La parte izquierda del banner se ve genial. Ahora es momento de usar tus habilidades de disposición para la parte derecha del banner.
fr: Le côté gauche de la bannière est superbe. Le moment est venu d’utiliser tes compétences en disposition pour le côté droit de la bannière.
it: Il lato sinistro del banner è perfetto. È giunto il momento di usare le tue capacità di configurazione del layout per il lato destro del banner.
nl: De linkerkant van de strook ziet er geweldig uit. Nu is het tijd om die lay-outvaardigheden op de rechterkant van de strook toe te passen.
pt: O lado esquerdo do banner está ótimo. É hora de usar as suas habilidades de layout no lado direito do banner.
sv: Den vänstra sidan av banderollen ser toppen ut. Det är dags att använda dina layoutfärdigheter på den högra sidan av banderollen.
th: ด้านซ้ายของป้ายประกาศดูดีมาก ถึงเวลาใช้ทักษะด้านเค้าโครงกับด้านขวาของป้ายประกาศแล้ว
tr: Manşetin sol tarafı harika görünüyor. Bu yerleşim becerilerini manşetin sağ tarafında kullanma zamanı.
zh_cn: 横幅的左侧看起来很棒。是时候将这些布局技能用在横幅的右侧了。
zh_tw: 橫幅的左側看起來很棒。是時候在橫幅右側使用這些佈局技巧了。

source: Right now, there’s only a large blue circle and a medium pink one on the right side. Add a spark of color by adding in the smaller orange circle.
de: Aktuell gibt es nur einen großen blauen und einen mittelgroßen pinkfarbenen Kreis auf der rechten Seite. Peppe das ganze mit mehr Farben auf, indem du den kleineren orangefarbenen Kreis hinzufügst.
es: Ahora mismo solo hay un gran círculo azul y otro mediano de color rosa en la parte derecha. Añade una pizca de color añadiendo el círculo naranja pequeño.
es_419: Ahora mismo sólo hay un círculo azul grande y uno rosa mediano en el lado derecho. Agrega el círculo naranja más pequeño para dar una chispa de color.
fr: Pour le moment, il y a seulement un grand cercle bleu et un petit rose moyen à droite. Mets une touche de couleur en ajoutant le plus petit cercle orange.
it: Al momento sono presenti solo un cerchio blu grande e uno rosa medio sul lato destro. Dai un tocco di colore aggiungendo il cerchio arancione più piccolo.
nl: Er zijn nu alleen een grote blauwe cirkel en een middelgrote roze cirkel aan de rechterkant. Voeg wat extra kleur toe door de kleinere oranje cirkel toe te voegen.
pt: Por enquanto há apenas um círculo azul grande e um círculo rosa médio no lado direito. Adicione o círculo laranja pequeno para dar um pouco de cor.
sv: Just nu finns det bara en stor blå och en medelstor rosa cirkel på den högra sidan. Lägg till en färgklick genom att lägga till den mindre orangea cirkeln.
th: ตอนนี้คุณมีเพียงวงกลมสีน้ำเงินขนาดใหญ่และวงกลมสีชมพูขนาดกลางทางด้านขวาเท่านั้น ให้เพิ่มประกายสีสันโดยเพิ่มวงกลมสีส้มขนาดเล็กกว่า
tr: Şu an sağ tarafta yalnızca büyük bir mavi daire ve orta büyüklükte bir pembe daire var. Daha küçük turuncu daireyi ekleyerek bir parça renk kat.
zh_cn: 现在，右侧只有一个大的蓝色圆形和一个中等的粉色圆形。加入小一点的橙色圆形来增添一些色彩。
zh_tw: 現在右側只有一個大的藍色圓圈和一個中的粉紅色圓圈。請加入較小的橙色圓圈來加入顏色的火花。

source: On the left side of the banner, you used a `ZStack` to place the circle views on tops of each other. Try the same approach here.
de: Auf der linken Seite des Banners hast du `ZStack` verwendet, um die Kreisansichten übereinander zu platzieren. Verwende den gleichen Ansatz auch hier.
es: En el lado izquierdo del rótulo, usaste un contenedor `ZStack` para poner las vistas de círculo encima de las otras. Prueba aquí este mismo enfoque.
es_419: En la parte izquierda del banner, usaste una `ZStack` para colocar las visualizaciones de los círculos una encima de la otra. Intenta usar el mismo método aquí.
fr: Sur le côté gauche de la bannière, tu as utilisé une `ZStack` pour placer les vues de cercle les unes sur les autres. Essaie d’utiliser la même approche ici.
it: Sul lato sinistro del banner, è stato utilizzato `ZStack` per posizionare le viste circolari una sopra l’altra. Prova con lo stesso approccio qui.
nl: Voor de linkerkant van de strook heb je een `ZStack` gebruikt om de cirkelweergaven boven op elkaar te plaatsen. Gebruik hier dezelfde benadering.
pt: Do lado esquerdo do banner, você usou um `ZStack` para colocar as visualizações de círculo uma em cima da outra. Tente a mesma abordagem aqui.
sv: På vänstra sidan av banderollen använde du en `ZStack` till att placera cirkelvyerna ovanpå varandra. Försök att göra samma sak här.
th: ทางด้านซ้ายของป้ายประกาศ คุณได้ใช้ `ZStack` เพื่อวางมุมมองวงกลมแบบซ้อนทับกัน ลองใช้วิธีเดียวกันในส่วนนี้
tr: Manşetin sol tarafında, daire görüntülerini üst üste yerleştirmek için bir `ZStack` kullandın. Burada da aynı yaklaşımı dene.
zh_cn: 在横幅的左侧，你使用了 `ZStack` 来上下叠放圆形视图。在这里试一下同样的方法。
zh_tw: 在橫幅的左側，你使用 `ZStack` 將圓形顯示區放在彼此的上方。請在這裡嘗試相同的方法。

source: Here is a hint for adding the orange circle view:
de: Hier ist ein kleiner Tipp, wie du die Ansicht für den orangefarbenen Kreis hinzufügst:
es: Aquí tienes una pista para añadir la vista del círculo naranja:
es_419: Aquí tienes una pista para agregar la visualización del círculo naranja:
fr: Voici une astuce pour l’ajout de la vue de cercle orange :
it: Ecco un suggerimento per aggiungere elementi alla vista con il cerchio arancione:
nl: Hier volgt een tip voor het toevoegen van de oranje cirkelweergave:
pt: Confira esta dica para adicionar a visualização do círculo laranja:
sv: Här är ett tips om hur du lägger till den orangea cirkelvyn:
th: นี่คือคำใบ้สำหรับการเพิ่มมุมมองวงกลมสีส้ม:
tr: Turuncu daire görüntüsünü ekleme ipucu işte burada:
zh_cn: 这是添加橙色圆形视图的提示：
zh_tw: 以下為加入橙色圓圈顯示區的提示：

source: Perfect! Your design now matches the mock-up.
de: Perfekt! Jetzt stimmt dein Design mit dem Modell überein.
es: ¡Perfecto! El diseño es igual que el boceto.
es_419: ¡Perfecto! Tu diseño ahora coincide con el modelo.
fr: Parfait ! Ta conception correspond à présent à la maquette.
it: Perfetto! Il design ora corrisponde al modello.
nl: Perfect! Je ontwerp komt nu overeen met het model.
pt: Perfeito! O design está igual ao modelo agora.
sv: Perfekt! Nu matchar din design modellen.
th: สมบูรณ์แบบ! ตอนนี้การออกแบบของคุณก็ตรงกับตัวอย่างจำลองแล้ว
tr: Mükemmel! Artık tasarımın modelle eşleşiyor.
zh_cn: 完美！你的设计现在与模型完全一致。
zh_tw: 完美！現在你的設計完全符合模型了。

source: Next, you’ll use your layout skills to modify the sleep tracker design.
de: Als Nächstes verwendest du deine Layoutfähigkeiten, um das Design des Schlaftrackers anzupassen.
es: Y ahora vamos a usar tus habilidades de disposición para modificar el diseño de la utilidad de seguimiento del sueño.
es_419: A continuación, usarás tus habilidades de disposición para modificar el diseño del monitor de sueño.
fr: Ensuite, tu utiliseras tes compétences en disposition pour modifier la conception du moniteur de sommeil.
it: Successivamente, utilizzerai le tue abilità di configurazione del layout per modificare il design del tracker del sonno.
nl: Nu ga je je lay-outvaardigheden gebruiken om het ontwerp van de slaaptracker aan te passen.
pt: A seguir, você usará as suas habilidades de layout para modificar o design do rastreador de sono.
sv: Härnäst använder du dina layoutfärdigheter till att ändra sömnspårarens design.
th: ถัดไป คุณจะได้ใช้ทักษะด้านเค้าโครงของคุณเพื่อแก้ไขการออกแบบตัวติดตามการนอนหลับ
tr: Sırada, uyku izleyici tasarımını değiştirmek için yerleşim becerilerini kullanmak var.
zh_cn: 下一步，你将使用布局技能来修改睡眠跟踪器的设计。
zh_tw: 接下來，你將使用你的佈局技巧來修改睡眠追蹤器的設計。

# GuideBook..Guide0..StepMy Journal..TaskGroup1..Tasksleeptracker1..title
source: Make your own sleep tracker view
de: Deine eigene Schlaftracker-Ansicht erstellen
es: Crea tu propia vista del módulo de seguimiento de sueño
es_419: Crear tu propia visualización del monitor de sueño
fr: Créer ta propre vue de moniteur de sommeil
it: Creare la vista del tracker del sonno
nl: Zelf een slaaptrackerweergave aanmaken
pt: Faça seu próprio rastreador de sono
sv: Gör en egen sömnspårarvy
th: สร้างมุมมองตัวติดตามการนอนหลับของคุณเอง
tr: Kendi uyku izleyici görüntünü oluşturma
zh_cn: 创建专属的睡眠跟踪器视图
zh_tw: 製作你自己的睡眠追蹤器顯示區

source: For your next challenge, you’ll create your own sleep tracker view.
de: In deiner nächsten Herausforderung erstellst du deine eigene Schlaftracker-Ansicht.
es: En el reto siguiente crearás tu propia vista de seguimiento del sueño.
es_419: En el siguiente reto, crearás tu propia visualización de monitor de sueño.
fr: Pour ton prochain défi, tu créeras ta propre vue de moniteur de sommeil.
it: Per la prossima attività, creerai la tua vista del tracker del sonno.
nl: In de volgende uitdaging ga je je eigen slaaptrackerweergave aanmaken.
pt: Como próximo desafio, você criará sua própria visualização do rastreador de sono.
sv: I nästa utmaning skapar du en egen sömnspårarvy.
th: สำหรับคำท้าถัดไปของคุณ คุณจะได้สร้างตัวติดตามการนอนหลับของคุณเอง
tr: Bir sonraki meydan okumanda kendi uyku izleyici görüntünü yaratacaksın.
zh_cn: 下一个挑战，你将创建专属的睡眠跟踪器视图。
zh_tw: 下一項挑戰就是製作你自己的睡眠追蹤器顯示區。

source: Before you begin, run the app preview and add a new journal entry with a full-sized sleep tracker. Notice that the button to add a half-sized sleep tracker is disabled.
de: Bevor du loslegst, starte die App-Vorschau und füge einen neuen Tagebucheintrag mit einem Schlaftracker in voller Größe hinzu. Beachte, dass die Taste zum Hinzufügen eines Schlaftrackers in halber Größe deaktiviert ist.
es: Antes de empezar, ejecuta la previsualización de la app y añade una nueva entrada de diario con una función de seguimiento del sueño a tamaño completo. Fíjate en que está desactivado el botón de añadir un módulo de medio tamaño.
es_419: Antes de empezar, abre la previsualización y agrega una nueva entrada en el diario con un monitor de sueño de tamaño completo. Observa que el botón para agregar un monitor de tamaño medio está desactivado.
fr: Avant de commencer, exécute l’aperçu de l’app et ajoute une nouvelle entrée de journal avec un moniteur de sommeil en plein format. Tu remarqueras que le bouton permettant d’ajouter un moniteur de sommeil en demi-format est désactivé.
it: Prima di iniziare, esegui l’anteprima dell’app e aggiungi una nuova voce del diario con il tracker del sonno di dimensioni complete. Ricorda che il pulsante per aggiungere tracker del sonno di dimensioni dimezzate è disabilitato.
nl: Voer voordat je begint de appvoorvertoning uit en voeg een nieuwe dagboeknotitie met een slaaptracker op hele grootte toe. Zoals je ziet, is de knop voor het toevoegen van de slaaptracker op halve kaartgrootte uitgeschakeld.
pt: Antes de começar, execute a pré‑visualização do app e adicione uma nova entrada de diário com um rastreador de sono de tamanho inteiro. Repare que o botão para adicionar um rastreador de sono de metade do tamanho está desativado.
sv: Innan du börjar ska du köra appförhandsvisningen och lägga till en ny journalpost med en sömnspårare i full storlek. Lägg märke till att knappen för att lägga till en sömnspårare i halv storlek är avaktiverad.
th: ก่อนที่คุณจะเริ่ม ให้รันการแสดงตัวอย่างแอปแล้วเพิ่มรายการบันทึกประจำวันรายการใหม่ที่มีตัวติดตามการนอนหลับขนาดเต็ม สังเกตว่าปุ่มสำหรับเพิ่มตัวติดตามการนอนหลับขนาดครึ่งหนึ่งปิดใช้งานอยู่
tr: Başlamadan önce uygulama önizlemesini çalıştır ve tam boyutta bir uyku izleyici ile yeni bir günlük girişi ekle. Yarım boyutta bir uyku izleyici ekleme düğmesinin etkisizleştirilmiş olduğuna dikkat et.
zh_cn: 开始之前，运行 App 预览并新增一个日记条目，包含一个完整大小的睡眠跟踪器。注意，添加一半大小的睡眠跟踪器的按钮已停用。
zh_tw: 在開始之前，先執行 App 預覽並加入一個附帶完整大小睡眠追蹤器的新日記項目。請注意，用來加入一半大小睡眠追蹤器的按鈕已經停用。

source: The designer on your team has given you design specifications for what they want the half view sleep tracker card to look like. As the software engineer, it’s time for you to create it.
de: Die Designabteilung hat dir Designvorgaben dafür gegeben, wie die Schlaftracker-Ansicht in halber Größe aussehen soll. Als Software-Engineer:in musst du dies nun umsetzen.
es: El equipo de diseño ha dado las especificaciones del aspecto que quieren que tenga la tarjeta de medio tamaño del módulo de seguimiento del sueño. Como quien está a cargo del software eres tú, ¡ahora es tu momento de crearlo!
es_419: El diseñador de tu equipo te ha dado las especificaciones de diseño en las que indica cómo quiere que se vea la media visualización del monitor de sueño. ¡Es hora de crearla con tus conocimientos de ingeniería de software!
fr: Le concepteur de ton équipe t’a donné des spécifications de conception pour l’aspect souhaité de la carte de moniteur de sommeil en demi-vue. En tant qu’ingénieur logiciel, c’est à toi de la créer.
it: Il designer del team ti ha fornito le specifiche di design per l’aspetto della scheda del tracker del sonno con vista dimezzata. Siccome sei un ingegnere informatico, è il momento di crearla.
nl: De ontwerper in je team heeft je de specificaties voor het ontwerp van de halfgrote slaaptrackerkaart gegeven. Als software-engineer is het jouw taak om het ontwerp te implementeren.
pt: A pessoa responsável pelo design na sua equipe forneceu especificações de como o design da meia visualização do cartão do rastreador de sono deve ser. Como você está cuidando da engenharia de software, é hora de começar a criá‑lo.
sv: Designern i teamet har gett dig designspecifikationerna som talar om hur sömnspårarkortet i halv vy ska se ut. Som programvaruutvecklare är det dags för dig att skapa det.
th: นักออกแบบในทีมของคุณได้ให้ข้อกำหนดการออกแบบกับคุณมาว่าพวกเขาต้องการให้บัตรตัวติดตามการนอนหลับแบบครึ่งมุมมองมีลักษณะอย่างไร ในฐานะวิศวกรซอฟต์แวร์ คุณจะต้องสร้างมุมมองนั้น
tr: Ekibindeki tasarımcı, görüntünün yarısında uyku izleyici kartının nasıl görüneceği ile ilgili tasarım özelliklerini sana verdi. Bir yazılım mühendisi olarak bu yaratma sırası sende.
zh_cn: 团队中的设计师已经为你提供了设计规格，里面说明了他们想要的睡眠跟踪器卡片（一半视图）的效果。作为软件工程师，现在该由你来创建它了。
zh_tw: 你團隊中的設計者已經為半張卡片顯示區睡眠追蹤器的外觀提供了他們想要的設計規格。你身為一個軟體工程師，是時候來開始製作了。

source: Looking at the `SleepViewHalf` preview, the top-half of the view has the design’s mock-up, the bottom-half is what you’ll create!
de: Sieh dir die `SleepViewHalf`-Vorschau an. Die obere Hälfte der Ansicht enthält das Designmodell. Die untere Hälfte ist das, was du erstellen musst!
es: Mirando la previsualización `SleepViewHalf`, la mitad superior de la vista tiene el boceto del diseño, mientras que la mitad de abajo es lo que vas a crear.
es_419: Observa la vista previa `SleepViewHalf`. La mitad superior de la visualización ya tiene el modelo de diseño. Lo que debes hacer es crear la mitad inferior.
fr: En regardant lʼaperçu de `SleepViewHalf`, on voit que la moitié supérieure de la vue possède la conception de la maquette et la partie inférieure est de ta création !
it: Guardando l’anteprima `SleepViewHalf`, la metà superiore della vista contiene il modello del progetto, mentre nella metà inferiore si trova ciò che creerai.
nl: Bekijk de voorvertoning van `SleepViewHalf`. De bovenste helft van de weergave bevat het model. De onderste helft moet jij maken!
pt: Observando a pré‑visualização de `SleepViewHalf`, a metade superior da visualização tem o modelo do design e a metade inferior é o que você vai criar!
sv: När du tittar på förhandsvisningen av `SleepViewHalf` består den övre halvan av designerns modell och den nedre halvan av det du skapar!
th: ดูที่การแสดงตัวอย่าง `SleepViewHalf` ครึ่งบนของมุมมองมีตัวอย่างจำลองของการออกแบบ ส่วนครึ่งล่างมีสิ่งที่คุณจะสร้าง!
tr: `SleepViewHalf` önizlemesine bakarsan görüntünün üst yarısında tasarımın modeli var, alt yarısında ise senin yaratacağın görüntü olacak!
zh_cn: 看一下 `SleepViewHalf`（睡眠视图一半）预览，视图的上半部分有设计的模型，下半部分将由你来创建！
zh_tw: 看一下 `SleepViewHalf` 預覽，顯示區的上半部是設計的模型，下半部是你要製作的！
