Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: To add `MoodViewFull` to the app, you’ll add some logic to display `MoodViewFull` when your someone selects the full-card mood tracker.
de: Zum Hinzufügen von `MoodViewFull` (vollständige Stimmungsansicht) zur App fügst du etwas Logik ein, damit `MoodViewFull` angezeigt wird, wenn jemand den Stimmungstracker in ganzer Kartengröße auswählt.
es: Si quieres añadir a la app una `MoodViewFull` (vista completa de estado de ánimo), tienes que añadir cierta lógica para mostrar `MoodViewFull` cuando alguien seleccione la tarjeta completa de seguimiento de estado de ánimo tarjeta completa.
es_419: Para agregar `MoodViewFull` a la app, debes agregar cierta lógica para que se muestre `MoodViewFull` cuando alguien seleccione el monitor de estado de ánimo de la carta completa.
fr: Pour ajouter `MoodViewFull` à l’app, tu ajouteras de la logique pour afficher `MoodViewFull` quand quelqu’un sélectionne le moniteur d’humeur « carte entière ».
it: Per aggiungere `MoodViewFull` all’app, aggiungerai una logica per visualizzare `MoodViewFull` quando qualcuno seleziona il tracker dell’umore a scheda intera.
nl: Om `MoodViewFull` aan de app toe te voegen, moet je logica toevoegen om `MoodViewFull` weer te geven wanneer iemand de slaaptracker in de hele kaart selecteert.
pt: Para adicionar `MoodViewFull` ao app, você adicionará uma lógica para mostrar `MoodViewFull` quando uma pessoa selecionar o cartão inteiro do rastreador de humor.
sv: För att kunna lägga till `MoodViewFull` i appen måste du lägga till lite logik som visar `MoodViewFull` när någon väljer humörspåraren i helkortsformat.
th: ในการเพิ่ม `MoodViewFull` ไปยังแอป คุณจะต้องเพิ่มตรรกะบางอย่างเพื่อแสดง `MoodViewFull` เมื่อใครบางคนของคุณเลือกตัวติดตามอารมณ์แบบเต็มบัตร
tr: Uygulamaya `MoodViewFull` eklemek istiyorsan biri tam kart ruh hâli izleyiciyi seçtiğinde `MoodViewFull`’u görüntülemek için biraz mantık eklemen gerekiyor.
zh_cn: 如果要将 `MoodViewFull`（心情视图完整）添加到 App 中，你需要添加一些逻辑，来在用户选择完整卡片大小的心情跟踪器时显示 `MoodViewFull`。
zh_tw: 若要將 `MoodViewFull` 加入 App，你要加入一些邏輯來在其他人選擇整張卡片的心情追蹤器時顯示 `MoodViewFull`。

source: Remove the highlighted code and replace it with the code snippet below:
de: Entferne den hervorgehobenen Code und ersetze ihn durch den unten aufgeführten Codeabschnitt:
es: Elimina el código resaltado y sustitúyelo por el fragmento de código siguiente:
es_419: Elimina el código resaltado y reemplázalo con el fragmento de código de abajo:
fr: Supprime le code en surbrillance et remplace-le par l’extrait de code ci-dessous :
it: Rimuovi il codice evidenziato e sostituiscilo con il frammento di codice sottostante:
nl: Verwijder de gemarkeerde code en vervang deze door het onderstaande codefragment:
pt: Remova o código destacado e substitua‑o pelo fragmento de código abaixo:
sv: Ta bort den markerade koden och ersätt den med kodsnutten nedan:
th: เอาโค้ดที่ไฮไลท์ออกและแทนที่ด้วยส่วนย่อยของโค้ดด้านล่าง:
tr: Vurgulanan kodu sil ve aşağıdaki kod parçacığı ile değiştir:
zh_cn: 移除高亮标记的代码，然后替换为下方的代码片段：
zh_tw: 移除反白的程式碼，並且用下方的程式碼片段來取代：

source: To enable the button to add the full-card mood tracker, set `disableMoodViewFull` to `false`:
de: Um es der Taste zu ermöglichen, den Stimmungstracker in ganzer Kartengröße hinzuzufügen, lege für `disableMoodViewFull` (ganze Stimmungsansicht deaktivieren) den Wert `false` fest:
es: Para activar el botón que añade el seguimiento del estado de ánimo a tarjeta completa, define `disableMoodViewFull` como `false`:
es_419: Para mostrar el botón para agregar el monitor de estado de ánimo de carta completa, configura `disableMoodViewFull` como `false`:
fr: Pour activer le bouton permettant d’ajouter le moniteur d’humeur « carte entière », définis `disableMoodViewFull` sur `false` :
it: Per abilitare il pulsante per aggiungere il tracker dell’umore a scheda intera, imposta `disableMoodViewFull` su `false`:
nl: Stel `disableMoodViewFull` in op `false` om de knop in te schakelen waarmee de slaaptracker in de hele kaart wordt toegevoegd:
pt: Para ativar o botão para adicionar o cartão inteiro do rastreador de humor, defina `disableMoodViewFull` como `false`:
sv: Aktivera knappen som lägger till humörspåraren i helkortsformat genom att ställa in `disableMoodViewFull` på `false`:
th: ในการเปิดใช้งานปุ่มเพื่อเพิ่มตัวติดตามอารมณ์แบบเต็มบัตร ให้ตั้งค่า `disableMoodViewFull` เป็น `false`:
tr: Tam kart ruh hâli izleyiciyi ekleme düğmesini etkinleştirmek için `disableMoodViewFull`’u `false` olarak ayarla:
zh_cn: 如果要启用按钮来添加完整卡片大小的心情跟踪器，你可以将 `disableMoodViewFull`（停用心情视图完整）设为 `false`：
zh_tw: 若要啟用按鈕來加入整張卡片的心情追蹤器，請將 `disableMoodViewFull` 設定為 `false`：

source: Now try adding a full-card mood tracker in the journal app. Do you see the view you just created?
de: Probiere nun, in der Tagebuch-App einen Stimmungstracker in ganzer Kartengröße hinzuzufügen. Siehst du die Ansicht, die du gerade erstellt hast?
es: Ahora trata de añadir un módulo de seguimiento del estado de ánimo a tamaño completo, ¿ves la vista que acabas de crear?
es_419: Ahora, intenta agregar un monitor de estado de ánimo de carta completa a la app de diario. ¿Puedes ver la visualización que acabas de crear?
fr: À présent, essaie d’ajouter un moniteur de sommeil d’une carte entière dans l’app de journal. Vois-tu la vue que tu viens de créer ?
it: Ora, prova ad aggiungere il tracker dell’umore a scheda intera nell’app diario. Riesci a vedere la vista che hai appena creato?
nl: Voeg nu een stemmingstracker in een hele kaart toe aan de dagboekapp. Zie je de weergave die je zojuist hebt aangemaakt?
pt: Agora tente adicionar um cartão inteiro do rastreador de humor no app de diário. Está vendo a visualização que você acabou de criar?
sv: Försök nu att lägga till ett fullt kort med humörspåraren i journalappen. Kan du se vyn som du precis skapade?
th: ตอนนี้ให้ลองเพิ่มตัวติดตามอารมณ์แบบเต็มบัตรลงในแอปบันทึกประจำวัน คุณเห็นมุมมองที่คุณเพิ่งสร้างหรือไม่
tr: Şimdi tam kart ruh hâli izleyiciyi günlük uygulamasına eklemeyi dene. Yarattığın görüntüyü görüyor musun?
zh_cn: 现在试试在日记 App 中添加一个完整卡片大小的心情跟踪器。你有看到刚刚创建的视图吗？
zh_tw: 現在嘗試在日記 App 中加入整張卡片的心情追蹤器。你看到剛剛製作的顯示區了嗎？

source: Wow! Your mood tracker looks great. Just what the designer wanted.
de: Wow! Dein Stimmungstracker sieht super aus. Genau wie es die Designabteilung wollte.
es: ¡Bien! Tu módulo de seguimiento del estado de ánimo ha quedado genial. Justo como quería el equipo de diseño.
es_419: ¡Increíble! Tu monitor de estado de ánimo se ve genial, justo como lo quería el diseñador.
fr: Ouah ! Ton moniteur d’humeur est superbe. Exactement comme le souhaitait le concepteur.
it: Wow! Il tracker dell’umore ha un aspetto fantastico, proprio come voleva il designer.
nl: Wauw! Je stemmingstracker ziet er geweldig uit! Precies zoals de ontwerper in gedachten had.
pt: Uau! O rastreador de humor está ótimo. Exatamente como a pessoa responsável pelo design queria.
sv: Wow! Din humörspårare ser fantastisk ut. Precis vad designern ville ha.
th: ว้าว! ตัวติดตามอารมณ์ของคุณดูดีมาก เหมือนกับที่นักออกแบบต้องการเลย
tr: Vay canına! Ruh hâli izleyicin harika görünüyor. Tam tasarımcının istediği gibi.
zh_cn: 哇！你的心情跟踪器看起来很棒。设计师表示很满意。
zh_tw: 哇！你的心情追蹤器看起來真棒。就像設計者想要的一樣。

source: If you are feeling brave, you can keep editing and adjusting the card views to make them exactly as you like.
de: Wenn du Lust hast, kannst du mit der Bearbeitung fortfahren und die Kartenansichten exakt deinen Wünschen anpassen.
es: Si te sientes con ánimos, puedes seguir editando y ajustando las vistas de la tarjeta para que estén exactamente como más te gusta.
es_419: Si te sientes valiente, puedes seguir editando y ajustando las visualizaciones de la carta para que se vean como tú prefieras.
fr: Si tu te sens courageux, tu peux poursuivre la modification et l’ajustement des vues de carte pour qu’elles soient exactement comme tu le souhaites.
it: Se ti va, puoi continuare a modificare e regolare le viste delle schede per renderle esattamente come desideri.
nl: Als je je dapper voelt, kun je doorgaan met het bewerken en aanpassen van de kaartweergaven om ze helemaal aan je wensen aan te passen.
pt: Se estiver com coragem, continue editando e ajustando as visualizações dos cartões para deixá-los exatamente como gosta.
sv: Om du känner dig modig kan du fortsätta att redigera och justera kortvyerna så att de ser ut precis som du vill.
th: ถ้าคุณรู้สึกกล้าหาญ คุณสามารถแก้ไขและปรับมุมมองบัตรต่อไปเพื่อให้ได้มุมมองตามที่คุณต้องการทุกอย่างได้
tr: Kendine güveniyorsan kart görüntülerini düzenlemeyi ve ayarlamayı sürdürüp onların tam istediğin gibi görünmesini sağlayabilirsin.
zh_cn: 如果想挑战自我，你可以继续编辑和调整卡片视图，使它们完全符合你的喜好。
zh_tw: 如果你有勇氣，可以繼續編輯和調整卡片顯示區，使其完全符合你的喜好。

source: You are now on your way to being a SwiftUI view layout expert!
de: Du bist auf dem Weg ein Experte für SwiftUI-Ansichtenlayouts zu werden!
es: Ahora estás en vías de dominar perfectamente la disposición de vistas en SwiftUI.
es_419: ¡Vas por el buen camino para alcanzar el nivel experto de disposición de visualizaciones de SwiftUI!
fr: Tu es sur le point de devenir un expert en disposition de vues SwiftUI !
it: Sei sulla strada giusta per acquisire una solida esperienza con il layout delle viste di SwiftUI.
nl: Je bent al aardig op weg om een expert op het gebied van SwiftUI-weergavelay-outs te worden!
pt: Você está a caminho de se tornar especialista em layout de visualização na SwiftUI!
sv: Nu är du på väg att bli en riktig expert på layout av SwiftUI-vyer!
th: ตอนนี้คุณใกล้จะเป็นผู้เชี่ยวชาญด้านเค้าโครงมุมมอง SwiftUI แล้ว!
tr: Bir SwiftUI görüntü yerleşimi uzmanı olma yolunda ilerliyorsun!
zh_cn: 很快你将成为一名 SwiftUI 视图布局专家！
zh_tw: 你即將成為一個 SwiftUI 顯示區佈局的專家！

source: VStack { Text(isEditing ? "What's your mood?" : "Mood") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
de: VStack { Text(isEditing ? "Wie ist deine Laune?" : "Laune") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
es: VStack { Text(isEditing ? "¿De qué humor estás?" : "Humor") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
es_419: VStack { Text(isEditing ? "¿Cómo está tu estado de ánimo?" : "Estado de ánimo") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
it: VStack { Text(isEditing ? "Come ti senti oggi?" : "Umore") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
nl: VStack { Text(isEditing ? "In welke stemming ben je?" : "Mood") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
pt: VStack { Text(isEditing ? "Como está o seu humor?" : "Humor") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id:\.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
sv: VStack { Text(isEditing ? "Hur känner du dig?" : "Humör") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
th: VStack { Text(isEditing ? "อารมณ์ของคุณเป็นอย่างไร" : "อารมณ์") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
tr: VStack { Text(isEditing ? "Ruh hâlin nasıl?" : "Ruh Hâli") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
zh_cn: VStack { Text(isEditing ? "你的心情如何？" : "心情") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
zh_tw: VStack { Text(isEditing ? "你的心情如何？" : "心情") .foregroundColor(.darkBrown) .font(fontStyle.uiFont(15)) .frame(maxWidth: .infinity, alignment: isEditing ? .leading : .center) HStack { if isEditing { ForEach(emojis, id: \.self) { emoji in Button{ value = emoji } label: { VStack { Text(emoji) .font(.system(size: 35)) .frame(maxWidth: .infinity, alignment: .center) .padding(.bottom) Image(systemName: value == emoji ? "circle.fill" : "circle") .font(.system(size: 16)) .foregroundColor(.darkBrown) } } } } else { ForEach(0..<displayEmojis, id:\.self) { index in Text(value) .font(.system(size: 50)) .frame(maxWidth: .infinity, alignment: .center) } } } .frame(maxHeight: .infinity, alignment: .center) } .frame(minHeight: 100, maxHeight: 200) .padding()
