Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: By applying the `padding` modifier to the `VStack`, you only have to add it once instead of adding it to every [subview](glossary://subview) inside the `VStack`.
de: Durch Anwenden des `padding`-Modifikators auf die Instanz von `VStack` musst du ihn nur einmal einfügen und nicht zu allen [Unteransichten](glossary://subview) in `VStack` hinzufügen.
es: Aplicando el modificador `padding` (relleno) a toda la pila `VStack`, solo lo tendrás que añadir en una ocasión, en lugar de tener que añadirlo a cada [vista secundaria](glossary://subview) de dentro de `VStack`.
es_419: Al aplicar el modificador `padding` (relleno) a `VStack`, sólo tienes que agregarlo una vez en lugar de tener que agregarlo a cada [subvisualización](glossary://subview) dentro de `VStack`.
fr: En appliquant le modificateur `padding` à la `VStack`, tu n’as besoin de l’ajouter qu’une seule fois, plutôt qu’à chaque [sous-vue](glossary://subview) à l’intérieur de la `VStack`.
it: Applicando il modificatore `padding` a `VStack`, è sufficiente aggiungerlo una sola volta, invece di aggiungerlo a ogni [vista secondaria](glossary://subview) all’interno di `VStack`.
nl: Door de modifier `padding` op de `VStack` toe te passen, hoef je deze maar één keer toe te voegen in plaats van aan elke [subweergave](glossary://subview) in de `VStack`.
pt: Ao aplicar o modificador `padding` ao `VStack`, você só precisa adicioná‑lo uma vez, em vez de adicioná‑lo a cada [subvisualização](glossary://subview) dentro do `VStack`.
sv: När du använder `padding`-modifieraren i `VStack` behöver du bara lägga till den en gång istället för att lägga till den i varje [delvy](glossary://subview) inuti `VStack`.
th: เมื่อปรับใช้ปุ่มปรับค่า `padding` ไปยัง `VStack` คุณจะเพิ่มการขยายขอบเพียงครั้งเดียวเท่านั้น แทนที่จะเพิ่มไปยัง[มุมมองย่อย](glossary://subview)ทุกมุมมองภายใน `VStack`
tr: `padding` niteleyicisini `VStack`’e uygulayarak onu `VStack`’in her [alt görüntüsüne](glossary://subview) eklemek yerine yalnızca bir kez eklemen yeterli olur.
zh_cn: 将 `padding`（填补）修饰符应用到 `VStack`，你便可以只添加一次该修饰符，而不用将它添加到 `VStack` 内的每一个[子视图](glossary://subview)中。
zh_tw: 藉由將 `padding` 修飾符套用到 `VStack`，你只需要將它加入一次，而不是將它加入到 `VStack` 內的每個[子顯示區](glossary://subview)。

source: However, if you want your bookshelf to have a specific width, use a `frame` instead of `padding`.
de: Wenn dein Bücherregal aber eine bestimmte Breite haben soll, musst du `frame` anstelle von `padding` verwenden.
es: No obstante, si quieres que tu estantería tenga una anchura específica, usa un `frame` (marco) en vez de `padding`.
es_419: Sin embargo, si quieres que tu estante tenga un ancho específico, debes usar `frame` en lugar de `padding`.
fr: Cependant, si tu veux que ta bibliothèque ait une largeur particulière, tu dois utiliser un `frame` plutôt qu’un `padding`.
it: Tuttavia, se desideri che lo scaffale per i libri sia di un’ampiezza specifica, utilizza `frame` al posto di `padding`.
nl: Als je de boekenplank echter een specifieke breedte wilt geven, moet je een `frame` in plaats van `padding` gebruiken.
pt: No entanto, se você quer que a estante tenha uma largura específica, use um `frame` em vez de `padding`.
sv: Om du däremot vill att bokhyllan ska ha en särskild bredd ska du använda en `frame` istället för `padding`.
th: อย่างไรก็ตาม ถ้าคุณต้องการให้ชั้นวางหนังสือของคุณมีความกว้างที่เจาะจง ให้ใช้ `frame` แทน `padding`
tr: Ancak kitap rafının belirli bir genişliği olmasını istiyorsan `padding` yerine bir `frame` kullan.
zh_cn: 但是，如果想为书架指定一个宽度，可以使用 `frame` 来代替 `padding`。
zh_tw: 但是，如果你希望書架有指定的寬度，請使用 `frame` 而不是 `padding`。

source: To clearly see the effect of the frame, try extending your preview so it takes up half of the screen and then insert code snippet below. Adding a `border` after the frame also helps you visualize the frame.
de: Um den Effekt des Rahmens deutlich sehen zu können, erweitere deine Vorschau, sodass sie die Hälfte des Bildschirms einnimmt. Füge dann den unten aufgeführten Codeabschnitt ein. Du kannst auch eine Instanz von `border` (Rand) nach dem Rahmen einfügen, um ihn deutlicher zu visualisieren.
es: Para ver claramente el efecto del marco (frame), intenta ampliar la previsualización para que ocupe la mitad de la pantalla y, a continuación, inserta el siguiente fragmento de código.
es_419: Para ver con claridad el efecto del marco, intenta extender tu vista previa para que ocupe la mitad de la pantalla y luego inserta el fragmento de código de abajo. Si agregas un borde (`border`) después del marco, te será más fácil visualizarlo.
fr: Pour réaliser pleinement lʼeffet du cadre, essaie de développer ton aperçu pour quʼil prenne la moitié de lʼécran, puis insère lʼextrait de code en dessous. Lʼajout de `border` après le cadre tʼaide aussi à visualiser le cadre.
it: Per vedere chiaramente l’effetto della cornice, prova a estendere l’anteprima in modo che occupi metà dello schermo e poi inserisci il frammento di codice qui sotto. Anche l’aggiunta di `border` dopo la cornice ne facilita la visualizzazione.
nl: Om het effect van het `frame` duidelijk te kunnen zien, kun je de voorvertoning vergroten zodat deze de helft van het scherm beslaat. Voeg vervolgens het onderstaande codefragment in. Door een `border` na het `frame` toe te voegen, kun je het `frame` ook beter visualiseren.
pt: Para ver claramente o efeito da moldura, expanda a pré‑visualização para que ela ocupe metade da tela e insira o fragmento de código abaixo. A adição de um `border` depois da moldura ajuda a visualizá‑la.
sv: Du kan tydligt se vilken effekt ramen har om du utökar förhandsvisningen så att den fyller halva skärmen och sedan infogar kodsnutten nedan. Att lägga till en `border` efter ramen hjälper också till att visualisera ramen.
th: ในการดูเอฟเฟ็กต์ของกรอบอย่างชัดเจน ให้ลองขยายการแสดงตัวอย่างของคุณเพื่อให้ใช้พื้นที่ครึ่งหน้าจอ แล้วแทรกส่วนย่อยของโค้ดด้านล่าง การเพิ่ม `border` หลังจากกรอบยังช่วยแสดงภาพกรอบให้คุณเห็นอีกด้วย
tr: Çerçevenin etkisini açık bir şekilde görmek için önizlemeni, ekranın yarısını kaplayacak şekilde genişletmeyi dene ve sonra aşağıdaki kod parçacığını ekle. Çerçeveden sonra bir `border` eklemek, çerçeveyi gözünde canlandırmana yardımcı olur.
zh_cn: 为了能清楚地看到框架的效果，你可以试着扩展预览，让它占据屏幕的一半空间，然后插入下方的代码片段。在框架后面添加一个 `border`（边界）对可视化框架也有帮助。
zh_tw: 若要清楚地看到外框的效果，請嘗試展開預覽，讓它占用一半的螢幕，然後在下方插入程式碼片段。在外框後方加入`border` 也有助於你將外框視覺化。

source: Woohoo! Now you have all the tools to create your own views.
de: Juhu! Jetzt stehen dir alle Werkzeuge zur Verfügung, die du zum Erstellen von Ansichten brauchst.
es: ¡Muy bien! Ya tienes todas las herramientas necesarias para crear las vistas que quieras.
es_419: ¡Asombroso! Ahora tienes todas las herramientas para crear tus propias visualizaciones.
fr: Super ! Tu possèdes désormais tous les outils pour créer tes propres vues.
it: Ottimo! Ora hai tutti gli strumenti per creare le tue viste.
nl: Wauw! Je beschikt nu over alle benodigde vaardigheden om je eigen weergaven te maken.
pt: Maravilha! Agora você tem todas as ferramentas para criar as suas próprias visualizações.
sv: Hurra! Nu har du alla verktyg som behövs för att skapa dina egna vyer.
th: ไชโย! ตอนนี้คุณก็มีเครื่องมือทั้งหมดในการสร้างมุมมองของคุณเองแล้ว
tr: İşte bu! Artık kendi görüntülerini yaratmanı sağlayacak tüm araçlara sahipsin.
zh_cn: 哇！现在你拥有了创建专属视图的所有工具了。
zh_tw: 哇！現在你擁有全部的工具來製作自己的顯示區了。

# GuideBook..Guide0..StepMy Journal..TaskGroup0..TaskdebuggingViews..title
source: Debugging views
de: Ansichten debuggen
es: Depuración de vistas
es_419: Depurar visualizaciones
fr: Débogage de vues
it: Effettuare il debug delle viste
nl: Fouten in weergaven opsporen
pt: Depurando visualizações
sv: Felsökningsvyer
th: มุมมองการแก้บั๊ก
tr: Görüntülerle ilgili hataları ayıklama
zh_cn: 调试视图
zh_tw: 除錯顯示區

source: When your SwiftUI views don’t show up as you expect, you’ll need to flex your debugging skills to fix them.
de: Wenn deine SwiftUI-Ansichten nicht wie erwartet angezeigt werden, musst du deine Debugging-Fähigkeiten unter Beweis stellen und das Problem lösen.
es: Cuando las vistas de SwiftUI no tienen el aspecto que esperas, tendrás que poner a trabajar tus habilidades de depuración para corregirlas.
es_419: Si tus visualizaciones de SwiftUI no se muestran de la forma esperada, deberás poner a prueba tus habilidades de depuración para corregirlas.
fr: Quand tes vues SwiftUI ne s’affichent pas comme tu le souhaites, tu dois mettre en pratique tes compétences en matière de débogage pour régler le problème.
it: Quando le viste di SwiftUI non vengono visualizzate come previsto, devi sfruttare le tue capacità di debug per risolvere il problema.
nl: Als je SwiftUI-weergaven er anders uitzien dan verwacht, moet je je foutopsporingsvaardigheden toepassen om het probleem te verhelpen.
pt: Quando as visualizações da SwiftUI não aparecem da maneira esperada, você precisa usar as suas habilidades de depuração para corrigi‑las.
sv: När SwiftUI-vyer inte ser ut som du förväntar dig måste du flexa dina felsökningsfärdigheter för att fixa dem.
th: เมื่อมุมมอง SwiftUI ของคุณไม่แสดงขึ้นอย่างที่คุณคาดหวัง คุณต้องปรับใช้ทักษะการแก้บั๊กของคุณเพื่อแก้ไขปัญหา
tr: SwiftUI görüntülerin beklediğin gibi gözükmüyorsa bunları düzeltmek için hata ayıklama becerilerini kasman gerekecek.
zh_cn: SwiftUI 视图没有按你预期的效果显示时，你需要灵活运用调试技能来解决问题。
zh_tw: 當你的 SwiftUI 顯示區未如預期顯示時，你需要使用除錯的技巧來修正它們。

source: Start by looking at the view displayed in the preview — it’s clearly not showing up correctly! 😩 Can you guess what this view is supposed to be?
de: Sieh dir als Erstes die Ansicht an, die in der Vorschau dargestellt wird. Sie wird eindeutig nicht korrekt angezeigt! 😩 Hast du eine Idee, was diese Ansicht eigentlich sein soll?
es: Empieza observando la vista en la previsualización: está claro que no aparece correctamente. 😩 ¿Te puedes imaginar cómo debería quedar esta vista?
es_419: Primero, observa la visualización en la vista previa; es claro que algo no anda bien. 😩 ¿Puedes adivinar cómo se debería ver?
fr: Commence par jeter un œil à la vue qui est affichée dans l’aperçu : il est clair qu’elle ne s’affiche pas correctement ! 😩 Peux-tu deviner ce que cette vue est censée être ?
it: Inizia osservando la vista nell’anteprima: è chiaro che non viene visualizzata correttamente! 😩 Riesci a indovinare quale vista dovrebbe essere?
nl: Bekijk allereerst de weergave in de voorvertoning. Die ziet er duidelijk niet goed uit! 😩 Kun je bedenken wat er in deze weergave zichtbaar zou moeten zijn?
pt: Para começar, analise a visualização mostrada na pré‑visualização — obviamente, ela não está aparecendo corretamente! 😩 Você consegue adivinhar o que deveria existir nessa visualização?
sv: Börja med att titta på vyn som syns i förhandsvisningen – det är tydligt att den inte ser ut som den ska! 😩 Kan du gissa vad den här vyn ska vara?
th: เริ่มจากดูมุมมองที่แสดงในการแสดงตัวอย่าง ซึ่งเห็นได้ชัดว่าแสดงไม่ถูกต้อง! 😩 คุณเดาได้ไหมว่ามุมมองนี้ควรจะเป็นอะไร
tr: Önizlemede gösterilen görüntüye bakmakla başla; doğru gözükmediği açık! 😩 Bu görüntünün ne olması gerektiğini tahmin edebilir misin?
zh_cn: 从预览中显示的视图着手，很明显它没有正确地显示！😩 你能猜到这个视图应该是什么吗？
zh_tw: 首先查看預覽中的顯示區，很顯然地，它並沒有正確顯示！😩 你能猜到這個顯示區應該是什麼嗎？

source: It’s the queen of hearts playing card (or, it’s supposed to be 😵‍💫).
de: Es ist eigentlich die Spielkarte Herzdame (zumindest sollte sie das sein 😵‍💫).
es: Es un naipe de una baraja: la reina de corazones (bueno, se supone 😵‍💫).
es_419: Es la carta de la reina de corazones… o al menos eso es lo que se supone que es. 😵‍💫
fr: C’est la reine de cœur qui joue aux cartes (du moins, c’est censé être le cas 😵‍💫).
it: È la carta da gioco della regina di cuori (o almeno dovrebbe esserlo 😵‍💫).
nl: Het is de hartenvrouw die aan het kaarten is (of dat zou het moeten zijn 😵‍💫).
pt: A carta da dama de copas (pelo menos em tese 😵‍💫).
sv: Det är hjärter dam som spelar kort (eller det borde vara det 😵‍💫).
th: ไพ่ควีนโพแดง (หรือควรจะเป็นแบบนั้น 😵‍💫)
tr: Kupa kızı oyun kartı (veya öyle olması gerekiyordu 😵‍💫).
zh_cn: 它是红心 Q 扑克牌（或者说它本来应该是 😵‍💫）。
zh_tw: 它是紅心皇后的撲克牌（或者它應該是 😵‍💫）。

source: As the name suggests, `HalfCard` contains half a card. You use two `HalfCard` instances in a `VStack` to create this view. Then, flip the bottom `HalfCard` upside down to form a mirror image of the top `HalfCard`.
de: `HalfCard` (halbe Karte) enthält eine halbe Karte. Du verwendest zwei Instanzen von `HalfCard` in `VStack`, um die Ansicht zu erstellen. Im Anschluss stellst du die untere Hälfte von `HalfCard` auf den Kopf, um ein gespiegeltes Bild von der oberen Hälfte von `HalfCard` zu erzeugen.
es: Como sugiere su nombre, `HalfCard` (media carta) contiene media carta. Para crear esta vista se utilizan dos instancias de `HalfCard` en un contenedor `VStack`. A continuación, se da la vuelta en vertical a la parte inferior de `HalfCard` para formar una imagen simétrica de la `HalfCard` de abajo.
es_419: Como su nombre lo sugiere, `HalfCard` contiene media carta. Puedes usar dos instancia de `HalfCard` en una pila `VStack` para crear esta visualización. Después, voltea la carta `HalfCard` inferior al revés para formar una imagen duplicada de la carta `HalfCard` de arriba.
fr: Comme son nom l’indique, `HalfCard` (demi-carte) contient la moitié d’une carte. Tu utilises deux instances `HalfCard` dans une `VStack` pour créer cette vue. Ensuite, inverse le sens de `HalfCard` pour former une image symétrique de la `HalfCard` du haut.
it: Come suggerisce il nome, `HalfCard` contiene mezza scheda. Utilizza due istanze di `HalfCard` in `VStack` per creare questa vista. Poi, capovolgi `HalfCard` inferiore per formare un’immagine speculare di `HalfCard` superiore.
nl: Zoals de naam al aangeeft, bevat `HalfCard` een halve kaart. Je gebruikt twee instanties van `HalfCard` in een `VStack` om deze weergave aan te maken. Draai de onderste `HalfCard` vervolgens om om een spiegelbeeld van de bovenste `HalfCard` te vormen.
pt: Como o nome sugere, `HalfCard` contém meia carta. Você usa duas instâncias de `HalfCard` em um `VStack` para criar essa visualização e vira a `HalfCard` inferior de cabeça para baixo para formar uma imagem espelhada da `HalfCard` superior.
sv: `HalfCard` innehåller ett halvt kort. Du använder två instanser av `HalfCard` i en `VStack` till att skapa den här vyn. Vänd sedan ditt nedre `HalfCard` upp och ned för att bilda en spegelbild av ditt övre `HalfCard`.
th: ตามที่ชื่อบอก `HalfCard` มีไพ่ครึ่งใบ คุณสามารถใช้ชื่อแทนประเภท `HalfCard` ใน `VStack` เพื่อสร้างมุมมองนี้ จากนั้นพลิก `HalfCard` ด้านล่างกลับหัวเพื่อสร้างภาพสะท้อนของ `HalfCard` ด้านบนได้
tr: Adından da anlaşılacağı gibi `HalfCard` kartın yarısını içerir. `VStack`’te bu görüntüyü yaratmak için iki `HalfCard` örneği kullanırsın. Sonra, üst `HalfCard`’ın bir ayna görüntüsünü oluşturmak için alt `HalfCard`’ı baş aşağı çevirirsin.
zh_cn: 和名称的字面意思一样，`HalfCard`（半张牌）包含半张纸牌。你可以在 `VStack` 中使用两个 `HalfCard` 实例来创建这个视图。然后，上下翻转下方的 `HalfCard` 来形成上方 `HalfCard` 的镜像图像。
zh_tw: 顧名思義，`HalfCard` 包含半張卡片。你在 `VStack` 中使用兩個 `HalfCard` 實例來建立這個顯示區。然後，將底部的 `HalfCard` 翻轉，形成頂部 `HalfCard` 的鏡像。

source: By combining the top and bottom halves, you create a full playing card.
de: Durch Kombinieren der oberen und unteren Hälfte erstellst du die vollständige Spielkarte.
es: Combinando las mitades superior e inferior se crea un naipe completo.
es_419: Al combinar la mitad inferior con la superior, crearás una carta completa.
fr: En associant les moitiés inférieure et supérieure, tu crées une carte à jouer entière.
it: Unendo le metà superiore e inferiore, crei una carta da gioco completa.
nl: Door de bovenste en onderste helft te combineren, ontstaat een volledige speelkaart.
pt: Ao combinar as metades superior e inferior, você cria uma carta inteira.
sv: Du skapar ett helt spelkort genom att kombinera den övre och nedre halvan.
th: ด้วยการรวมครึ่งบนและครึ่งล่าง คุณจะสร้างไพ่เต็มใบ
tr: Üst ve alt yarıları birleştirerek tam bir oyun kartı yaratırsın.
zh_cn: 合并上下两个部分，你就创建了一张完整的扑克牌。
zh_tw: 藉由組合上半部和下半部，你可以製作一張完整的紙牌。

source: Any code applied to the `HalfCard` view affects both the top and bottom halves of the card, allowing you to fix issues in both halves at the same time.
de: Jeder Code, der auf die Ansicht `HalfCard` angewendet wird, beeinflusst sowohl die obere als auch die untere Hälfte der Karte. So kannst du Probleme gleichzeitig in beiden Hälften beheben.
es: Cualquier código que se aplique a la vista `HalfCard` afectará tanto a la mitad superior como a la inferior del naipe, de forma que podrías corregir los errores en ambas mitades al mismo tiempo.
es_419: Cualquier código que se aplique a la visualización `HalfCard` afectará tanto a la mitad superior de la carta como a la inferior, lo que permite corregir errores en ambas mitades al mismo tiempo.
fr: Tout code appliqué à la vue `HalfCard` affecte à la fois la moitié supérieure et inférieure de la carte, ce qui te permet de corriger des problèmes aux deux moitiés en même temps.
it: Qualsiasi codice applicato alla vista `HalfCard` influisce sia sulla metà superiore che su quella inferiore della scheda, consentendoti di risolvere i problemi in entrambe le metà contemporaneamente.
nl: Alle code die op de `HalfCard`-weergave wordt toegepast, is van invloed op zowel de bovenste als de onderste helft van de kaart, waardoor je problemen in beide helften in één keer kunt verhelpen.
pt: Qualquer código aplicado à visualização `HalfCard` afeta as duas metades da carta, o que permite que você corrija problemas nas metades superior e inferior ao mesmo tempo.
sv: All kod som används i `HalfCard`-vyn påverkar både den övre och nedre halvan av kortet, så du kan åtgärda problem i båda halvorna samtidigt.
th: โค้ดต่างๆ ที่ปรับใช้กับมุมมอง `HalfCard` จะส่งผลต่อทั้งครึ่งบนและครึ่งล่างของไพ่ ทำให้คุณสามารถแก้ไขปัญหาในทั้งสองครึ่งได้พร้อมกัน
tr: `HalfCard` görüntüsüne uygulanan herhangi bir kod, kartın hem üst hem de alt yarısını etkiler ve her iki yarıdaki sorunları aynı anda düzeltmene olanak tanır.
zh_cn: 应用到 `HalfCard` 视图的任何代码，会同时影响牌的上半部分和下半部分，这可让你同时修复两个部分的问题。
zh_tw: 套用到 `HalfCard` 顯示區的任何程式碼都會影響卡片的上半部和下半部，讓你可以同時修正這兩個部分的問題。

source: Try adding a `border` to the `HalfCard` view to see each half:
de: Füge `border` (Rand) zur `HalfCard`-Ansicht hinzu, um die jeweiligen Hälften anzuzeigen:
es: Prueba a añadir un `border` (borde) a la vista `HalfCard` para ver cada mitad:
es_419: Intenta agregar un borde (`border`) a la visualización `HalfCard` para ver cada mitad:
fr: Essaie d’ajouter une `border` à la vue `HalfCard` pour afficher chaque moitié :
it: Prova ad aggiungere `border` alla vista `HalfCard` per visualizzare ogni metà:
nl: Voeg een `border` aan de `HalfCard`-weergave toe om beide helften te zien:
pt: Tente adicionar um `border` à visualização `HalfCard` para ver cada metade:
sv: Prova att lägga till en `border` i `HalfCard`-vyn för att visa vardera halva:
th: ลองเพิ่ม `border` ไปยังมุมมอง `HalfCard` เพื่อดูแต่ละครึ่ง:
tr: Her bir yarıyı görmek için `HalfCard` görüntüsüne bir `border` eklemeyi dene:
zh_cn: 试着将 `border` 添加到 `HalfCard` 视图来查看各个部分：
zh_tw: 嘗試將一個 `border` 加入 `HalfCard` 顯示區來檢視每一半：

source: Adding a border to a view is a great debugging tool because it allows you to see how much space a view occupies. You can use this technique to diagnose lots of issues in your code.
de: Das Hinzufügen eines Randes zu einer Ansicht ist ein tolles Werkzeug zum Debuggen, denn dadurch kannst du sehen, wie viel Platz eine Ansicht einnimmt. Dieses Verfahren eignet sich gut, um viele verschiedene Probleme in deinem Code zu identifizieren.
es: Añadir un borde a una vista es una estupenda herramienta de depuración, porque te permite ver cuánto espacio ocupa una vista. Con esta técnica puedes diagnosticar muchos problemas en el código.
es_419: Agregar un borde a una visualización es un buen método de depuración, ya que te permite ver el espacio que ocupa la visualización. Esta técnica es muy útil para diagnosticar muchos problemas en el código.
fr: L’ajout d’une bordure à une vue est un excellent outil de débogage, car il te permet de voir combien d’espace est occupé par une vue. Tu peux utiliser cette technique pour diagnostiquer un grand nombre de problèmes dans ton code.
it: Aggiungere un bordo a una vista è un ottimo strumento di debug, perché ti consente di visualizzare quanto spazio occupa una vista. Puoi usare questa tecnica per diagnosticare molti problemi nel codice.
nl: Het toevoegen van een rand aan een weergave is een handige manier om fouten op te sporen omdat je zo kunt zien hoeveel ruimte een weergave in beslag neemt. Je kunt deze techniek gebruiken om uiteenlopende problemen in je code op te lossen.
pt: Adicionar uma borda a uma visualização é ótimo para depurar porque ela permite que você veja quanto espaço uma visualização ocupa. Você pode usar essa técnica para diagnosticar vários problemas no código.
sv: Att lägga till en ram i en vy är ett suveränt felsökningsverktyg eftersom du kan se hur mycket utrymme en vy tar upp. Du kan använda den här tekniken till att diagnostisera mängder av problem i koden.
th: การเพิ่มเส้นขอบไปยังมุมมองเป็นเครื่องมือการแก้บั๊กที่ดี เนื่องจากจะทำให้คุณเห็นว่ามุมมองใช้พื้นที่เท่าใด คุณสามารถใช้เทคนิคนี้เพื่อวินิจฉัยปัญหาจำนวนมากในโค้ดของคุณได้
tr: Bir görüntüye kenar eklemek, görününtünün ne kadar yer kapladığını görmeni sağladığı için harika bir hata ayıklama aracıdır. Kodunda birçok soruna tanı koymak için bu tekniği kullanabilirsin.
zh_cn: 在视图中添加边界是很好的调试工具，因为它可让你看到视图占用了多少空间。你可以使用这个技能来诊断代码中的许多问题。
zh_tw: 為顯示區加入邊框是一個很棒的除錯工具，因為它能讓你查看顯示區佔用了多少空間。你可以使用這個技巧來診斷程式碼中的許多問題。

source: The first major problem here is that all of the graphics are squished together.
de: Das erste große Problem in diesem Fall ist, dass die ganzen Grafiken alle zusammengequetscht sind.
es: El primer problema en este caso es que todos los gráficos están aplastados entre sí.
es_419: El primer problema importante aquí es que todos los gráficos están amontonados.
fr: Le premier gros problème qui se présente ici, c’est que tous les graphismes sont entassés.
it: Il primo grande problema è che tutte le grafiche appaiono schiacciate.
nl: Het eerste grote probleem hier is dat alle plaatjes worden samengedrukt.
pt: O primeiro grande problema aqui é que todos os gráficos estão espremidos juntos.
sv: Det första stora problemet här är att all grafik är hopklämd.
th: ปัญหาหลักปัญหาแรกตรงนี้คือกราฟิกทั้งหมดบีบอยู่ด้วยกัน
tr: Burada öncelikle en büyük sorun grafiklerin tümü sıkışık görünüyor.
zh_cn: 这里的第一个主要问题是，所有图形都被挤压在了一起。
zh_tw: 這裡的第一個主要問題是所有圖形都被擠壓在一起。
