Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: You may notice that adding a `frame` to the `Image` view doesn’t change the actual size of the ladybug. This is because you need to add the [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) modifier to an image, if you want to change its size.
de: Dir ist sicher aufgefallen, dass das Hinzufügen von `frame` zur `Image`-Ansicht nicht die eigentliche Größe des Marienkäfers ändert. Der Grund hierfür ist, dass du den Modifikator [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) zu einem Bild hinzufügen musst, wenn du die Größe ändern möchtest.
es: Fíjate en que al añadir `frame` a la vista `Image` no cambia el tamaño real de la mariquita. Esto es así porque, si quieres cambiar el tamaño de una imagen, tienes que añadir el modificador [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)).
es_419: Puede que observes que al agregar un `frame` a la visualización `Image` no cambie el tamaño real de la catarina. Esto se debe a que, si quieres cambiar el tamaño de una imagen, necesitas agregarle el modificador [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)).
fr: Tu remarqueras peut-être que l’ajout d’un `frame` à la vue `Image` ne change pas la taille réelle de la coccinelle. En effet, tu dois ajouter le modificateur [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) à une image, si tu veux modifier sa taille.
it: Potresti aver notato che l’aggiunta di un `frame` alla vista `Image` non cambia la dimensione effettiva della coccinella. Ciò accade perché devi aggiungere il modificatore [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) a un’immagine, se vuoi cambiare la sua dimensione.
nl: Zoals je ziet, verandert de grootte van het lieveheersbeestje niet als je een `frame` aan de `Image`-weergave toevoegt. Dit komt doordat je de modifier [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) aan een afbeelding moet toevoegen als je de grootte ervan wilt wijzigen.
pt: Você vai perceber que adicionar um `frame` à visualização `Image` não altera o tamanho real da joaninha. Isso acontece porque você precisa adicionar o modificador [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) a uma imagem, se quiser mudar o tamanho dela.
sv: Du kanske märker att den faktiska storleken på nyckelpigan inte ändras när du lägger till en `frame` i `Image`-vyn. Det beror på att du måste lägga till [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:))-modifieraren i en bild om du vill ändra dess storlek.
th: คุณอาจสังเกตเห็นว่าการเพิ่ม `frame` ไปยังมุมมอง `Image` ไม่ได้เปลี่ยนขนาดจริงของเต่าทอง นี่เป็นเพราะว่าคุณต้องเพิ่มปุ่มปรับค่า [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) ไปยังภาพ หากคุณต้องเปลี่ยนขนาด
tr: `Image` görüntüsüne bir `frame` eklemenin uğur böceğinin gerçek boyutunu değiştirmediğini fark etmişsindir. Görüntünün boyutunu değiştirmek istiyorsan ona [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) niteleyicisini eklemen gerekir.
zh_cn: 你可能注意到了，将 `frame` 添加到 `Image` 视图不会改变瓢虫的实际大小。这是因为你需要将 [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:))（可调整大小）修饰符添加到图像，才能更改它的大小。
zh_tw: 你可能會注意到，在 `Image` 顯示區中加入 `frame` 並不會改變瓢蟲的實際大小。這是因為如果要更改影像大小，需要將 [.resizable](doc://com.apple.documentation/documentation/SwiftUI/Image/resizable(capInsets:resizingMode:)) 修飾符加入影像。

source: Add this modifier between the `Image` and the `frame`:
de: Füge diesen Modifikator zwischen `Image` und `frame` ein:
es: Añade este modificador entre las definiciones de `Image` y `frame`:
es_419: Agrega este modificador entre `Image` y `frame`:
fr: Ajoute ce modificateur entre la vue `Image` et le `frame` :
it: Aggiungi questo modificatore tra `Image` e `frame`:
nl: Voeg deze modifier toe tussen `Image` en `frame`:
pt: Adicione este modificador entre `Image` e `frame`:
sv: Lägg till den här modifieraren mellan `Image` och `frame`:
th: เพิ่มปุ่มปรับค่านี้ระหว่าง `Image` และ `frame`:
tr: Bu niteleyiciyi `Image` ile `frame` arasına ekle:
zh_cn: 在 `Image` 和 `frame` 之间添加这个修饰符：
zh_tw: 將這個修飾符加入 `Image` 和 `frame` 之間：

source: Adding `resizable` after `frame` causes a compiler error. Applying the `frame` modifier to the `Image` actually creates a new view that isn’t an `Image`, so it doesn’t have access to the resizable method.
de: Wenn `resizable` (Größe änderbar) nach `frame` eingefügt wird, tritt ein Compiler-Fehler auf. Durch das Anwenden des `frame`-Modifikators auf `Image` wird eigentlich eine neue Ansicht erstellt, bei der es sich nicht um eine Instanz von `Image` handelt, damit sie nicht auf die resizable-Methode zugreifen kann.
es: Añadir `resizable` después de `frame` provoca un error de compilación. Al aplicar el modificador `frame` a `Image` en realidad se crea una nueva vista que no es un contenedor `Image`, por lo que no tendrá acceso al método resizable.
es_419: Si agregas `resizable` después de `frame`, se producirá un error de compilación. Si aplicas el modificador `frame` a `Image`, se crea una nueva visualización que no es una imagen, por lo que no tiene acceso al método de tamaño ajustable.
fr: L’ajout de `resizable` après `frame` provoque une erreur de compilation. L’application du modificateur `frame` à la vue `Image` créera en fait une nouvelle vue qui ne sera pas une `Image`, elle n’aura donc pas accès à la méthode resizable.
it: L’aggiunta di `resizable` dopo `frame` causerà un errore del compilatore. L’applicazione del modificatore `frame` a `Image` crea in realtà una nuova vista che non è una `Image` e che non ha quindi accesso al metodo di ridimensionamento.
nl: Als je `resizable` toevoegt na `frame`, veroorzaak je een compilerfout. Als je de modifier `frame` op de `Image` toepast, wordt een nieuwe weergave aangemaakt die geen `Image` is en die dus geen toegang tot de methode `resizable` heeft.
pt: A adição de `resizable` depois do `frame` causa um erro de compilação. Na verdade, ao aplicar o modificador `frame` a `Image`, você cria uma nova visualização que não é uma `Image` e, portanto, ela não tem acesso ao método redimensionável.
sv: Om du lägger till `resizable` efter `frame` orsakar det ett kompilatorfel. När du använder `frame`-modifieraren i `Image` skapar det en ny vy som inte är en `Image`, så den har inte tillgång till resizable-metoden.
th: การเพิ่ม `resizable` หลัง `frame` ทำให้เกิดข้อผิดพลาดของคอมไพเลอร์ จริงๆ แล้วการปรับใช้ปุ่มปรับค่า `frame` กับ `Image` จะสร้างมุมมองใหม่ที่ไม่ใช่ `Image` จึงทำให้ไม่สามารถเข้าถึงวิธีการที่ปรับขนาดได้
tr: `frame`’den sonra `resizable` eklenirse bir derleyici hatası oluşur. `frame` niteleyicisi `Image`’a uygulandığında `Image` olmayan yeni bir görüntü yaratılır ve bu nedenle bu görüntünün büyüklüğü değiştirilebilir (resizable) metoduna erişimi yoktur.
zh_cn: 将 `resizable` 添加到 `frame` 后面会导致编译器错误。将 `frame` 修饰符应用到 `Image` 会实际创建非 `Image` 的新视图，如此一来，它便不可访问可调整大小的方法。
zh_tw: 在 `frame` 後方加入 `resizable` 會導致編譯器錯誤。將 `frame` 修飾符套用到 `Image`，實際上會製作一個不是 `Image` 的新顯示區，因此它無法取用可調整大小的方法。

source: Notice how the ladybug looks stretched even by adding an ideal width and height? For images, it’s often better to use [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) or [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) instead of a `frame`.
de: Ist dir aufgefallen, dass der Marienkäfer irgendwie wie gedehnt aussieht, obwohl eine ideale Höhe und Breite angegeben ist? Bei Bildern ist es oft besser, statt `frame` eine Instanz von [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) oder [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) zu verwenden.
es: ¿Ves cómo está estirada la mariquita incluso después de añadir unas dimensiones ideales de altura y anchura? En el caso de las imágenes, suele ser mejor usar [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) o [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) en lugar de un `frame` (marco).
es_419: ¿Observaste cómo la catarina tiene un aspecto más estirado incluso al agregar un ancho y alto ideal? Para las imágenes, a menudo es mejor usar [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) o [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) en lugar de un marco.
fr: As-tu remarqué que la coccinelle a l’air étirée, même si tu ajoutes une largeur et une hauteur idéales ? Pour les images, il est souvent préférable d’utiliser [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) ou [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) plutôt que `frame`.
it: Vedi come la coccinella compare allungata anche aggiungendo una larghezza e un’altezza ideali? Per le immagini è spesso meglio usare [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) o [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) invece di una cornice.
nl: Is het je opgevallen dat het lieveheersbeestje er uitgerekt uitziet, zelfs als je een ideale breedte en hoogte toevoegt? Voor afbeeldingen is het vaak beter om [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) of [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) te gebruiken in plaats van een `frame`.
pt: Reparou como a joaninha parece estar esticada mesmo depois de adicionar a largura e altura ideais? Em imagens, muitas vezes é melhor usar [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) ou [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) em vez de um `frame`.
sv: Märker du hur nyckelpigan ser ut att vara utsträckt trots att du har lagt till en perfekt bredd och höjd? För bilder är det ofta bättre att använda [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) eller [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) istället för en `frame`.
th: สังเกตไหมว่าเต่าทองดูยืดออกแม้จะเพิ่มความกว้างและความสูงที่เหมาะสมแล้ว สำหรับภาพ การใช้ [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) หรือ [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) มักจะดีกว่าการใช้ `frame`
tr: İdeal bir genişlik ve yükseklik eklediğinde bile uğur böceğinin nasıl uzatılmış göründüğüne dikkat ettin mi? Görüntüler için çerçeve (`frame`) yerine [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) veya [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit()) kullanmak genellikle daha iyidir.
zh_cn: 注意到即便添加了理想的宽和高，瓢虫看起来也被拉伸了吗？对于图像而言，更建议使用 [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill())（缩放以填充）或 [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit())（缩放以适合）而非 `frame`。
zh_tw: 是否注意到即使加入了理想的寬度和高度，瓢蟲看起來是如何被拉伸的？對於影像，你最好使用 [scaledToFill()](doc://com.apple.documentation/documentation/swiftui/view/scaledtofill()) 或 [scaledToFit()](doc://com.apple.documentation/documentation/swiftui/menu/scaledtofit())，而不是框架。

source: Replace the `Image` view `frame` with the code below:
de: Ersetze `frame` der `Image`-Ansicht durch den unten aufgeführten Code:
es: Sustituye el `frame` de la vista `Image` por el código siguiente:
es_419: Reemplaza el `frame` de la visualización `Image` con el código de abajo:
fr: Remplace le `frame` de la vue `Image` par le code ci-dessous :
it: Sostituisci il `frame` della vista `Image` con il codice sottostante:
nl: Vervang `frame` van de `Image`-weergave door de onderstaande code:
pt: Substitua a visualização `Image` `frame` pelo código abaixo:
sv: Ersätt `Image`-vyns `frame` med koden nedan:
th: แทนที่ `frame` ของมุมมอง `Image` ด้วยโค้ดด้านล่าง:
tr: `Image` görüntüsündeki `frame`’i aşağıdaki kodla değiştir:
zh_cn: 使用以下代码替换 `Image` 视图 `frame`：
zh_tw: 用下方的程式碼取代 `Image` 顯示區 `frame`：

source: You also may have noticed that adding the `frame` to the `Text` view didn’t make the actual text inside the view larger — it made the view holding the text larger. This allows for more text to fit into the view, but if you want to make the actual text bigger, you can add the [font](doc://com.apple.documentation/documentation/swiftui/font) modifier to your text view.
de: Dir ist wahrscheinlich auch aufgefallen, dass das Hinzufügen von `frame` zur `Text`-Ansicht den Text in der Ansicht nicht vergrößert hat, sondern dass stattdessen die Ansicht, die den Text enthält, vergrößert wurde. Auf diese Weise passt mehr Text in die Ansicht. Wenn du den eigentlichen Text vergrößern möchtest, kannst du den Modifikator für [Schrift](doc://com.apple.documentation/documentation/swiftui/font) zu deiner Textansicht hinzufügen.
es: Quizás también hayas notado que al añadir el `frame` a la vista `Text` no aumentó el tamaño del texto incluido en el interior de la vista, pero sí se agrandó la vista que contiene el texto. Esto permite que quepa más texto en ella, pero si quieres aumentar el tamaño del texto, puedes añadir el modificador [font](doc://com.apple.documentation/documentation/swiftui/font) a la vista de texto.
es_419: Tal vez también observaste que al agregar el marco a la visualización `Text` no se agrandó el texto que está dentro de la visualización, sino que se agrandó la visualización que contiene el texto. Esto permite que haya más texto dentro de la visualización, pero si lo que quieres es agrandar el texto, puedes agregar el modificador [font](doc://com.apple.documentation/documentation/swiftui/font) a tu visualización de texto.
fr: Tu as peut-être aussi remarqué que l’ajout de `frame` à la vue `Text` n’a pas agrandi le texte lui-même à l’intérieur de la vue, mais a agrandi la vue contenant le texte. Cela permet de faire tenir plus de texte dans la vue, mais si tu veux que le texte lui-même soit plus grand, tu peux ajouter le modificateur de police [font](doc://com.apple.documentation/documentation/swiftui/font) à ta vue de texte.
it: Potresti anche aver notato che l’aggiunta della cornice alla vista `Text` non ha ingrandito il testo presente all’interno della vista, ma solo la vista che contiene il testo. Ciò consente di inserire più testo nella vista, ma se desideri ingrandire il testo presente, puoi aggiungere il modificatore [font](doc://com.apple.documentation/documentation/swiftui/font) alla vista testo.
nl: Misschien is het je ook opgevallen dat de tekst in de weergave niet groter is geworden door het toevoegen van `frame` aan de `Text`-weergave. In plaats daarvan is de weergave waarin de tekst zich bevindt groter geworden. Zo past er meer tekst in de weergave, maar als je de tekst zelf groter wilt maken, kun je de modifier [font](doc://com.apple.documentation/documentation/swiftui/font) aan de tekstweergave toevoegen.
pt: Você também deve ter reparado que a adição do `frame` à visualização `Text` não aumenta o texto na visualização, e sim a própria visualização que contém o texto. Isso permite que mais texto caiba na visualização, mas caso você queira aumentar o texto em si, adicione o modificador [font](doc://com.apple.documentation/documentation/swiftui/font) à visualização de texto.
sv: Du kanske också har märkt att den faktiska texten inuti vyn inte blev större när du lade till `frame` i `Text`-vyn, men att vyn som innehåller texten blev större. Det innebär att mer text får plats i vyn, men om du vill att den faktiska texten ska bli större kan du lägga till [font](doc://com.apple.documentation/documentation/swiftui/font)-modifieraren i textvyn.
th: คุณอาจยังสังเกตอีกด้วยว่าการเพิ่ม `frame` ไปยังมุมมอง `Text` ไม่ได้ทำให้ข้อความจริงภายในมุมมองมีขนาดใหญ่ขึ้น แต่ทำให้มุมมองที่บรรจุข้อความมีขนาดใหญ่ขึ้น การทำเช่นนี้จะช่วยให้ใส่ข้อความลงในมุมมองได้มากขึ้น แต่หากคุณต้องการให้ขนาดของข้อความจริงใหญ่ขึ้น คุณสามารถเพิ่มปุ่มปรับค่า[แบบอักษร](doc://com.apple.documentation/documentation/swiftui/font)ไปยังมุมมองข้อความของคุณได้
tr: Çerçeveyi (`frame`) `Text` görüntüsüne eklemenin görüntünün içindeki asıl metni daha büyük yapmadığını da (metni tutan görüntüyü büyüttüğünü) fark etmişsindir. Bu, görüntüye daha fazla metnin sığmasını sağlar ama metnin kendisini büyütmek istiyorsan metin görüntüne [font](doc://com.apple.documentation/documentation/swiftui/font) niteleyicisini ekleyebilirsin.
zh_cn: 你可能还注意到了，将 `frame` 添加到 `Text` 视图不会让视图中的实际文本变大，但会让包含文本的视图变得更大。这可让视图容纳更多的文本，但如果想让实际文本变大，你可以将 [font](doc://com.apple.documentation/documentation/swiftui/font)（字体）修饰符添加到文本视图中。
zh_tw: 你可能還會注意到，將 `frame` 加入 `Text` 顯示區並沒有讓顯示區中的實際文字變大，而是讓包含文字的顯示區變大。這能讓顯示區容納更多文字，但如果你想讓實際的文字變大，可以將[字體](doc://com.apple.documentation/documentation/swiftui/font)修飾符加入文字顯示區。

source: Add this modifier below the text view and see how the text changes:
de: Füge diesen Modifikator unter der Textansicht hinzu und sieh dir an, wie sich der Text verändert:
es: Añade este modificador debajo de la vista de texto y observa cómo cambia el texto:
es_419: Agrega este modificador debajo de la visualización de texto y observa cómo cambia el texto:
fr: Ajoute ce modificateur sous la vue de texte et regarde comment le texte change :
it: Aggiungi questo modificatore sotto la vista testo e osserva come cambia il testo:
nl: Voeg deze modifier toe onder de tekstweergave en kijk hoe de tekst verandert:
pt: Adicione este modificador abaixo da visualização de texto e veja como o texto muda:
sv: Lägg till den här modifieraren nedanför textvyn och se hur texten förändras:
th: เพิ่มปุ่มปรับค่านี้ด้านล่างมุมมองข้อความเพื่อดูว่าข้อความเปลี่ยนไปอย่างไร:
tr: Bu niteleyiciyi metin görüntüsünün altına ekle ve metnin nasıl değiştiğini gör:
zh_cn: 在文本视图下方添加这个修饰符，看看文本是如何变化的：
zh_tw: 將這個修飾符加入文字顯示區的下方，並且看看文字會如何改變：

# GuideBook..Guide0..StepMy Journal..TaskGroup0..TaskviewSizingChallenge..title
source: Design Challenge #2: Adjust view sizing
de: Designherausforderung #2: Größe von Ansichten anpassen
es: Reto 2 de diseño: Ajustar el tamaño de las vistas
es_419: Reto de diseño 2: Ajusta el tamaño de las visualizaciones
fr: Défi de conception n° 2 : Ajuster la taille de la vue
it: Attività di progettazione n.2: regolare il ridimensionamento della vista
nl: Ontwerpuitdaging 2: Pas de grootte van weergaven aan
pt: Desafio de Design #2: Ajustar o tamanho da visualização
sv: Designutmaning 2: Justera vystorlekar
th: คำท้าการออกแบบ #2: ปรับขนาดมุมมอง
tr: Tasarım Meydan Okuması 2: Görüntü büyüklüğünü ayarlama
zh_cn: 设计挑战 #2：调整视图大小
zh_tw: 設計挑戰 #2：調整顯示區大小

source: Time for another challenge. Take a look at the preview on the right. See if you can size your views so that your design on the bottom matches the mock-up on top. 🧐
de: Zeit für eine weitere Herausforderung. Sieh dir die Vorschau auf der rechten Seite an. Versuche, die Größe deiner Ansichten so zu ändern, dass dein Design unten mit dem Modell oben übereinstimmt. 🧐
es: ¡Ya es hora de otro reto! Observa la previsualización de la derecha. Mira si puedes redimensionar las vistas para que el diseño de la parte de abajo sea igual que el boceto de arriba. 🧐
es_419: ¡Es hora de otro reto! Echa un vistazo a la vista previa de la derecha. Pregúntate si puedes ajustar el tamaño de tus visualizaciones de modo que tu diseño en la parte inferior coincida con el modelo de la parte superior. 🧐
fr: L’heure est venue de relever un nouveau défi. Jette un œil à l’aperçu sur la droite. Regarde si tu peux redimensionner tes vues pour que ta conception en bas corresponde à la maquette en haut. 🧐
it: È giunta l’ora di un’altra attività! Guarda l’anteprima a destra. Prova a ridimensionare le viste in modo che il design in basso corrisponda al modello in alto. 🧐
nl: Tijd voor nog een uitdaging. Bekijk de voorvertoning aan de rechterkant. Probeer of je de weergaven zo kunt aanpassen dat het ontwerp in de onderste helft overeenkomt met het model in de bovenste helft. 🧐
pt: Hora de mais um desafio. Dê uma olhada na pré‑visualização à direita. Veja se você consegue dimensionar as visualizações para que o design na parte inferior fique igual ao modelo na parte superior. 🧐
sv: Dags för en ny utmaning. Ta en titt på förhandsvisningen till höger. Se om du kan anpassa storleken på vyerna så att designen nedtill matchar modellen upptill. 🧐
th: ถึงเวลาสำหรับคำท้าอีกครั้ง ดูการแสดงตัวอย่างทางด้านขวา ดูว่าคุณสามารถปรับขนาดมุมมองของคุณเพื่อให้การออกแบบของคุณที่ด้านล่างตรงกับตัวอย่างจำลองด้านบนได้หรือไม่ 🧐
tr: Başka bir meydan okuma zamanı. Sağ taraftaki önizlemeye bir bak. Alttaki tasarımının üstteki modelle eşleşmesi için görüntülerinin büyüklüğünü değiştirip değiştiremeyeceğine bak. 🧐
zh_cn: 是时候进行另一个挑战了。看一下右边的预览。你能调整视图的大小，让底部的设计与顶部的模型相吻合吗？🧐
zh_tw: 是時候嘗試另一個挑戰了！看一下右邊的預覽。看你是否可以調整顯示區的大小，讓你底部的設計與頂部的模型互相搭配。🧐

source: You’ll notice that the rectangles in the mock-up are much smaller than in your design. How can you adjust the `Rectangle` views to make them a bit smaller?
de: Dir fällt sicher auf, dass die Rechtecke im Modell viel kleiner sind als in deinem Design. Wie kannst du die `Rectangle`-Ansichten anpassen, um sie ein bisschen kleiner zu machen?
es: Verás que los rectángulos del boceto son mucho más pequeños que los de tu diseño. ¿Cómo puedes ajustar las vistas de `Rectangle` para hacerlas algo más pequeñas?
es_419: Notarás que los rectángulos en el modelo son mucho más pequeños que los que están en tu diseño. ¿Cómo puedes ajustar las visualizaciones `Rectangle` para que sean un poco más pequeñas?
fr: Tu peux remarquer que les rectangles de la maquette sont beaucoup plus petits que ceux de ta conception. Comment peux-tu ajuster les vues `Rectangle` pour les rendre un peu plus petites ?
it: Noterai che i rettangoli nel modello sono molto più piccoli rispetto al design. Come si fa a regolare le viste `Rectangle` per renderle leggermente più piccole?
nl: Het valt je vermoedelijk op dat de rechthoeken in het model veel kleiner zijn dat de rechthoeken in je ontwerp. Hoe kun je de `Rectangle`-weergaven een beetje kleiner maken?
pt: Você notará que os retângulos no modelo são muito menores do que no design. Como você pode ajustar as visualizações `Rectangle` para que elas fiquem um pouco menores?
sv: Du ser att rektanglarna i modellen är mycket mindre än de i designen. Hur kan du justera `Rectangle`-vyerna så att de blir lite mindre?
th: คุณจะสังเกตเห็นว่าสี่เหลี่ยมในตัวอย่างจำลองมีขนาดเล็กกว่าในการออกแบบของคุณมาก คุณสามารถปรับมุมมอง `Rectangle` เพื่อให้สี่เหลี่ยมมีขนาดเล็กลงอีกนิดได้อย่างไร
tr: Modeldeki dikdörtgenlerin tasarımındakilerden çok daha küçük olduğunu fark edeceksin. `Rectangle` görüntülerini biraz daha küçük olmaları için nasıl ayarlayabilirsin?
zh_cn: 你会注意到，模型中的矩形比你的设计小得多。你该如何调整 `Rectangle` 视图，让它们稍微小一点？
zh_tw: 你會注意到模型中的矩形比你的設計小得多。你要如何調整 `Rectangle` 顯示區讓它變得更小一些？
