Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: Add a `frame` in `HalfCard` and set the `maxWidth` and `maxHeight` to `.infinity`. This allows the `frame` to expand to fill any available space offered by the container, `VStack`.
de: Füge `frame` in `HalfCard` ein und lege für `maxWidth` (maximale Breite) und `maxHeight` (maximale Höhe) den Wert `.infinity` (unendlich) fest. So kann `frame` (Rahmen) den verfügbaren Platz füllen, der vom Container `VStack` bereitgestellt wird.
es: Añade un `frame` en `HalfCard` y establece en `.infinity` los valores de `maxWidth` y `maxHeight`. De esta manera el `frame` se expandirá para rellenar cualquier espacio disponible que ofrezca el contenedor, `VStack`.
es_419: Agrega un marco (`frame`) en `HalfCard` y configura los valores máximos de ancho y alto (`maxWidth` y `maxHeight`) como `.infinity`. Esto permitirá que el marco se expanda para rellenar el espacio disponible que tenga el contenedor, en este caso la pila `VStack`.
fr: Ajoute `frame` dans `HalfCard` et définis `maxWidth` et `maxHeight` sur `.infinity`. Ceci permet à `frame` de se développer pour remplir tout l’espace disponible dans le conteneur, `VStack`.
it: Aggiungi `frame` in `HalfCard` e imposta `maxWidth` e `maxHeight` su `.infinity`. In questo modo, consenti a `frame` di espandersi per riempire tutto lo spazio disponibile nel contenitore `VStack`.
nl: Voeg een `frame` toe in `HalfCard` en stel de `maxWidth` en `maxHeight` in op `.infinity`. Zo kan het `frame` de door de container `VStack` beschikbaar gestelde ruimte vullen.
pt: Adicione um `frame` em `HalfCard` e defina `maxWidth` e `maxHeight` como `.infinity`. Isso permite que `frame` se expanda para preencher qualquer espaço disponível oferecido pelo contêiner, `VStack`.
sv: Lägg till en `frame` i `HalfCard` och ställ in `maxWidth` och `maxHeight` som `.infinity`. Det gör så att `frame` kan expandera och fylla allt tillgängligt innehåll som finns i `VStack`.
th: เพิ่ม `frame` ใน `HalfCard` และตั้งค่าบัตร `maxWidth` และ `maxHeight` เป็น `.infinity` การทำเช่นนี้จะทำให้ `frame` ขยายเพื่อเติมเต็มพื้นที่ว่างที่คอนเทนเนอร์ `VStack` มีให้ได้
tr: `HalfCard`’a bir `frame` ekleyip `maxWidth`’i ve `maxHeight`’ı `.infinity` olarak ayarla. Bu, `frame`’in kapsayıcı (`VStack`) tarafından sunulan kullanılabilir alanın tümünü dolduracak şekilde genişlemesini sağlar.
zh_cn: 在 `HalfCard` 中添加一个 `frame`，然后将 `maxWidth` 和 `maxHeight`（最大高度）设为 `.infinity`。这可让 `frame` 扩展以填充 `VStack` 容器提供的任何可用空间。
zh_tw: 在 `HalfCard` 中添入一個 `frame` 並將 `maxWidth` 和 `maxHeight` 設定為 `.infinity`。這能讓 `frame` 擴展以填滿容器 `VStack` 所提供的任何可用空間。

source: Even though the frame expanded, all of the graphics are still squished together.
de: Trotz des erweiterten Rahmens sind die Grafiken immer noch alle zusammengequetscht.
es: A pesar de que se amplió el marco, todos los gráficos siguen aplastados entre sí.
es_419: Incluso con el marco expandido, todos los gráficos siguen estando amontonados.
fr: Même si l’image s’est agrandie, tous les graphismes sont toujours entassés.
it: Anche se la cornice si è espansa, tutte le grafiche risultano ancora schiacciate.
nl: Hoewel het `frame` groter is geworden, worden alle plaatjes nog steeds samengedrukt.
pt: Embora a moldura tenha se expandido, todos os gráficos ainda estão espremidos juntos.
sv: Trots att ramen expanderade är all grafik fortfarande hopklämd.
th: ถึงแม้จะขยายกรอบแล้ว กราฟิกทั้งหมดก็ยังคงบีบอยู่ด้วยกัน
tr: Çerçeve genişletilmiş olmasına rağmen grafiklerin tümü hâlâ sıkışık görünüyor.
zh_cn: 即使扩展了框架，但所有图形还是被挤压在一起。
zh_tw: 即使外框擴大了，所有的圖形仍然擠在一起。

source: Add another border above the `frame` modifier. This allows you to see the outline of the `VStack` before you apply the `frame`.
de: Füge einen weiteren Rand über dem `frame`-Modifikator hinzu. So siehst du die Kontur von `VStack`, bevor du `frame` anwendest.
es: Añade otro borde por encima del modificador `frame`. De esta manera podrás ver el contorno de `VStack` antes de aplicar el `frame`.
es_419: Agrega otro borde arriba del modificador `frame`. Esto te permitirá observar el contorno de la pila `VStack` antes de aplicar el marco.
fr: Ajoute une autre bordure au-dessus du modificateur `frame`. Ceci te permet d’afficher le contour de `VStack` avant d’appliquer `frame`.
it: Aggiungi un altro bordo sopra il modificatore `frame`. In questo modo puoi vedere il contorno di `VStack` prima di applicare `frame`.
nl: Voeg nog een rand boven de `frame`-modifier toe. Zo kun je de omtrek van de `VStack` zien voordat je het `frame` toepast.
pt: Adicione uma outra borda acima do modificador `frame`. Isso permite que você veja o contorno do `VStack` antes de aplicar o `frame`.
sv: Lägg till en annan ram ovanför `frame`-modifieraren. Det gör att du kan se konturen för `VStack` innan du använder `frame`.
th: เพิ่มเส้นขอบอื่นด้านบนปุ่มปรับค่า `frame` การทำเช่นนี้จะทำให้คุณเห็นเค้าโครงของ `VStack` ก่อนที่คุณจะปรับใช้ `frame`
tr: `frame` niteleyicisinin üstüne başka bir kenar ekle. Bu, `frame`’i uygulamadan `VStack`’in çerçevesini görmeni sağlar.
zh_cn: 在 `frame` 修饰符上方添加另一个边界。这可让你在应用 `frame` 之前看到 `VStack` 的轮廓。
zh_tw: 在 `frame` 修飾符上方加入另一個邊框。這能讓你在套用 `frame` 之前先檢視 `VStack` 的輪廓。

source: You might wonder, why would it make a difference if you apply the border before or after the `frame`? This is because you actually produce a new view each time you apply a modifier, so the [order that you apply them really matters](doc://com.apple.documentation/documentation/swiftui/configuring-views).
de: Du wunderst dich wahrscheinlich, warum es einen Unterschied macht, wenn du den Rand vor oder nach `frame` anwendest. Der Grund dafür ist, dass du eigentlich jedes Mal, wenn du einen Modifikator anwendest, eine neue Ansicht erstellst. Die [Reihenfolge, in der du sie anwendest, ist also sehr wichtig](doc://com.apple.documentation/documentation/swiftui/configuring-views).
es: Puede que te preguntes si habría alguna diferencia si aplicaras el borde antes o después de `frame`. Esto es así porque de hecho estás creando una nueva vista cada vez que aplicas un modificador, de manera que el [orden en el que los aplicas sí que importa](doc://com.apple.documentation/documentation/swiftui/configuring-views).
es_419: Es posible que te estés preguntando si habría alguna diferencia si aplicas el borde antes o después del marco. Pues sí la habría, y es porque cada vez que aplicas un modificador, en realidad estás creando una visualización nueva, así que el [orden en el que los aplicas importa mucho](doc://com.apple.documentation/documentation/swiftui/configuring-views).
fr: Tu te demandes peut-être en quoi cela fait une différence si tu appliques la bordure avant ou après `frame`. Et bien c’est parce que tu produis en fait une nouvelle vue chaque fois que tu appliques un modificateur, pour que [l’ordre dans lequel tu les appliques soit vraiment important](doc://com.apple.documentation/documentation/swiftui/configuring-views).
it: Forse ti starai chiedendo: perché applicare il bordo prima o dopo `frame` fa la differenza? Ciò accade perché in effetti produci una nuova vista ogni volta che applichi un modificatore, quindi [l’ordine in cui applichi i modificatori è molto importante](doc://com.apple.documentation/documentation/swiftui/configuring-views).
nl: Je vraagt je misschien af waarom het uitmaakt of je de rand voor of na het `frame` toevoegt? De reden hiervoor is dat je steeds een nieuwe weergave aanmaakt wanneer je een modifier toepast, waardoor de [volgorde waarin je ze toepast van belang is](doc://com.apple.documentation/documentation/swiftui/configuring-views).
pt: Você pode se perguntar: faz diferença aplicar a borda antes ou depois do `frame`? Sim, porque na verdade você produz uma nova visualização sempre que aplica um modificador, fazendo com que a ordem em que você o aplica seja importante ([order that you apply them really matters](doc://com.apple.documentation/documentation/swiftui/configuring-views)).
sv: Du kanske undrar varför det spelar någon roll ifall du använder ramen före eller efter `frame`? Det beror på att du faktiskt skapar en ny vy varje gång du använder en modifierare, så [ordningen du skapar dem i spelar faktiskt roll](doc://com.apple.documentation/documentation/swiftui/configuring-views).
th: คุณอาจสงสัยว่าเหตุใดการปรับใช้เส้นขอบก่อนหรือหลัง `frame` จึงแตกต่างกัน นั่นเป็นเพราะจริงๆ แล้วคุณสร้างมุมมองใหม่ทุกครั้งที่คุณปรับใช้ปุ่มปรับค่า ดังนั้น[ลำดับที่คุณปรับใช้จึงสำคัญจริงๆ](doc://com.apple.documentation/documentation/swiftui/configuring-views)
tr: Kenarı `frame`’den önce veya sonra uygulamanın ne fark ettireceğini merak ediyor olabilirsin. Bunun nedeni, her niteleyici uyguladığında aslında yeni bir görüntü oluşturuyor olmandır, bu nedenle [bunları uyguladığın sıra gerçekten önemlidir](doc://com.apple.documentation/documentation/swiftui/configuring-views).
zh_cn: 你可能会有疑问，在 `frame` 之前或之后应用边界为什么会有区别？这是因为每次你应用修饰符时，实际上生成了一个新的视图，所以[应用的顺序非常重要](doc://com.apple.documentation/documentation/swiftui/configuring-views)。
zh_tw: 你可能想知道，如果在 `frame` 的前面或後面套用邊框，為什麼會有所不同？這是因為每次套用修飾符時，實際上都會產生一個新的顯示區，因此[套用它們的順序非常重要](doc://com.apple.documentation/documentation/swiftui/configuring-views)。

source: Look at the difference in the blue and green borders. The blue border surrounds the squished graphics in the `VStack`, but doesn’t expand into the empty surrounding space of the green `frame`.
de: Schau dir den Unterschied zwischen dem blauen und grünen Rand an. Der blaue Rand umrandet die zusammengequetschten Grafiken in `VStack`. Er ragt aber nicht in den leeren Platz der Instanz von `frame`, die einen grünen Rahmen erzeugt, hinein.
es: Fíjate en la diferencia que hay entre el borde azul y el verde. El azul rodea los gráficos aplastados en el contenedor `VStack`, pero no se amplía hacia el espacio que rodea el `frame` verde.
es_419: Fíjate en la diferencia que hay entre el borde azul y el verde: el azul rodea los gráficos amontonados en `VStack`, pero no se expande hacia el espacio vacío que rodea el marco verde.
fr: Regarde la différence entre les bordures bleue et verte. La bordure bleue entoure les graphismes entassés dans la `VStack`, mais ne s’agrandit pas autour de l’espace vide entourant le `frame` vert.
it: Osserva la differenza tra i bordi blu e verdi. Il bordo blu circonda le grafiche schiacciate in `VStack`, ma non si espande nello spazio vuoto circostante al `frame` verde.
nl: Kijk naar het verschil tussen de blauwe en groene rand. De blauwe rand wordt rond de samengedrukte afbeeldingen in de `VStack` weergegeven, maar vult niet de lege ruimte rondom het groene `frame`.
pt: Repare nas diferenças das bordas azul e verde. A borda azul envolve os gráficos espremidos no `VStack`, mas não se expande até o espaço vazio do `frame` verde que a cerca.
sv: Ta en titt på skillnaden mellan den blå och gröna ramen. Den blå ramen omgärdar den hopklämda grafiken i `VStack`, men den expanderar inte in på det tomma utrymmet runt din gröna `frame`.
th: ดูที่ความแตกต่างของเส้นขอบสีน้ำเงินและสีเขียว เส้นขอบสีน้ำเงินล้อมรอบกราฟิกที่ถูกบีบใน `VStack` แต่จะไม่ขยายไปยังพื้นที่ว่างที่ล้อมรอบด้วย `frame` สีเขียว
tr: Mavi ve yeşil kenarlar arasındaki farka bak. Mavi kenar `VStack`’teki sıkışık grafikleri sarmalıyor ama yeşil `frame`’i sarmalayan boş alana genişlemiyor.
zh_cn: 看看蓝色和绿色边界的区别。蓝色边界包围着 `VStack` 中被挤压的图形，但不会扩展到绿色 `frame` 周围的空白空间。
zh_tw: 看看藍色和綠色邊框的差別。藍色邊框圍繞著 `VStack` 中被擠壓的圖形，但不會擴展到綠色 `frame` 的空白周圍空間。

source: Can you think of anyway to fix this so the contents of the `VStack` fill the entire `frame`?
de: Hast du eine Idee, was du tun kannst, damit die Inhalte von `VStack` die gesamte Instanz von `frame` füllen?
es: ¿Se te ocurre alguna manera de corregir esto para que el contenido del `VStack` rellene todo el `frame`?
es_419: ¿Se te ocurre alguna manera de corregir esto para que el contenido de `VStack` rellene todo el marco?
fr: Trouves-tu un moyen de corriger ce problème pour que le contenu de `VStack` remplisse entièrement `frame` ?
it: Riesci a pensare a come risolvere questo problema in modo che il contenuto di `VStack` riempia l’intero `frame`?
nl: Kun je bedenken hoe je ervoor kunt zorgen dat de inhoud van de `VStack` het hele `frame` vult?
pt: Você consegue pensar em alguma maneira de corrigir isso para que o conteúdo do `VStack` preencha todo o `frame`?
sv: Kan du komma på något sätt att lösa det här så att innehållet i `VStack` fyller hela `frame`?
th: คุณคิดออกไหมว่าจะแก้ไขปัญหานี้อย่างไร เพื่อให้เนื้อหาของ `VStack` เติมเต็ม `frame` ทั้งหมด
tr: `VStack` içeriğinin `frame`’in tamamını doldurması için aklına bunu düzeltmenin bir yolu geliyor mu?
zh_cn: 你能想到什么办法来解决这个问题，让 `VStack` 的内容填满整个 `frame` 吗？
zh_tw: 你能想辦法解決這個問題，讓`VStack`的內容填滿整個 `frame` 嗎？

source: Think about the order of these modifiers on your `VStack`:
de: Denke an die Reihenfolge dieser Modifikatoren in `VStack`:
es: Piensa en el orden que tienen estos modificadores en el contenedor `VStack`:
es_419: Considera el orden de estos modificadores en tu `VStack`:
fr: Pense à l’ordre de ces modificateurs dans ta `VStack` :
it: Pensa all’ordine di questi modificatori in `VStack`:
nl: Bekijk de volgorde van deze modifiers in de `VStack`:
pt: Pense na ordem desses modificadores no `VStack`:
sv: Tänk på ordningen på de här modifierarna i din`VStack`:
th: นึกถึงลำดับของปุ่มปรับค่าเหล่านี้บน `VStack` ของคุณ:
tr: `VStack`’inde bu niteleyicilerin sırasını düşün:
zh_cn: 想想 `VStack` 中这些修饰符的顺序：
zh_tw: 思考一下這些修飾符在 `VStack` 上的順序：

source: You create an `overlay`, which places another `VStack` directly on top of the top-level `VStack`.
de: Du erstellst eine Instanz von `overlay`, die eine weitere Instanz von `VStack` direkt über der obersten Instanz von `VStack` platziert.
es: Creas una `overlay`, que coloca otro contenedor `VStack` directamente encima del `VStack` de nivel superior.
es_419: Puedes crear una sobreposición (`overlay`) que coloque otra `VStack` directamente arriba de la pila `VStack` de nivel superior.
fr: Tu crées un `overlay`, qui place une autre `VStack` directement au-dessus de ta `VStack` du plus haut niveau.
it: Crea `overlay`, che comporta il posizionamento di un altro `VStack` direttamente sopra a `VStack` del livello superiore.
nl: Je maakt een `overlay` aan waarmee je een nieuwe `VStack` boven op de `VStack` op het hoogste niveau plaatst.
pt: Você cria um `overlay`, que coloca outro `VStack` diretamente sobre o `VStack` de nível superior.
sv: Du skapar ett `overlay` som placerar en annan `VStack` direkt ovanpå `VStack` på översta nivån.
th: คุณสร้าง `overlay` ซึ่งวาง `VStack` อื่นที่ด้านบนของ `VStack` ระดับบนสุดโดยตรง
tr: En üst düzeydeki `VStack`’in tam üstüne başka bir `VStack` yerleştiren bir `overlay` yaratırsın.
zh_cn: 你创建了一个 `overlay`（叠层），将另一个 `VStack` 直接放在了顶层 `VStack` 的上面。
zh_tw: 你要建立一個 `overlay`，它會直接將另一個 `VStack` 放在最上層 `VStack` 的上方。

source: You expand the `frame` of the top-level `VStack`, placing an empty border space around it.
de: Du erweiterst die Instanz von `frame` in der obersten Instanz von `VStack`, um einen nicht gefüllten leeren Rahmen um das Objekt zu platzieren.
es: Amplía el `frame` del contenedor `VStack` del nivel superior, colocando un espacio de borde vacío en torno a él.
es_419: Puedes expandir el marco (`frame`) de la pila `VStack` de nivel superior, colocando un espacio de borde vacío a su alrededor.
fr: Tu développes le `frame` de la `VStack` du plus haut niveau, ce qui place une bordure vide autour.
it: Espandi `frame` di `VStack` del livello superiore, applicandovi intorno un bordo vuoto.
nl: Je vergroot het `frame` van de `VStack` op het hoogste niveau, waarbij je een lege ruimte voor de rand toevoegt.
pt: Você expande o `frame` do `VStack` de nível superior, colocando um espaço de borda vazio ao seu redor.
sv: Du expanderar `frame` för `VStack` på översta nivån och placerar ett tomt ramutrymme runt den.
th: คุณขยาย `frame` ของ `VStack` ระดับบนสุด โดยวางพื้นที่เส้นขอบว่างไว้รอบๆ
tr: En üst düzeydeki `VStack`’in `frame`’ini genişletir ve çevresine boş bir kenar alanı yerleştirirsin.
zh_cn: 你扩展了顶层 `VStack` 的 `frame`，在它周围放置了空白的边界空间。
zh_tw: 你展開最上層 `VStack` 的 `frame`，在它的周圍放置一個空白邊框空間。

source: What if you switched up the order of the `overlay` and the `frame`? That would allow you to expand the `frame` first, which gives you extra space, then apply the `overlay` where it fits.
de: Was wäre denn, wenn du die Reihenfolge von `overlay` (Überlagerung) und `frame` ändern würdest? Auf diese Weise könntest du zuerst die Instanz von `frame` für zusätzlichen Platz erweitern und dann `overlay` anwenden, wo es passt.
es: ¿Y si cambiaras el orden de `overlay` y `frame`? Eso te permitiría ampliar primero el `frame`, lo que te daría un espacio extra y, a continuación, aplicar la `overlay` (superposición) donde quepa.
es_419: ¿Qué pasaría si cambias el orden de `overlay` y de `frame`? Esto permitiría expandir primero el marco, lo que te daría espacio adicional, y luego podrías aplicar la sobreposición donde quepa.
fr: Et si tu inversais l’ordre de `overlay` et de `frame` ? Cela te permettrait de développer `frame` en premier, ce qui t’octroie plus d’espace. Applique ensuite `overlay` où il passe.
it: E se invertissi l’ordine di `overlay` e `frame`? In questo modo potresti espandere prima `frame`, che ti fornisce spazio aggiuntivo, e poi applicare `overlay` dove meglio si adatta.
nl: Wat zou er gebeuren als je de volgorde van de `overlay` en het `frame` omdraait? Zo zou je eerst het `frame` kunnen vergroten, waardoor er extra ruimte ontstaat en vervolgens de `overlay` kunnen toepassen in de beschikbare ruimte.
pt: E se você invertesse a ordem do `overlay` e do `frame`? Isso permitiria que você expandisse o `frame` primeiro, o que daria espaço extra, e depois aplicasse o `overlay` ao local onde ele encaixasse.
sv: Vad händer om du ändrar ordningen på `overlay` och `frame`? Det innebär att du kan expandera `frame` först, så att du får större utrymme, och sedan använda `overlay` där det ryms.
th: จะเกิดอะไรขึ้นหากคุณปรับเปลี่ยนลำดับของ `overlay` และ `frame` การทำเช่นนั้นจะช่วยให้คุณสามารถขยาย `frame` ก่อน ซึ่งจะทำให้คุณมีพื้นที่ว่างเพิ่ม จากนั้นจึงปรับใช้ `overlay` ในตำแหน่งที่พอดี
tr: `overlay` ile `frame`’in sırasını değiştirsen ne olur? Bu şekilde önce `frame`’i genişleterek ekstra alan kazanır, sonra da `overlay`’i sığacağı bir yere uygulamış olursun.
zh_cn: 如果你调转 `overlay` 和 `frame` 的顺序会怎么样呢？这可让你先扩展 `frame` 以获得额外的空间，然后在合适的位置应用 `overlay`。
zh_tw: 如果你對調了 `overlay` 和 `frame` 的順序呢？這會讓你首先展開 `frame`，進而為你提供額外的空間，然後在適合的位置套用 `overlay`。

source: Try removing the existing `frame` and add a new one right below the top-level `VStack`, but above the `overlay` modifier:
de: Versuche, die bereits vorhandene Instanz von `frame` zu entfernen und füge eine neue direkt unter der obersten Instanz von `VStack`, aber über dem `overlay`-Modifikator ein:
es: Prueba a eliminar el `frame` existente y añade otro justo debajo del `VStack` de nivel superior, pero por encima del modificador `overlay`:
es_419: Intenta eliminar el modificador `frame` existente y agrega otro justo debajo de la pila `VStack` de nivel superior, pero arriba del modificador `overlay`:
fr: Essaie de supprimer le `frame` actuel et d’en ajouter un nouveau juste en dessous de la `VStack` du plus haut niveau, mais au-dessus du modificateur `overlay` :
it: Prova a rimuovere `frame` esistente e ad aggiungerne uno nuovo proprio sotto `VStack` del livello superiore, ma sopra il modificatore `overlay`:
nl: Verwijder het bestaande `frame` en voeg een nieuw `frame` toe direct onder de `VStack` op het hoogste niveau, maar boven de `overlay`-modifier:
pt: Tente remover o `frame` existente e adicionar um novo, diretamente abaixo do `VStack` de nível superior, mas acima do modificador `overlay`:
sv: Prova att ta bort din befintliga `frame` och lägga till en ny direkt nedanför `VStack` på översta nivån, men ovanför `overlay`-modifieraren:
th: ลองเอา `frame` ที่มีอยู่ออก แล้วเพิ่มกรอบใหม่ด้านล่าง `VStack` ระดับบนสุด แต่ให้อยู่ด้านบนปุ่มปรับค่า `overlay`:
tr: Var olan `frame`’i silip en üst düzeydeki `VStack`’in hemen altına ama `overlay` niteleyicisinin üst tarafına yeni bir tane eklemeyi dene:
zh_cn: 尝试移除现有的 `frame`，并直接在顶层 `VStack` 的下方（但在 `overlay` 修饰符的上方）添加一个新的 `frame`：
zh_tw: 嘗試移除現有的 `frame` 並在最上層的 `VStack` 下方加入一個新的，但位於 `overlay` 修飾符的上方：

source: Much better. There is just one more thing to fix. By default any content inside the `frame` is center-aligned. However, the crown at the center of the `HalfCard` needs to align to the bottom edge of `HalfCard.`
de: Viel besser. Es gibt nur noch ein Problem, das du beheben musst. Standardmäßig werden alle Inhalte in `frame` zentriert. Allerdings muss die Krone in der Mitte von `HalfCard` an der unteren Kante von `HalfCard` ausgerichtet werden.
es: Mucho mejor. Solo hay una cosa más que corregir. Por omisión, cualquier contenido incluido en el `frame` se centra. Sin embargo, la corona situada en el centro de la `HalfCard` debe estar alineada al borde inferior de `HalfCard.`
es_419: Mucho mejor, pero queda una cosa más por corregir. De forma predeterminada, el contenido que está dentro de `frame` se alinea en el centro. Sin embargo, la corona que está en el centro de `HalfCard` debe alinearse en el borde inferior.
fr: C’est bien mieux. Il reste un dernier problème à corriger. Par défaut, tout contenu qui se trouve dans `frame` est aligné au centre. Toutefois, la couronne située au centre de `HalfCard` doit être alignée avec le bord inférieur de `HalfCard.`
it: Molto meglio. Manca solo un ultimo aspetto da sistemare. Di default, qualsiasi contenuto all’interno di `frame` viene allineato al centro. Tuttavia, la corona al centro di `HalfCard` deve essere allineata al bordo inferiore di `HalfCard.`
nl: Dat is een stuk beter. Je hoeft nog maar één ding op te lossen. Standaard wordt de inhoud van het `frame` in het midden uitgelijnd. De kroon in het midden van de `HalfCard` moet echter worden uitgelijnd met de onderrand van `HalfCard.`
pt: Bem melhor. Só há mais uma coisa a corrigir. Por padrão, qualquer conteúdo dentro do `frame` é alinhado ao centro. No entanto, a coroa no centro de `HalfCard` precisa ser alinhada à margem inferior de `HalfCard.`
sv: Mycket bättre. Det finns bara en sak till att fixa. Som förval är allt innehåll i `frame` centrerat. Kronan i mitten av `HalfCard` måste dock justeras till den nedre kanten på `HalfCard.`
th: ดีขึ้นมากเลย เหลือเพียงสิ่งเดียวที่ต้องแก้ไข ตามค่าเริ่มต้น เนื้อหาต่างๆ ภายใน `frame` จะจัดแนวอยู่ตรงกลาง แต่มงกุฎที่กึ่งกลางของ `HalfCard` ต้องจัดแนวอยู่ชิดขอบด้านล่างสุดของ `HalfCard`
tr: Çok daha iyi. Düzeltilecek bir şey daha var. `frame`’deki içerikler saptanmış olarak ortaya hizalı. Ancak `HalfCard`’ın ortasındaki tacın `HalfCard`’ın alt kenarıyla hizalı olması gerekiyor.
zh_cn: 好多了。只剩一件事情需要解决。`frame` 中的所有内容默认居中对齐。但是，`HalfCard` 中间的皇冠需要对齐 `HalfCard` 的底部边缘。
zh_tw: 好多了。還有一個東西要修正。在預設情況下，`frame` 內的任何內容都是置中對齊的。但是，`HalfCard` 中心的皇冠需要與 `HalfCard` 的底部邊緣對齊。
