Repository: Mattds825/SwiftUI-Journal-App-Laying-out-views-tutorial-.swiftpm
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, nl, pt, sv, th, tr, zh_cn, zh_tw

source: To enable the button to add the half-card sleep tracker, set `disableSleepViewHalf` to `false`:
de: Um es der Taste zu ermöglichen, den Schlaftracker in halber Kartengröße hinzuzufügen, lege für `disableSleepViewHalf` (halbe Schlafansicht deaktivieren) den Wert `false` fest:
es: Para activar el botón para añadir la media tarjeta del módulo de seguimiento del sueño, establece `disableSleepViewHalf` en `false`:
es_419: Para mostrar el botón para agregar el monitor de sueño de media carta, configura `disableSleepViewHalf` como `false`:
fr: Pour activer le bouton permettant dʼajouter le moniteur de sommeil dʼune demi-carte, définis `disableSleepViewHalf` sur `false` :
it: Per abilitare il pulsante per aggiungere il tracker del sonno a scheda dimezzata, imposta `disableSleepViewHalf` su `false`:
nl: Stel `disableSleepViewHalf` in op `false` om de knop in te schakelen waarmee de slaaptracker in de halve kaart wordt toegevoegd:
pt: Para ativar o botão para adicionar o meio cartão do rastreador de sono, defina `disableSleepViewHalf` como `false`:
sv: Aktivera knappen som lägger till sömnspåraren i halvkortsformat genom att ställa in `disableSleepViewHalf` på `false`:
th: ในการเปิดใช้งานปุ่มเพื่อเพิ่มตัวติดตามการนอนหลับแบบครึ่งบัตร ให้ตั้งค่า `disableSleepViewHalf` เป็น `false`:
tr: Yarım kart uyku izleyiciyi ekleme düğmesini etkinleştirmek için `disableSleepViewHalf`’ı `false` olarak ayarla:
zh_cn: 如果要启用按钮来添加一半卡片大小的睡眠跟踪器，你可以将 `disableSleepViewHalf`（停用睡眠视图一半）设为 `false`：
zh_tw: 若要啟用按鈕來加入半張卡片的睡眠追蹤器，請將 `disableSleepViewHalf` 設定為 `false`：

source: Now try adding a half-card sleep tracker in the app preview of the journal app. You can do this by tapping “New Entry” and the Add button (+) to create a new card. The half-card sleep tracker button is enabled.
de: Versuche nun, in der Vorschau der Tagebuch-App einen Schlaftracker in halber Kartengröße hinzuzufügen. Tippe dafür auf „Neuen Eintrag“ und auf die Taste zum Hinzufügen (+), um eine neue Karte zu erstellen. Die Taste für den Schlaftracker in halber Kartengröße ist aktiviert.
es: Trata ahora de añadir un módulo de seguimiento del sueño que ocupe media tarjeta en la vista previa de la app de diario. Para ello, toca “Nueva entrada” y el botón de añadir (+) para crear una nueva tarjeta. Se activará el botón de media tarjeta de seguimiento de sueño.
es_419: Ahora intenta agregar un monitor de sueño de media carta en la previsualización de la app de diario. Para esto, selecciona Nueva entrada y luego toca el botón Agregar (+) para crear una carta nueva. Con esto, se habilitará el botón del monitor de sueño de media carta.
fr: À présent, essaie d’ajouter un moniteur de sommeil d’une demi-carte dans l’aperçu dʼapp de lʼapp de journal. Tu peux le faire en touchant « Nouvelle entrée » et le bouton Ajouter (+) pour créer une nouvelle carte. Le bouton du moniteur de sommeil de demi-carte est activé.
it: Ora prova ad aggiungere un tracker del sonno a scheda dimezzata nell’anteprima dell’app diario. Puoi farlo toccando “Nuova voce” e il pulsante Aggiungi (+) per creare una nuova scheda. Il pulsante del tracker del sonno a scheda dimezzata risulta abilitato.
nl: Voeg nu een slaaptracker in een halve kaart toe aan de appvoorvertoning van de dagboekapp. Je kunt dit doen door op 'Nieuwe notitie' en de plusknop (+) te tikken om een nieuwe kaart aan te maken. De knop voor de slaaptracker in een halve kaart is nu ingeschakeld.
pt: Agora, tente adicionar um meio cartão do rastreador de sono na pré‑visualização do app de diário. Para fazer isso, toque em “Nova Entrada” e no botão Adicionar (+) para criar um cartão novo. O botão do meio cartão do rastreador de sono é ativado.
sv: Försök nu att lägga till ett halvt kort med sömnspåraren i appförhandsvisningen i journalappen. Du kan göra det genom att trycka på knappen ”Ny post” och lägg till-knappen (+) för att skapa ett nytt kort. Sömnspåraren i halvkortsformat aktiveras.
th: ตอนนี้ให้ลองเพิ่มตัวติดตามการนอนหลับแบบครึ่งบัตรลงในการแสดงตัวอย่างแอปของแอปบันทึกประจำวัน คุณสามารถทำเช่นนี้ได้โดยการแตะ “รายการใหม่” และปุ่มเพิ่ม (+) เพื่อสร้างบัตรใหม่ โดยปุ่มตัวติดตามการนอนหลับแบบครึ่งบัตรเปิดใช้งานอยู่
tr: Şimdi yarım kart uyku izleyiciyi günlük uygulamasının önizlemesine eklemeyi dene. “Yeni Giriş”e ve Ekle düğmesine (+) dokunup yeni bir kart yaratarak bunu yapabilirsin. Yarım kart uyku izleyici düğmesi etkinleştirilir.
zh_cn: 现在试试在日记 App 的 App 预览中，添加一个一半卡片大小的睡眠跟踪器。你可以轻点“新建条目”和“添加”按钮 (+) 来创建新的卡片。一半卡片大小的睡眠跟踪器按钮已启用。
zh_tw: 現在嘗試在日記 App 的 App 預覽中加入半張卡片的睡眠追蹤器。你可以點按「新增項目」和「加入」按鈕（+）來製作新的卡片。半張卡片的睡眠追蹤器按鈕已經啟用。

source: Yay! You finished creating the half-card view for sleep tracker. Time to check-in with the designer on your team.
de: Super! Du bist mit dem Erstellen der Kartenansicht für den Schlaftracker in halber Größe fertig. Zeige das Ergebnis jetzt der Designabteilung.
es: ¡Genial! Has terminado de crear la vista de media tarjeta para el módulo de seguimiento del sueño. Ahora tienes que verlo con el equipo de diseño.
es_419: ¡Genial! Terminaste de crear la visualización de media carta para el monitor de sueño. Ahora puedes enviarla al diseñador de tu equipo para su revisión.
fr: Bravo ! Tu as terminé la création de la vue en demi-carte pour le moniteur de sommeil. Il est temps de faire le point avec le concepteur de ton équipe.
it: Evviva! Hai finito di creare la vista a scheda dimezzata per il tracker del sonno. È ora di ricontrollare tutto con il designer del team.
nl: Joepie! Je hebt een halfgrote kaartweergave voor de slaaptracker aangemaakt. Nu is het tijd om met de ontwerper in je team te overleggen.
pt: Maravilha! Você terminou de criar a visualização de meio cartão do rastreador de sono. É hora de verificar com a pessoa responsável pelo design na sua equipe.
sv: Ja! Du är klar med det halva kortet för sömnspåraren. Dags att stämma av med designern i teamet.
th: เย้! คุณสร้างมุมมองแบบครึ่งบัตรสำหรับตัวติดตามการนอนหลับเสร็จแล้ว ถึงเวลาตรวจสอบกับนักออกแบบในทีมของคุณ
tr: Yaşasın! Uyku izleyici için yarım kart görüntüsünü yaratmayı bitirdin. Ekibindeki tasarımcıya kontrol ettirme zamanı.
zh_cn: 耶！你为睡眠跟踪器创建好了一半卡片大小的视图。是时候与团队的设计师沟通一下了。
zh_tw: 太好了！你已為睡眠追蹤器製作了半張卡片的顯示區。是時候與團隊的設計師一同查看了。

# GuideBook..Guide0..StepMy Journal..TaskGroup1..Tasksleeptracker2..title
source: Polishing touches for your sleep tracker view
de: Feinheiten für deine Schlaftracker-Ansicht
es: Perfeccionar la vista del módulo de seguimiento del sueño
es_419: Últimos retoques para la visualización del monitor de sueño
fr: Touches de finition pour la vue de ton moniteur de sommeil
it: Ultimi ritocchi per la vista del tracker del sonno
nl: De laatste hand leggen aan de slaaptrackerweergave
pt: Retoques finais da visualização do rastreador de sono
sv: Finputsning av sömnspårarvyn
th: การปรับแต่งสำหรับมุมมองตัวติดตามการนอนหลับของคุณ
tr: Uyku izleyici görüntün için son rötuşlar
zh_cn: 给睡眠跟踪器视图润色
zh_tw: 修飾你的睡眠追蹤器顯示區

source: You did great! However, the designer pointed out some small differences between your views and their mock-up. Time to polish up the app design so you can call it a day!
de: Das hast du hervorragend gemacht! Aber die Designabteilung hat einige kleinere Unterschiede zwischen deinen Ansichten und ihrem Modell gefunden. Also müssen jetzt noch die letzten Feinheiten am App-Design erledigt werden, damit du Feierabend machen kannst!
es: Lo has hecho muy bien. Sin embargo, el equipo de diseño señaló que hay algunas pequeñas diferencias entre tus vistas y el boceto. Vamos a pulir el diseño de la app para dar por terminado el trabajo.
es_419: ¡Excelente trabajo! Sin embargo, el diseñador indicó que hay algunas ligeras diferencias entre tus visualizaciones y el modelo. ¡Ahora toca dar los últimos toques para pulir tu creación!
fr: Tu as fait du bon travail ! Cependant, le concepteur a souligné quelques petites différences entre tes vues et sa maquette. Le moment est venu d’apporter les dernières touches de finition à la conception de lʼapp pour avoir terminé pour de bon !
it: Ottimo lavoro! Ricorda però che il designer ha indicato alcune piccole differenze tra le viste e il modello. Ci sei quasi: è l’ora dei ritocchi finali al design dell’app!
nl: Je hebt het geweldig gedaan! De ontwerper heeft je echter op een paar kleine verschillen gewezen tussen jouw weergaven en het model. Tijd om de laatste puntjes op de i te zetten!
pt: Bom trabalho! No entanto, a pessoa responsável pelo design apontou algumas pequenas diferenças entre as visualizações e o modelo fornecido. É hora de aprimorar o design do app para terminar!
sv: Snyggt jobbat, men designern påpekade några små skillnader mellan dina vyer och modellen. Dags att finputsa appdesignen så att du äntligen blir klar!
th: คุณทำได้ดีมาก! แต่นักออกแบบชี้ให้เห็นความแตกต่างเล็กน้อยระหว่างมุมมองของคุณและตัวอย่างจำลอง ถึงเวลาปรับแต่งการออกแบบแอปเพื่อให้คุณเสร็จงานของวันนี้แล้ว!
tr: Harikasın! Ancak tasarımcı senin görüntülerinle kendi modeli arasında bazı küçük farklılıklara dikkat çekti. Bugünlük bu kadar yeter demeden önce uygulama tasarımında biraz rötuş yapma zamanı!
zh_cn: 你太棒了！但是设计师发现，你的视图和他的模型之间存在一些细小的差异。是时候润色一下 App 设计，然后收工！
zh_tw: 你做得很棒！但是，設計者指出了你的顯示區與他們的模型之間有一些細微差別。是時候為 App 的設計進行最後的修飾，這樣你就可以完工了！

source: Check the mock-up again. Can you spot the differences? You can also try expanding the preview to view the card in different screen sizes.
de: Sieh dir nochmal das Modell an. Siehst du die Unterschiede? Du kannst auch die Vorschau erweitern, um die Karte bei verschiedenen Bildschirmgrößen zu sehen.
es: Vuelve a observar el boceto. ¿Ves las diferencias? También puedes intentar ampliar la vista previa para ver la tarjeta en pantallas de distintos tamaños.
es_419: Revisa el modelo de nuevo. ¿Puedes ver las diferencias? También puedes intentar expandir la vista previa para visualizar la carta en distintos tamaños de pantalla.
fr: Examine à nouveau la maquette. As-tu repéré les différences ? Tu peux également essayer d’agrandir l’aperçu pour voir la carte dans différentes tailles d’écran.
it: Ricontrolla il modello. Riesci a individuare le differenze? Puoi anche provare a espandere l’anteprima per visualizzare la scheda per schermi di diverse dimensioni.
nl: Bekijk het model nog eens. Zie je de verschillen? Je kunt de voorvertoning ook vergroten om de kaart op verschillende schermformaten te zien.
pt: Confira o modelo novamente. Você consegue notar as diferenças? Você também pode tentar expandir a pré‑visualização para visualizar o cartão em vários tamanhos de tela.
sv: Kontrollera modellen igen. Kan du se skillnaderna? Du kan också prova att expandera förhandsvisningen om du vill visa kortet i olika skärmstorlekar.
th: ตรวจสอบตัวอย่างจำลองอีกครั้ง คุณมองเห็นความแตกต่างหรือไม่ คุณยังสามารถลองขยายการแสดงตัวอย่างเพื่อดูบัตรในขนาดหน้าจอต่างๆ ได้อีกด้วย
tr: Modeli yeniden incele. Farkları görebiliyor musun? Kartı farklı ekran boyutlarında görüntülemek için önizlemeyi genişletmeyi de deneyebilirsin.
zh_cn: 再检查一下模型。你有发现差异吗？你还可以试着扩展预览来查看不同屏幕大小的卡片。
zh_tw: 再次檢查模型。你能發現差異嗎？你還可以嘗試擴展預覽來檢視不同螢幕大小的卡片。

source: Expand your preview so it takes up half of your screen.
de: Erweitere deine Vorschau, sodass sie die Hälfte des Bildschirms einnimmt.
es: Amplía la vista previa para que ocupe la mitad de la pantalla.
es_419: Expande tu vista previa para que ocupe la mitad de la pantalla.
fr: Agrandis ton aperçu pour qu’il prenne la moitié de ton écran.
it: Espandi l’anteprima in modo che occupi metà dello schermo.
nl: Vergroot de voorvertoning zodat deze het halve scherm beslaat.
pt: Expanda a pré-visualização para que ela ocupe metade da tela.
sv: Expandera förhandsvisningen så att den fyller halva skärmen.
th: ขยายการแสดงตัวอย่างของคุณเพื่อให้ใช้พื้นที่ครึ่งหนึ่งของหน้าจอของคุณ
tr: Önizlemeni, ekranının yarısını kaplayacak şekilde genişlet.
zh_cn: 扩展预览来使它占据屏幕的一半空间。
zh_tw: 展開預覽讓它使用一半的螢幕。

source: The title of your card needs to align to the left when someone is editing a sleep entry, and centered otherwise. You can use a [ternary operator](glossary://ternary%20conditional%20operator) to specify the alignment for each state.
de: Der Titel deiner Karte muss links ausgerichtet sein, wenn jemand einen Schlafeintrag bearbeitet, und andernfalls rechts. Du kannst die Ausrichtung in jedem Status mithilfe eines [dreigliedrigen bedingten Operators](glossary://ternary%20conditional%20operator) festlegen.
es: El título de la tarjeta debe estar alineado a la izquierda cuando alguien está editando una entrada de sueño y, si no es así, debe estar centrado. Para especificar la alineación en cada estado, puedes usar un [operador ternario](glossary://ternary%20conditional%20operator).
es_419: El título de tu carta debe estar alineado a la izquierda cuando alguien esté editando una entrada de sueño, y debe estar alineado en el centro en cualquier otro momento. Puedes usar un [operador ternario](glossary://ternary%20conditional%20operator) para especificar la alineación que debe tener en cada estado.
fr: Le titre de ta carte doit être aligné à gauche quand quelquʼun modifie une entrée de sommeil. Tu peux utiliser un [opérateur ternaire](glossary://ternary%20conditional%20operator) pour indiquer l’alignement dans chaque état.
it: Il titolo della scheda deve essere allineato a sinistra quando qualcuno sta modificando una voce di sonno e centrato negli altri casi. Puoi utilizzare un [operatore ternario](glossary://ternary%20conditional%20operator) per specificare l’allineamento per ogni stato.
nl: De titel van je kaart moet aan de linkerkant zijn uitgelijnd wanneer iemand een slaapnotitie bewerkt en zijn gecentreerd als dat niet het geval is. Je kunt een [driedelige operator](glossary://ternary%20conditional%20operator) gebruiken om de uitlijning voor beide modi te specificeren.
pt: O título do cartão deve estar alinhado à esquerda quando uma pessoa estiver editando uma entrada de sono e centralizado caso contrário. Você pode usar um [operador ternário](glossary://ternary%20conditional%20operator) para especificar o alinhamento de cada estado.
sv: Titeln på kortet ska vara kantjusterad åt vänster när någon redigerar en sömnpost och centrerad annars. Du kan använda en [trefaldig operator](glossary://ternary%20conditional%20operator) till att ange justeringen för varje läge.
th: ชื่อบัตรของคุณควรจัดให้อยู่ชิดซ้ายเมื่อมีคนกำลังแก้ไขรายการนอนหลับและจัดให้อยู่ตรงกลางในสถานะอื่นๆ คุณสามารถใช้[ตัวดำเนินการแบบสามส่วน](glossary://ternary%20conditional%20operator)เพื่อระบุการจัดแนวสำหรับแต่ละสถานะได้
tr: Kartının başlığı, biri uyku girişini düzenlerken sol tarafa, diğer durumlarda ortaya hizalı olmalıdır. Her bir durum için hizalamayı belirtmek istiyorsan bir [üçlü işleç](glossary://ternary%20conditional%20operator) kullanabilirsin.
zh_cn: 用户编辑睡眠条目时，卡片标题需要左对齐，否则需要居中。你可以使用[三元运算符](glossary://ternary%20conditional%20operator)来指定各个状态下的对齐方式。
zh_tw: 在編輯狀態下，有人在編輯睡眠的條目時，卡片的標題必須對齊左側，否則應該置中。你可以使用[三元運算子](glossary://ternary%20conditional%20operator)來指定每種狀態的對齊方式。

source: Add the code snippet below to correct the alignment of the card title:
de: Füge den Codeabschnitt unten ein, um die Ausrichtung des Kartentitels zu korrigieren:
es: Añade el fragmento de código siguiente para corregir la alineación del título de la tarjeta:
es_419: Agrega el fragmento de código de abajo para corregir la alineación del título de la carta:
fr: Ajoute l’extrait de code ci-dessous pour corriger l’alignement du titre de la carte :
it: Aggiungi il frammento di codice sottostante per correggere l’allineamento del titolo della scheda:
nl: Voeg het onderstaande codefragment toe om de uitlijning van de kaarttitel te corrigeren:
pt: Adicione o fragmento de código abaixo para corrigir o alinhamento do título do cartão:
sv: Lägg till kodsnutten nedan för att rätta till justeringen av kortets titel:
th: เพิ่มส่วนย่อยของโค้ดด้านล่างเพื่อแก้ไขการจัดแนวของชื่อบัตรให้ถูกต้อง:
tr: Kart başlığının hizalamasını düzeltmek için aşağıdaki kod parçacığını ekle:
zh_cn: 添加下方的代码片段来纠正卡片标题的对齐方式：
zh_tw: 加入下方的程式碼片段來修正卡片標題的對齊：

source: Did you notice that in the design specs the title of this card is “How many hours did you sleep?” while the person is in the editing state?
de: Hast du bemerkt, dass der Titel der Karte in den Designvorgaben „Wie viele Stunden hast du geschlafen?“ lautet, während der Bearbeitungsstatus verwendet wird?
es: ¿Te has dado cuenta de que en las especificaciones de diseño el título de esta tarjeta es “¿Cuántas horas has dormido?” mientras que la persona está en estado de edición?
es_419: ¿Observaste que en las especificaciones de diseño el título de esta carta es “¿Cuántas horas dormiste?” mientras la persona está en el estado de edición?
fr: As-tu remarqué que les spécifications de conception du titre de cette carte est « Combien d’heures as-tu dormi ? » lorsque la personne est dans l’état de modification ?
it: Hai notato che nelle specifiche di design il titolo di questa scheda è “Quante ore hai dormito?” mentre la persona è in stato di modifica?
nl: Is het je opgevallen dat in de ontwerpspecificatie de titel van deze kaart 'Hoeveel uren heb je geslapen?' is als iemand zich in de bewerkingsmodus bevindt?
pt: Reparou que nas especificações de design, o título deste cartão era “Quantas horas você dormiu?” enquanto a pessoa estava no estado de edição?
sv: Märkte du att designspecifikationerna säger att titeln på kortet ska vara ”Hur många timmar sov du?” när personen befinner sig i redigeringsläget?
th: คุณสังเกตไหมว่าในข้อกำหนดการออกแบบ ชื่อของบัตรนี้คือ “How many hours did you sleep?” ขณะที่มีคนอยู่ในสถานะการแก้ไข
tr: Tasarım özelliklerinde, kişi düzenleme durumundayken bu kartın başlığında “Kaç saat uyudun?” yazdığını fark ettin mi?
zh_cn: 你注意到了在设计规格中，用户在编辑状态下这个卡片的标题是“你的睡眠小时数是多少？”吗？
zh_tw: 你是否注意到在設計規格中，當有人處於編輯狀態時，這張卡片的標題是「你睡了幾個小時？」？

source: Copy and replace the highlighted text with the code snippet below:
de: Kopiere den Codeabschnitt unten und ersetze damit den hervorgehobenen Text:
es: Copia y sustituye el texto resaltado con el fragmento de código siguiente:
es_419: Copia y reemplaza el texto resaltado con el fragmento de código de abajo:
fr: Copie et remplace le texte en surbrillance par l’extrait de code ci-dessous :
it: Copia e sostituisci il testo evidenziato con il frammento di codice sottostante:
nl: Kopieer en vervang de gemarkeerde tekst door het onderstaande codefragment:
pt: Copie e substitua o texto destacado pelo fragmento de código abaixo:
sv: Kopiera och ersätt den markerade texten med kodsnutten nedan:
th: คัดลอกและแทนที่ข้อความที่ไฮไลท์ด้วยส่วนย่อยของโค้ดด้านล่าง:
tr: Aşağıdaki kod parçacığını kopyala ve vurgulanan metni bununla değiştir:
zh_cn: 使用下方的代码片段，复制并替换高亮标记的文本：
zh_tw: 拷貝並且用下方的程式碼片段取代反白的文字：

source: Text(isEditing ? "How many hours did you sleep?" : "Hours Slept")
de: Text(isEditing ? "Wie viele Stunden hast du geschlafen?" : "Schlafstunden")
es: Text(isEditing ? "¿Cuántas horas has dormido?" : "tiempo de sueño")
es_419: Text(isEditing ? "¿Cuántas horas dormiste?" : "Horas dormidas")
fr: Text(isEditing ? "Combien d’heures avez-vous dormi ?" : "Nombre d’heures de sommeil")
nl: Text(isEditing ? "Hoeveel uur heb je geslapen?" : "Geslapen uren")
pt: Text(isEditing ? "Quantas horas você dormiu?" : "Horas Dormidas")
sv: Text(isEditing ? "Hur många timmar sov du?" : "Sömnlängd")
th: Text(isEditing ? "คุณนอนหลับกี่ชั่วโมง" : "ชั่วโมงที่นอนหลับ")
tr: Text(isEditing ? "Kaç saat uyudun?" : "Uyunan Saat")
zh_cn: Text(isEditing ? "你的睡眠小时数是多少？" : "睡眠小时数")
zh_tw: Text(isEditing ? "你睡了幾個小時？" : "睡眠時數")

source: It’s looking pretty good, but you need to push the card title to the top of the card when in the display state. You can do this by adding a [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
de: Das sieht schon ganz gut aus, aber der Kartentitel sollte im Anzeigestatus an den oberen Rand der Karte geschoben werden. Du kannst dies erreichen, indem du eine Instanz von [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer) hinzufügst.
es: Está quedando bastante bien, pero tienes que empujar el título hacia la parte superior de la tarjeta si se está en el estado de visualización. Puedes hacerlo añadiendo un [separador](doc://com.apple.documentation/documentation/swiftui/spacer).
es_419: Está quedando muy bien, pero debes empujar el título de la carta a la parte superior de la carta cuando se encuentra en estado de visualización. Para hacerlo, puedes agregar un [espaciador](doc://com.apple.documentation/documentation/swiftui/spacer).
fr: Ce n’est pas mal, mais le titre de la carte doit être poussé vers le haut de la carte dans l’état dʼaffichage. Pour ce faire, tu peux ajouter un [espace](doc://com.apple.documentation/documentation/swiftui/spacer).
it: L’aspetto è buono, ma dovresti spingere il titolo della scheda in cima alla scheda nello stato di visualizzazione. Puoi farlo aggiungendo uno [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
nl: Het ziet er al behoorlijk goed uit, maar je moet de kaarttitel naar de bovenkant van de kaart duwen als de weergavemodus actief is. Je kunt dit doen door een [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer) toe te voegen.
pt: Está muito bom, mas você precisa empurrar o título do cartão para a parte superior do cartão quando no estado de exibição. Para fazer isso, você pode adicionar um [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
sv: Det ser rätt så bra ut, men du måste puffa korttiteln till överkanten av kortet i visningsläget. Du kan göra det genom att lägga till en [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer).
th: ดูดีมากเลย แต่คุณต้องผลักชื่อบัตรไปยังด้านบนสุดของบัตรเมื่ออยู่ในสถานะการแสดงผล คุณสามารถทำเช่นนี้ได้โดยเพิ่ม[ที่ว่าง](doc://com.apple.documentation/documentation/swiftui/spacer)
tr: Oldukça iyi görünüyor ama görüntüleme durumunda kart başlığını kartın üst tarafına doğru itmen gerekiyor. Bunu bir [aralayıcı](doc://com.apple.documentation/documentation/swiftui/spacer) ekleyerek yapabilirsin.
zh_cn: 看起来非常棒，但显示状态下，卡片标题需要推至卡片顶部。你可以通过添加 [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer) 来实现。
zh_tw: 看起來不錯，但是在顯示狀態下，你應該將卡片標題推到卡片的頂部。你可以加入 [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer) 來做到這一點。

source: See if you can add the `Spacer` yourself:
de: Probiere alleine aus, `Spacer` hinzuzufügen:
es: Prueba si puedes añadir el `Spacer` sin ayuda:
es_419: Intenta agregar el espaciador (`Spacer`) por tu cuenta:
fr: Regarde si tu peux ajouter le `Spacer` par toi-même :
it: Vedi se riesci ad aggiungere `Spacer` autonomamente:
nl: Kijk of je de `Spacer` zelf kunt toevoegen:
pt: Veja se você consegue adicionar o `Spacer` por conta própria:
sv: Se om du kan lägga till `Spacer` på egen hand:
th: ดูว่าคุณสามารถเพิ่ม `Spacer` ด้วยตัวเองได้หรือไม่:
tr: `Spacer`’ı kendin ekleyip ekleyemeyeceğine bak:
zh_cn: 看看你可不可以自己添加 `Spacer`：
zh_tw: 看看你是否能自己加入 `Spacer`：

source: If you need some help, tap Next.
de: Du brauchst Hilfe? Tippe auf „Weiter“.
es: Si necesitas ayuda, toca Siguiente.
es_419: Si necesitas ayuda, toca Siguiente.
fr: Si tu as besoin d’aide, touche Suivant.
it: Se hai bisogno di aiuto, tocca Avanti.
nl: Tik op 'Volgende' als je hulp nodig hebt.
pt: Se precisar de ajuda, selecione Seguinte.
sv: Tryck på Nästa om du behöver lite hjälp.
th: ถ้าคุณต้องการความช่วยเหลือ ให้แตะถัดไป
tr: Biraz yardıma ihtiyacın varsa Sonraki düğmesine dokun.
zh_cn: 如果需要帮助，轻点“下一页”。
zh_tw: 如果你需要一些協助，請點「下一步」。
